{
   "weather_details": {
      "2024-07-20": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 92,
         "rh_min": 52,
         "wind_speed": 11,
         "wind_direction": 66,
         "cloud_cover": 8
      },
      "2024-07-21": {
         "rainfall": 20,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 91,
         "rh_min": 56,
         "wind_speed": 8,
         "wind_direction": 110,
         "cloud_cover": 8
      },
      "2024-07-22": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 88,
         "rh_min": 59,
         "wind_speed": 9,
         "wind_direction": 234,
         "cloud_cover": 7
      },
      "2024-07-23": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 84,
         "rh_min": 64,
         "wind_speed": 18,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "2024-07-24": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 23,
         "rh_max": 83,
         "rh_min": 58,
         "wind_speed": 20,
         "wind_direction": 248,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "rice",
      "perale",
      "common fish",
      "chicken"
   ],
   "general_advisory": "In transplanted rice at the time of final main field preparation, apply 0.8 ton/acre of well decomposed FYM. For high yielding varieties apply 44kg of DAP+33KG OF MOP or 22kg of Urea+ 125 kg SSP+ 33 kg of MOP as basal dose at the time of last puddling, go for application of pre-emergence weedicide like Butachlor 1kg/ha. Keeping rainfall forecast in mind farmers are advised not to do any type of spray and do proper management in standing crops and vegetable nurseries.",
   "crops_data": {
      "rice": {
         "advisory": [
            "The district has received normal rainfall in the previous month. The direct seeded rice is at 3-4 week stage, The district is going to receive light to medium rainfall in coming five day . Go for Beushaning as enough standing water (7-10cm) will be available. Go for top dressing of 36 kg of urea /acre as top dressing."
         ]
      },
      "perale": {
         "advisory": [
            "There are chances for guava to be infested by fruit rot. Rain or irrigation water must not allow standing near basin of plant. Prune the infected plant part and spray Blitax 3g/ 1lt of water repeat it after 20 days of fruit set and continue till maturity . The fallen rotten and mummified guava must be collected and buried.( Go for application when weather is clear)"
         ]
      },
      "common fish": {
         "advisory": [
            "Make sure to weed out the weeds and kill all the predatory fish before adding fingerlings to the pond. 7-8 days before adding fingerlings , add 120-140 k.g bleaching powder per 1 acre of pond."
         ]
      },
      "chicken": {
         "advisory": [
            "In rainy season chicken might experience Coccidiosis, give Coccidiostat in chicken feed with recommendation of nearest veterinary expert."
         ]
      }
   },
   "date": "19-07-2024"
}