{
   "weather_details": {
      "2024-02-21": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 19,
         "rh_max": 52,
         "rh_min": 17,
         "wind_speed": 7,
         "wind_direction": 180,
         "cloud_cover": 0
      },
      "2024-02-22": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 19,
         "rh_max": 53,
         "rh_min": 15,
         "wind_speed": 10,
         "wind_direction": 234,
         "cloud_cover": 2
      },
      "2024-02-23": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 52,
         "rh_min": 22,
         "wind_speed": 11,
         "wind_direction": 242,
         "cloud_cover": 4
      },
      "2024-02-24": {
         "rainfall": 4,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 48,
         "rh_min": 16,
         "wind_speed": 10,
         "wind_direction": 292,
         "cloud_cover": 6
      },
      "2024-02-25": {
         "rainfall": 6,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 84,
         "rh_min": 24,
         "wind_speed": 8,
         "wind_direction": 105,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "green gram",
      "goat",
      "common fish"
   ],
   "general_advisory": "Current weather allows planting of pineapple. Grow varieties Que, Queen, Simachalan, and Mauritius. Climate and weather allow planting papaya up to March. Grow varieties Honeydew, Kur G Honeydew, Coembatore-1, Coembatore-2, Pusa Delicious, Pusa Majestic, Pusa Dwarf, and Pusa Giant. Do not go for application of any pesticide on Thursday, Friday, Saturday.",
   "crops_data": {
      "green gram": {
         "advisory": [
            "Green gram crop is at pod formation to mature stage. Due to the high regular dew fall and prevailing dry weather, the Powdery mildew disease is going to aggravate in the coming days. So go for foliar application of Sulphur 80% WP per litre of water. (Do not go for application of any fungicide on Thursday, Friday, Saturday.)"
         ]
      },
      "goat": {
         "advisory": [
            "Do vaccination of goat within three months to control P.P.R disease, and in case goats are affected, give them antibiotics like Siproplafaxin, Eneroflaxin, and other multivitamins."
         ]
      },
      "common fish": {
         "advisory": [
            "To prevent any disease/mortality problems, the water quality parameters should be maintained in the range of pH 7.5 to 8.5, Dissolved oxygen 5.0ppm, Temperature 25-30°C, total alkalinity 75-175ppm, total hardness 75-150ppm. Use CIF ABROOD of 3-5 mm diameter sinking pellet type and feed at 3-5% body weight per day for two months prior to breeding for better growth and survival of the spawn and try as well as for early maturation and spawning of brooders."
         ]
      }
   },
   "date": "20-02-2024"
}