{
   "weather_details": {
      "27-03-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 22,
         "rh_max": 70,
         "rh_min": 32,
         "wind_speed": 19,
         "wind_direction": 202,
         "cloud_cover": 4
      },
      "28-03-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 24,
         "rh_max": 75,
         "rh_min": 33,
         "wind_speed": 20,
         "wind_direction": 201,
         "cloud_cover": 2
      },
      "29-03-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 73,
         "rh_min": 31,
         "wind_speed": 20,
         "wind_direction": 202,
         "cloud_cover": 2
      },
      "30-03-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 25,
         "rh_max": 75,
         "rh_min": 34,
         "wind_speed": 22,
         "wind_direction": 202,
         "cloud_cover": 6
      },
      "31-03-2024": {
         "rainfall": 10,
         "t_max": 37,
         "t_min": 25,
         "rh_max": 73,
         "rh_min": 38,
         "wind_speed": 20,
         "wind_direction": 204,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "summer rice",
      "sunflower",
      "sugarcane",
      "greengram",
      "vegetables",
      "fruit"
   ],
   "general_advisory": "As per IMD forecast, Dry weather is expected for the next 4 days and light rain on the last day (31st). As there is a chance of dry weather conditions along with an increase in maximum temperature, farmers are advised to apply fertilizer after draining out excess water under waterlogged conditions and continue spraying operations during that period. Prevailing weather conditions are favorable for pest and disease incidence. Farmers are advised to monitor the fields regularly. Avoid grazing/feeding of cattle during noon hours due to an expected increase in maximum temperature in upcoming days.",
   "crops_data": {
      "summer rice": {
         "advisory": [
            "Farmers are advised to apply top dressing of urea fertilizer in rice plant after draining out excess water.",
            "In summer rice, high infestation of stem borer is observed. Farmers are advised to monitor the activity of stem borer by installing light trap/Pheromone trap and apply appropriate pesticides.",
            "To manage sheath blight & Blast disease in paddy, spray recommended fungicides at the specified rates.",
            "In some places in rice field, BLB infestation noticed so to control this disease apply the specified substances."
         ]
      },
      "sunflower": {
         "advisory": [
            "Remove the collar rot infected plants from the field.",
            "Need-based drenching of specified fungicides is advised to control stem rot & collar rot."
         ]
      },
      "sugarcane": {
         "advisory": [
            "To control early shot borer in sugarcane, foliar spray of Fipronil is advised."
         ]
      },
      "greengram": {
         "advisory": [
            "Prevailing weather conditions may lead to population buildup & infestation of hairy caterpillar & Tobacco caterpillar. To minimize infestation place vegetative traps near the field bund & need-based spray of specified insecticides is recommended.",
            "In summer greengram for the management of Spodoptera litura & pod borer spraying of specified substances is recommended."
         ]
      },
      "vegetables": {
         "advisory": [
            "To control Fruit and shoot borer in Brinjal, spray Neem-based pesticide at the specified rate.",
            "To prevent from wilting or partial wilting in brinjal and tomato apply specified products and spray specified fungicides.",
            "To control Epilachna beetle in brinjal crop, spray specified substances at specified rates.",
            "Spraying of specified substances to minimize damage caused by Red Pumpkin Beetle & Epilachna beetle in cucurbits.",
            "To control little leaf in bitter gourd & other viral diseases of cucurbits uproot the infected plants & spray specified product is recommended."
         ]
      },
      "fruit": {
         "advisory": [
            "To increase fruit size specific actions should be taken.",
            "Spraying of specified substances is recommended to prevent specific pest infestation.",
            "Farmers shouldn’t apply hormone and insecticide at the same time. There should be at least one week gap between their applications."
         ]
      }
   },
   "date": "26-03-2024"
}