{
   "weather_details": {
      "13-04-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 21,
         "rh_max": 44,
         "rh_min": 27,
         "wind_speed": 6,
         "wind_direction": 150,
         "cloud_cover": 4
      },
      "14-04-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 47,
         "rh_min": 18,
         "wind_speed": 8,
         "wind_direction": 270,
         "cloud_cover": 3
      },
      "15-04-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 24,
         "rh_max": 42,
         "rh_min": 20,
         "wind_speed": 6,
         "wind_direction": 202,
         "cloud_cover": 1
      },
      "16-04-2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 45,
         "rh_min": 18,
         "wind_speed": 7,
         "wind_direction": 169,
         "cloud_cover": 1
      },
      "17-04-2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 24,
         "rh_max": 37,
         "rh_min": 15,
         "wind_speed": 7,
         "wind_direction": 206,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "rice",
      "green gram",
      "maize",
      "ground nut",
      "mango",
      "vegetable crops",
      "cow/buffalo"
   ],
   "general_advisory": "There is a chance of increase in temperature after one day, so farmer should take precaution accordingly. Apply light and frequent irrigation to the standing crops, increase the frequency of irrigation at critical growth stages, irrigate only during the evening or early morning and use sprinkler irrigation if possible. Mulching should be done with crop residue, straw / polythene to conserve soil moisture as well as maintain soil temperature. Avoid grazing of animals during noon hours in open place because there is a chance of increase in maximum temperature in upcoming days. Past weather condition is favourable for increasing the population of various insects and diseases in both field as well as vegetable crops so its regular monitoring should be advised.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers are advised to maintain adequate moisture in paddy field at this stage and apply final top dressing of nitrogen fertilizer after draining out excess water from field.",
            "To control yellow stem borer, spraying of Chlorantraniliprole 18.5% SC or Fipronil 5% per liter of water should be advised under clear sky.",
            "For BLB control, farmer should spray Plantomycin or Streptocycline + Copper oxychloride per liter of water twice at an interval of 8 days."
         ]
      },
      "green gram": {
         "advisory": [
            "Looking to the previous rainfall condition, farmers are advised to drain out excess water from crop field.",
            "To control aphids attack in pulse crop, spraying of imidacloroprid or Thiamethoxam per liter of water should be advised under clear weather.",
            "For pod borer attack, spraying of Chlorantraniliprole 18.5% SC or Emamectin Benzoate or Prophenofos per liter of water should be advised when sky is clear."
         ]
      },
      "maize": {
         "advisory": [
            "Farmers should apply top dressing of nitrogen fertilizer under proper soil moisture condition at this stage.",
            "To control stem borer in Maize field, spraying of Fipronil 5% SC or Profenophos 50% EC or for fall army worm, Emamectin Benzoate per liter of water should be advised."
         ]
      },
      "ground nut": {
         "advisory": [
            "Application of Gypsum per acre should be advised at flowering stage on soil surface near to the base of the plant after occurrence of rainfall under adequate moisture condition so that calcium is picked up by the peg and the developing pods"
         ]
      },
      "mango": {
         "advisory": [
            "To control mango hopper in Mango tree, spraying of insecticides like Acephate or Chloropyriphos or Thiomethoxam and for powdery mildew disease, spraying of soluble sulphur should be advised under clear weather condition.",
            "Spraying of Planofix per liters of water should be advised at Mango with pea size fruit stage to reduce fruit drops.",
            "Farmers shouldn’t apply hormone and insecticide at same time. There should be at least one week gap between their applications.",
            "Water logged condition should be avoided in Mango orchard, for this proper drainage of excess water from field should be recommended."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Looking to the previous rainfall condition, farmers are advised to drain out excess water from vegetable field to avoid water logged condition which may leads to root rot and fruit rot diseases.",
            "To control leaf eating caterpillar and fruit borer / shoot and fruit borer in Tomato, Brinjal and Okra spraying of Emamectin Benzoate per liter of water should be advised under clear weather.",
            "Spraying of Tebuconazole + Trifloxystrobin per liter water should be advised to control purple blotch disease in Onion and in case of thrips attack, spraying of imidacloroprid or Thiamethoxam per liter of water or Acetamiprid SP per liters of water should be advised."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "There is a chance of increase in temperature in upcoming week so to protect the animal from heat, farmers should make provision to provide fresh clean and cold drinking water to the animal along with green grass, protein -fat bypass supplement, mineral mixture and salt because temperature is expected to be increased after some days. Keep animals in shade and don’t make them work between 11 am to 4 pm. Cover the shed roof with straw, paint it white or plaster with dung -mud to reduce temperature. In extreme heat condition, spray water and take the animal to a water body to cool off. Make them graze during cooler hours."
         ]
      }
   },
   "date": "12-04-2024"
}