{
   "weather_details": {
      "27-03-2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 72,
         "rh_min": 24,
         "wind_speed": 17,
         "wind_direction": 204,
         "cloud_cover": 0
      },
      "28-03-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 24,
         "rh_max": 80,
         "rh_min": 25,
         "wind_speed": 19,
         "wind_direction": 202,
         "cloud_cover": 0
      },
      "29-03-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 25,
         "rh_max": 79,
         "rh_min": 23,
         "wind_speed": 20,
         "wind_direction": 202,
         "cloud_cover": 2
      },
      "30-03-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 25,
         "rh_max": 78,
         "rh_min": 28,
         "wind_speed": 23,
         "wind_direction": 202,
         "cloud_cover": 4
      },
      "31-03-2024": {
         "rainfall": 0,
         "t_max": 38,
         "t_min": 25,
         "rh_max": 73,
         "rh_min": 30,
         "wind_speed": 22,
         "wind_direction": 207,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "summer rice",
      "sunflower",
      "sugarcane",
      "greengram",
      "vegetables",
      "mustard/pea",
      "mango"
   ],
   "general_advisory": "As per IMD forecast, Dry weather is expected for next 5 days. As there is a chance of dry weather condition along with an increase in maximum temperature expected during upcoming days, farmers are advised to apply fertilizer after draining out excess water under waterlogged conditions and continue spraying operations during that period. Prevailing weather conditions are favorable for pest and disease incidence, so farmers are advised to monitor the fields regularly. Avoid grazing/feeding of cattle during noon hours due to an expected increase in maximum temperature.",
   "crops_data": {
      "summer rice": {
         "advisory": [
            "Farmers are advised to apply top dressing of urea fertilizer in rice plants after draining out excess water.",
            "In summer rice, high infestation of stem borer is observed, so farmers are advised to monitor the activity of stem borer and apply appropriate treatments.",
            "To manage sheath blight & blast disease in paddy, specific sprays are recommended.",
            "In some places in rice fields, brown leafhopper infestation is noticed, applying control measures is recommended."
         ]
      },
      "sunflower": {
         "advisory": [
            "Remove the collar rot infected plants from the field.",
            "Need-based drenching is advised to control stem rot & collar rot."
         ]
      },
      "sugarcane": {
         "advisory": [
            "To control early shot borer in sugarcane, foliar spray of Fipronil is advised."
         ]
      },
      "greengram": {
         "advisory": [
            "Prevailing weather conditions may lead to population buildup & infestation of hairy caterpillar & tobacco caterpillar, specific controls are recommended."
         ]
      },
      "vegetables": {
         "advisory": [
            "Various sprays are recommended to control pests and diseases in vegetables."
         ]
      },
      "mustard/pea": {
         "advisory": [
            "Specific treatments are advised to increase fruit size and prevent fruit drop in mustard and pea crops.",
            "Control measures for pests like mealy bug & mango hopper are recommended."
         ]
      },
      "mango": {
         "advisory": [
            "Specific spray recommendations to control pests in mango trees."
         ]
      }
   },
   "date": "26-03-2024"
}