{
   "weather_details": {
      "03-02-2024": {
         "rainfall": 0.8,
         "t_max": 32.0,
         "t_min": 16.0,
         "rh_max": 0,
         "rh_min": 0,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "10-02-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 16,
         "rh_max": 43,
         "rh_min": 24,
         "wind_speed": 11,
         "wind_direction": 68
      },
      "11-02-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 44,
         "rh_min": 24,
         "wind_speed": 10,
         "wind_direction": 90
      },
      "12-02-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 18,
         "rh_max": 45,
         "rh_min": 23,
         "wind_speed": 9,
         "wind_direction": 75
      },
      "13-02-2024": {
         "rainfall": 4,
         "t_max": 27,
         "t_min": 19,
         "rh_max": 57,
         "rh_min": 25,
         "wind_speed": 9,
         "wind_direction": 288
      },
      "14-02-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 18,
         "rh_max": 62,
         "rh_min": 25,
         "wind_speed": 9,
         "wind_direction": 116
      }
   },
   "names_of_crops": [
      "rice",
      "sugarcane",
      "blackgram",
      "rapeseed & mustard",
      "vegetables",
      "pisciculture",
      "animal science"
   ],
   "general_advidory": "Farmers are advised to give necessary irrigation to field & vegetable crops.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers those have already completed transplanting, apply granular herbicide Bensulfuron - methyl + Pretilachlor @ 4kg / acre at 5 -8 days after transplanting.",
            "Utilising the available water (Rainfall/Irrigation) puddle the land & complete the transplanting of summer rice with basal application of 35 kg DAP,20 kg MOP &10 kg ZnSO 4 /acre.",
            "In bacterial blight endemic areas, dip the seedling roots in 0.1% (1g in one litre of water) Plantomycin solution before transplanting for 30 minutes."
         ]
      },
      "sugarcane": {
         "advisory": [
            "In Ratoon crop of sugarcane remove the disease & pest infected plants and dispose the grassy shoot infected plant followed by recommended fertilizer application & spraying of Fipronil 5 Sc @2ml/l of water recommended.",
            "Sugarcane Sett treatment with (Metalaxyl + Mancozeb)@2g/l Of water is recommended to decrease the incidence of diseases like Red Rot & Wilt."
         ]
      },
      "blackgram": {
         "advisory": [
            "To reduce incidence of Powdery mildew, Anthracnose & Stem rot in blackgram spraying of (Tebuconazole + Sulphur) @500g/acre recommended.",
            "To control aphids during primary stage of pest infestation spray Neem Based Pesticide (Azadirachtin) 1500 PPM @ 600 ml/acre. Then spray Thiamethoxam 25% W.G @ 40 gram/acre or Acetamiprid 20% S.P. @ 50 17.8% SL @ 60 -ml/acre or Imidacloprid by mixing in 200 litres of water."
         ]
      },
      "rapeseed & mustard": {
         "advisory": [
            "The mustard/Toria crop is at the flowering to pod filling stage. Aphids in Mustard and Toria can be controlled by spraying Dimethoate 30% EC @ 2 ml/lit.",
            "To control Mustard Sawfly, Leaf Webber and Tobacco Caterpillar infestation in mustard crop at early stage spray Neem -based pesticide (Neem Oil 1500 PPM) @ 600 -ml/acre by mixing in 200-litre of water. Spraying of Insecticide should be done at the afternoon hours to protect the honeybees & other beneficial insects."
         ]
      },
      "vegetables": {
         "advisory": [
            "Sowing of Recommended HYV/Hybrid of Cucurbits after treating the seeds with Imidachloprid 600FS@(8 -10)ml/kg seeds to minimize the incidence of viral /phytoplasma incidence.",
            "Spraying Of Acephate @250g/acre along with neem oil formulation 600ml/acre to minimize damage caused by Red Pumpkin Bettle in cucurbits.",
            "To prevent from wilting or partial wilting in brinjal and tomato apply Neem or Karanjaa cake and spray Tebuconazole fungicide @ 1ml/liter to plant and plant base.",
            "Provide bamboo or wooden stake for better fruit set and growth of Tomato plants.",
            "For minimizing the infestation of sucking insect pests like white fly, leaf hopper,thirps and aphid in vegetables nursery and main field, spray Thiamethoxam @ 0.4g/litre of water or Difenthurian @1g/li Of water.",
            "To control leaf eating caterpillar and fruit borer in winter vegetables like Brinjal, Cole crops, Chilly & tomato apply 0.5 g Emamectin benzoate or Spinosad 0.4 ml/ liter of water."
         ]
      },
      "pisciculture": {
         "advisory": [
            "The fishes should be fed daily with oil cake bran mixture at the rate of 2 -3 % of their total biomass."
         ]
      },
      "animal science": {
         "advisory": [
            "Animals should be given mineral mixture along with salt regularly and wheat grains, jaggery etc. may be provided @ 10% -20% in the daily ration during winter season to meet the energy requirement of the animals."
         ]
      }
   },
   "date": "09-02-2024"
}