{
   "weather_details": {
      "01/06/2024": {
         "rainfall": 4,
         "t_max": 37,
         "t_min": 27,
         "rh_max": 88,
         "rh_min": 31,
         "wind_speed": 13,
         "wind_direction": 122,
         "cloud_cover": 4
      },
      "02/06/2024": {
         "rainfall": 4,
         "t_max": 38,
         "t_min": 27,
         "rh_max": 83,
         "rh_min": 27,
         "wind_speed": 10,
         "wind_direction": 152,
         "cloud_cover": 5
      },
      "03/06/2024": {
         "rainfall": 2,
         "t_max": 38,
         "t_min": 27,
         "rh_max": 87,
         "rh_min": 18,
         "wind_speed": 11,
         "wind_direction": 124,
         "cloud_cover": 4
      },
      "04/06/2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 26,
         "rh_max": 33,
         "rh_min": 16,
         "wind_speed": 10,
         "wind_direction": 225,
         "cloud_cover": 4
      },
      "05/06/2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 25,
         "rh_max": 49,
         "rh_min": 15,
         "wind_speed": 10,
         "wind_direction": 238,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "pulses",
      "vegetables",
      "rabi paddy",
      "dhaincha",
      "ginger",
      "sunflower",
      "onion"
   ],
   "general_advisory": "Due to the rain received, go for summer cultivation and mechanized cultivation will invert the soil and pest and pathogen will be exposed to the sun and get killed. In case of shortage of water, go for alternate row irrigation method for better utilization of water which saves around 50% water. Also the drip irrigation system in Orchard saves water. Sprinkling irrigation method reduces the effect of high temperature. Farmers are advised to avoid exposure outside during the peak heat hours of the day.",
   "crops_data": {
      "pulses": {
         "advisory": [
            "Harvest the crop at maturity stage."
         ]
      },
      "vegetables": {
         "advisory": [
            "Due to temperature effect in brinjal Foot & Shoot borer can be managed by application of Neem based pesticides 330 ppm @ 1 liter per acre."
         ]
      },
      "rabi paddy": {
         "advisory": [
            "Early sown rabi crops like Pulses, Oilseeds crop are at harvesting stage. The Vegetables are at harvesting stage. The overall crop condition is normal."
         ]
      },
      "dhaincha": {
         "advisory": [
            "In areas where rain is received, go for sowing the Dhaincha seeds @ 10kg/ac which should be incorporated in the field at 3 weeks stage prior to main kharif crop cultivation. It will condition the soil and add organic matter in the soil."
         ]
      },
      "ginger": {
         "advisory": [
            "Collect good quality ginger Rhizomes namely Suprava, Suruchi, Suravi. Seed rate is 6 -8 q/ac. Each piece should be 20 g and contain 2 -3 eyes. Treat the seeds before planting in the field."
         ]
      },
      "sunflower": {
         "advisory": [
            "For good seed filling, apply 2 -3 g of Borax/liter of water. Early sown crop when the lower side of head turns yellow, go for cutting the head and dry it under sun for 4 -5 days. If fruit borer attacks then go for spraying Bioinsecticide NPV @ 250 LE mixed in 200 Liters of water."
         ]
      },
      "onion": {
         "advisory": [
            "Harvest the onion leaving 2 -3 cm from the neck and cut all the roots and dry it under shed during high temperature."
         ]
      }
   },
   "date": "31-05-2024"
}