{
   "weather_details": {
      "10/02/2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 18,
         "rh_max": 56,
         "rh_min": 18,
         "wind_speed": 5,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "11/02/2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 19,
         "rh_max": 45,
         "rh_min": 20,
         "wind_speed": 5,
         "wind_direction": 108,
         "cloud_cover": 2
      },
      "12/02/2024": {
         "rainfall": 4,
         "t_max": 28,
         "t_min": 20,
         "rh_max": 48,
         "rh_min": 22,
         "wind_speed": 6,
         "wind_direction": 116,
         "cloud_cover": 4
      },
      "13/02/2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 20,
         "rh_max": 55,
         "rh_min": 27,
         "wind_speed": 7,
         "wind_direction": 144,
         "cloud_cover": 8
      },
      "14/02/2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 19,
         "rh_max": 61,
         "rh_min": 25,
         "wind_speed": 7,
         "wind_direction": 109,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "high yielding pulses",
      "paddy nursery management",
      "sri paddy",
      "ragi",
      "summer groundnut",
      "rabi pulses crop",
      "wheat",
      "chilli",
      "sunflower",
      "potato",
      "toria",
      "animal",
      "poultry"
   ],
   "general_advidory": "Due to low temperature, apply thin layer of dry FYM on nursery to maintain the temperature. Start sowing the summer crops when the temperature is conducive for germination.",
   "crops_data": {
      "high yielding pulses": {
         "advisory": "National crops of pulses with high yield in dry season are: - Mung varieties IPM-02-14 (65 days), IPM-02-3 (65 days), PDM-11 (65 days), PDM-54 (60 to 65 days). Durga (60 to 65 days), Samrat (65 to 70 days), K-851 (60 to 65 days) and pear varieties – Sarla (65 to 70 days), PU-31 (70 days), PU-30 (65 to 70 days), PU-35 (65 to 70 days), PU-19 (65 to 70 days) etc. collect and sow in the land 25 kg of seeds (500 gm) are required per hectare."
      },
      "paddy nursery management": {
         "advisory": "Apply light irrigation in the nursery. Keep standing water in the paddy nursery 15 days onwards of sowing. At 15 days apply 4 kg urea for proper vigor of seedlings. Finish the nursery preparation work at the end of January month. For this, use light and medium varieties of seeds. At the time of last cultivation, 40 baskets of cow dung manure, 12 kg Single Super Phosphate and 02 kg of muriate of potash fertilizer to the soil."
      },
      "sri paddy": {
         "advisory": "Prepare the paddy nursery and transplant the 10-12 days old seedlings on the main field."
      },
      "ragi": {
         "advisory": "When the seedlings are 3 week old, transplant them in 20cm x 10cm spacing. If soil is not tested, apply 24:12:12 kg NPK per acre. Out of this, apply 50% of N along with full dose of phosphorus and potash as basal dose."
      },
      "summer groundnut": {
         "advisory": "If gypsum is not applied at sowing, apply it in lines @ 50kg/acre or broadcast 100 kg Gypsum per acre."
      },
      "rabi pulses crop": {
         "advisory": "Harvest when 90 percent of mungbean pods and pea crops are at ripen stage. After harvesting, dry and store the seeds for 2-3 days in a dry place."
      },
      "wheat": {
         "advisory": "In order to control the black spot disease in wheat crop, bury or burn the affected trees in the soil and sprinkle 022 grams of carbendazim in 022 liters of water per acre. Pay attention to watering during flowering and flowering."
      },
      "chilli": {
         "advisory": "If leaf spot appears in pepper crop, spray leaves with 0 ml of abamectin 9.1 % or 9.1 to 0 ml of ethion per liter of water."
      },
      "sunflower": {
         "advisory": "At 25 to 30 days after sowing the sunflower, apply 6-8 kg nitrogen per acre. Go for thinning operation."
      },
      "potato": {
         "advisory": "Without any delay complete sowing of Potato. Seed rate is 6-8q/ac. Good varieties are Kufri Pokhraj, Kufri Lalima, Kufri chipsona. The seed weight should be 25-35 g per piece and having 2-3 eyes."
      },
      "toria": {
         "advisory": "Due to powdery mildew, apply 1 kg sulphur powder in 200 liters of water per acre."
      },
      "animal": {
         "advisory": "Keep clean and dry the animal shed. Arrange smoke of neem leaves near to animal shed for preventive measures of diseases. Provide need based animal vaccination in consultation with line department. Animals should be given the wheat grains, jaggery and the mixture of mineral with white salt at the daily basis all these may be provided @ 05-15% in the daily ration basis. Due to forecast of decreasing temperature, cover the animal shed specially in nights."
      },
      "poultry": {
         "advisory": "Add half a gram of furasil to 1 liter of water for 3 days. To control chicken rabies, administer Lasota vaccine within the first 7 days and administer IBT eye drops within 13-15 days."
      }
   },
   "date": "09-02-2024"
}