{
   "weather_details": {
      "2024-12-10": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 17,
         "rh_max": 91,
         "rh_min": 48,
         "wind_speed": 3,
         "wind_direction": 21,
         "cloud_cover": 4
      },
      "2024-12-11": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 15,
         "rh_max": 85,
         "rh_min": 39,
         "wind_speed": 3,
         "wind_direction": 32,
         "cloud_cover": 2
      },
      "2024-12-12": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 77,
         "rh_min": 31,
         "wind_speed": 3,
         "wind_direction": 21,
         "cloud_cover": 0
      },
      "2024-12-13": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 14,
         "rh_max": 64,
         "rh_min": 28,
         "wind_speed": 3,
         "wind_direction": 21,
         "cloud_cover": 0
      },
      "2024-12-14": {
         "rainfall": 0,
         "t_max": 26,
         "t_min": 13,
         "rh_max": 62,
         "rh_min": 24,
         "wind_speed": 4,
         "wind_direction": 17,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "rice",
      "black gram",
      "menacinakahi",
      "chilli",
      "cabbage",
      "tomato",
      "cow",
      "common fish",
      "plant protection"
   ],
   "general_advisory": "The mean maximum daily temperature was 31.9°C and the mean minimum daily temperature was 18.6°C of the Gajapati district during the last week. The district received 02.3 mm of rainfall during the last week. Provide light irrigation to standing vegetables and crops during morning hours to prevent damage from fog, low temperature, and moisture stress. Due to low night temperature and fog condition, there will be a chance of infestation of sucking pests, leaf blight, powdery mildew in the Rabi crops and vegetables. Monitor the crops and vegetables, if symptoms are noticed, undertake appropriate plant protection measures. Carry out weeding, hoeing, and other intercultural operations in Rabi vegetables. In Cole crops irrigation should be done at 7-8 Days interval depending upon soil moisture and weather condition. In winter during cold hours farmers should keep doors, windows and open spaces in cow sheds covered with polythene or gunny bag curtains to prevent direct contact with cold air. For maintaining the heat in the poultry shed during the winter season, install heaters in the shed.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Soon after noticing the infestation of the stored grain insect pest, take up fumigation by using Aluminium phosphide (do not use in dwelling houses) tablets @ of 3 tablets/ ton grain (total 9 g of tablets) in fairly airtight containers or by covering with thick tarpaulin leaving no gaps. The tablets should be wrapped in cotton pouches before placing them in the stacks. All the corners of plastic cover should be plastered with a 6-inch thick layer of mud/adhesive tapes to prevent leakage of gas. Minimum exposure period is for about 7-10 days."
         ]
      },
      "black gram": {
         "advisory": [
            "There is a chance of powdery mildew disease in Black gram and Green gram. To control this disease, spray Sulphur 80% WP @ 800 g/acre or Hexaconazole 5% E.C @ 300 ml/acre."
         ]
      },
      "menacinakahi": {
         "advisory": [
            "To control aphids and thrips in chilli during the primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. Spray Thiamethoxam 25 % WG @ 40 g/acre or Acetamiprid 20% S.P. @ 50 g/acre or Profenophos 40 % + Fenpyroximate 2.5 % EC @ 400-ml/acre."
         ]
      },
      "chilli": {
         "advisory": [
            "To control aphids and thrips in chilli during the primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. Spray Thiamethoxam 25 % WG @ 40 g/acre or Acetamiprid 20% S.P. @ 50 g/acre or Profenophos 40 % + Fenpyroximate 2.5 % EC @ 400-ml/acre."
         ]
      },
      "cabbage": {
         "advisory": [
            "To manage Diamond Back Moth install 6-8 nos of light traps per acre. During the primary stage of pest infestation spray neem-based pesticide (Azadirachtin) 300 PPM @ 1-litre/acre by mixing in 200-litre of water. Spray Tolfenpyrad 15 % EC @ 400-ml/acre or Flubendiamide 20 % WG @ 20-gram/acre or Emamectin Benzoate 5 % SG @ @80-gram/acre by mixing in 200-litre of water."
         ]
      },
      "tomato": {
         "advisory": [
            "Use yellow sticky traps @ 8-10/acre to attract and kill the insects. During the primary stage of pest infestation spray neem-based pesticide (Azadirachtin) 1500 PPM @ 600 ml/acre by mixing in 200-litre of water. Spray Thiamethoxam 25 % WG @ 40 g/acre or Pyriproxifen 10% EC @ 200 ml/acre or Spiromesifen 22.9% SC @ 250 ml/acre by mixing in 200-litre of water."
         ]
      },
      "cow": {
         "advisory": [
            "Animal’s shed and its floor should not remain wet and cool for longer periods of time. This may expose the animals, especially younger ones, to various ailments like pneumonia, fever, coccidiosis, diarrhea, and even death in severe cases. Good ventilation must be ensured during winter."
         ]
      },
      "common fish": {
         "advisory": [
            "During winters, there is a possibility of “EUS” disease in fish. Farmers are advised to apply Cifax @ 400 ml mixed with 40 liters of water in one acre pond area as a preventive measure. The fishes should be fed daily with oil cake bran mixture at the rate of 2-3 % of their total biomass."
         ]
      },
      "plant protection": {
         "advisory": [
            "To control leaf eating caterpillar and fruit borer in winter vegetables like brinjal, cauliflower, cabbage, chilly & tomato apply 0.5 g Emamectin benzoate or 0.4 ml Spinosad per liter of water."
         ]
      }
   },
   "date": "10-12-2024"
}