{
   "weather_details": {
      "2024-06-19": {
         "rainfall": 3,
         "t_max": 41,
         "t_min": 28,
         "rh_max": 85,
         "rh_min": 27,
         "wind_speed": 9,
         "wind_direction": 248,
         "cloud_cover": 5
      },
      "2024-06-20": {
         "rainfall": 5,
         "t_max": 40,
         "t_min": 27,
         "rh_max": 74,
         "rh_min": 38,
         "wind_speed": 8,
         "wind_direction": 243,
         "cloud_cover": 5
      },
      "2024-06-21": {
         "rainfall": 6,
         "t_max": 38,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 65,
         "wind_speed": 6,
         "wind_direction": 244,
         "cloud_cover": 6
      },
      "2024-06-22": {
         "rainfall": 10,
         "t_max": 37,
         "t_min": 25,
         "rh_max": 76,
         "rh_min": 44,
         "wind_speed": 8,
         "wind_direction": 270,
         "cloud_cover": 7
      },
      "2024-06-23": {
         "rainfall": 10,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 84,
         "rh_min": 61,
         "wind_speed": 5,
         "wind_direction": 270,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "rice",
      "cotton",
      "goat",
      "common carp"
   ],
   "general_advisory": "The mean maximum daily temperature was 39.1°C and the mean minimum daily temperature was 27.6°C of the Gajapati district during the last week. The district received 06.9 mm of rainfall during the last week. Go for non-paddy crops in the upland to avoid terminal drought. Intercropping of cereals+pulses/oilseeds is recommended. Go for early sowing/transplanting as for as possible to complete these by mid-August. Go for medium duration rice varieties in medium land. Go for line sowing of rice followed by early beaushaning and weeding. This will avoid the rainfall required for transplanting, and over -aged seedlings if transplanted late.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Upland rice varieties (Matures in 100-120 days) like Khandagiri, Sahabhagi Dhan, DRR-42, DRR-44, DRR-46, Mandakini, Naveen, GB-1, Bina-1 1, MTU-1010, Satyabhama etc. can be cultivated. Medium land rice varieties (Matures in 120-140 days) like MTU 1 156, MTU 1 153, CR Dhan 310, RGL 2538, Lalat, Improved Lalat, Manaswini, MTU-1001, Sampada, Gitanjali, Nua acharmati etc can be cultivated. Low land rice varieties (Matures >140 days) like Pratikshya, Swarna, Swarna Sub-1, RGL-2537, MTU-1075, Mrinalini, Hashanta, Rani Dhan, CR 1009, CR 1009 Sub-1, DRR 50, Pooja, MTU-1064, CR-1018, Sarala, Durga, Pradhan Dhan, Nua Kalajeera, Nua chinikamini, CR Sungadhi Dhan-907 etc can be cultivated. Before sowing, seed treatment can be done with Carbendazim 50 % WP @ 2- gram/ kg of seeds or Carboxin 37.5 % + Thiram 37.5% D.S WP or thiram 75 % WS @ 3 gm/kg of seeds."
         ]
      },
      "cotton": {
         "advisory": [
            "After monsoon rain fall go for ploughing. Plough the field with mould board plough or disc plough for deep ploughing. Keep the field clean. Apply 2 tonne of compost during last ploughing. Purchase suitable hybrid seeds and fertilizers from licenced dealer . Avoid growing longer duration hybrids in Rainfed area."
         ]
      },
      "goat": {
         "advisory": [
            "By using sand over the floor we can keep the floor dry so that the animals are kept free from different diseases. The speciality of this shed is the floor is made of bricks and cement and sand from river is spread over it by a thickness of 4-6 inches. The sand soaks the urine so that the animals can sleep over it comfortably. It is also easier to clean the faecal material over the sand floor. To keep the sand dry it is stirred upside down in 15-20 days interval. The floor space requirement for kid is 0.5, for adult 1.2, for buck and pregnant female 2 square metre floor space is necessary which is suitable for every type of shed."
         ]
      },
      "common carp": {
         "advisory": [
            "Carp such as Rohu, Catla and Mrigal, which grow rapidly, should be stocked in a certain ratio of 4:3:3 to increase the benefits. Generally, a density of 5,000 fingerlings/ha is kept as a standard stocking. Groundnut oil cake and rice bran is given in same ratio @ 5% of the total biomass of stocking material. Cow dung, urea and super phosphate should be applied to increase pond quality. In 8-10 months, fishes attain their marketable size."
         ]
      }
   },
   "date": "18-06-2024"
}