{
   "weather_details": {
      "21-02-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 21,
         "rh_max": 79,
         "rh_min": 20,
         "wind_speed": 12,
         "wind_direction": 248,
         "cloud_cover": 0
      },
      "22-02-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 22,
         "rh_max": 69,
         "rh_min": 17,
         "wind_speed": 17,
         "wind_direction": 207,
         "cloud_cover": 3
      },
      "23-02-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 82,
         "rh_min": 31,
         "wind_speed": 17,
         "wind_direction": 225,
         "cloud_cover": 5
      },
      "24-02-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 82,
         "rh_min": 20,
         "wind_speed": 12,
         "wind_direction": 158,
         "cloud_cover": 7
      },
      "25-02-2024": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 85,
         "rh_min": 38,
         "wind_speed": 11,
         "wind_direction": 105,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "sugarcane",
      "blackgram",
      "rapeseed & mustard",
      "vegetables",
      "pisciculture",
      "animal science"
   ],
   "general_advisory": "Drain out excess water from paddy field. Regular surveillance work should be done in all crops to know the incidence of various disease pests and initiate control strategies.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Due to increased difference between daily maximum and minimum temperature, blast infestation may occur. In case of Leaf blast infestation, spray Tebuconazole 50% + Trifloxystrobin 25% WG @ 80 g/acre in 200 litres of water. Repeat the spray at 7-10 days interval.",
            "Utilize available water for puddling the land and complete transplanting of summer rice with basal application of 35 kg DAP, 20 kg MOP & 10 kg ZnSO4 per acre."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Collect setts from cane of a 6-8-month-old plant crop free from diseases and insect pests for better sprouting.",
            "Sett Rot management: Basal drenching with Carbendazim 12% + Mancozeb 63% @ 400 gram/acre or foliar spray with Metalaxyl 8% + Mancozeb 64% WP @ 400 grams/acre.",
            "Remove disease & pest infected plants in ratoon crop. Dispose of grassy shoot infected plants. Follow recommended fertilizer application & spraying of Fipronil 5 SC @ 2ml/l of water.",
            "After harvesting sugarcane, protect the cane hips from termite attack. Spray Bifenthrin @ 30 ml in 15 liters of water."
         ]
      },
      "blackgram": {
         "advisory": [
            "To reduce incidence of Powdery mildew, Anthracnose & Stem rot, spray (Tebuconazole + Sulphur) @ 500g/acre.",
            "To control aphids, spray Neem Based Pesticide (Azadirachtin) 1500 PPM @ 600 ml/acre. Then spray Thiamethoxam 25% WG @ 40 grams/acre or Acetamiprid 17.8% SL @ 60 ml/acre."
         ]
      },
      "rapeseed & mustard": {
         "advisory": [
            "Mustard/Toria crop is at flowering to pod filling stage. Control aphids by spraying Dimethoate 30% EC @ 2 ml/lit.",
            "To control Mustard Sawfly, Leaf Webber, and Tobacco Caterpillar infestation, spray Neem-based pesticide (Neem Oil 1500 PPM) @ 600 ml/acre."
         ]
      },
      "vegetables": {
         "advisory": [
            "In Cucurbits, spray Acephate @ 250g/acre along with neem oil to minimize damage caused by Red Pumpkin Beetle.",
            "To manage Epilachna Beetle in cucumber, spray neem-based pesticide (Neem Oil 1500 PPM) Azadiractin @ 600 ml/acre of water.",
            "For Tomato & Brinjal, start sowing tomato seeds for summer cultivation. Apply Neem or Karanjaa cake to prevent wilting. Provide bamboo or wooden stake for better fruit set and growth. To control sucking insect pests, spray Thiamethoxam or Difenthurian."
         ]
      },
      "pisciculture": {
         "advisory": [
            "Symptoms of white spot disease in fish include small white rash and excessive mucus secretion. Treat affected fish by bathing in water mixed with salt for 5 minutes. Repeat for 7-10 days."
         ]
      },
      "animal science": {
         "advisory": [
            "Animals should be given mineral mixture along with salt regularly. Provide wheat grains, jaggery, etc. @ 10%-20% in daily ration during winter season to meet energy requirements."
         ]
      }
   },
   "date": "20-02-2024"
}