{
   "weather_details": {
      "01-06-2024": {
         "rainfall": 0,
         "t_max": 45,
         "t_min": 31,
         "rh_max": 73,
         "rh_min": 16,
         "wind_speed": 12,
         "wind_direction": 116,
         "cloud_cover": 4
      },
      "02-06-2024": {
         "rainfall": 0,
         "t_max": 44,
         "t_min": 30,
         "rh_max": 54,
         "rh_min": 20,
         "wind_speed": 14,
         "wind_direction": 198,
         "cloud_cover": 5
      },
      "03-06-2024": {
         "rainfall": 2,
         "t_max": 43,
         "t_min": 29,
         "rh_max": 50,
         "rh_min": 18,
         "wind_speed": 12,
         "wind_direction": 288,
         "cloud_cover": 5
      },
      "04-06-2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 28,
         "rh_max": 36,
         "rh_min": 16,
         "wind_speed": 14,
         "wind_direction": 248,
         "cloud_cover": 4
      },
      "05-06-2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 27,
         "rh_max": 26,
         "rh_min": 13,
         "wind_speed": 14,
         "wind_direction": 279,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "summer rice",
      "kharif rice",
      "mango",
      "vegetable crops",
      "cow/buffalo",
      "poultry"
   ],
   "general_advisory": "To protect the crop and animal from increasing temperature/heat wave or heat stress farmers should take some protective measures like applying light and frequent irrigation to the standing crops, increase the frequency of irrigation at critical growth stages, irrigate only during the evening or early morning and use sprinkler irrigation if possible. Mulching should be done with crop residue, straw / polythene to conserve soil moisture as well as maintain soil temperature. Avoid grazing of animal during noon hours in open place. Farmers those are already harvested their paddy crops are advised to go for one deep summer ploughing to control insect and pest population and start preparation of field for kharif crop cultivation.",
   "crops_data": {
      "summer rice": {
         "advisory": [
            "As there is very less chance of occurrence rainfall in upcoming week, farmers are advised to start harvesting of crop as soon as possible and store the crop in safe place after proper sun drying. After proper drying, grains should be stored in Super Grain Bag to retain the quality, texture, colour, aroma and taste of grain for longer period of time, extend the germination life of seed, control insect grain pests (without using chemical) etc."
         ]
      },
      "kharif rice": {
         "advisory": [
            "Preparation of field for kharif crop production should be started with a deep summer ploughing after harvesting of summer rice or in fallow land and leave as such for direct exposure of sunlight which helps in minimizing weed flora and insect attack.",
            "Some of the improved rice varieties such as Khandagiri, Sahabhagi Dhan, Mandakini, Naveen etc., for upland, MTU 1156, MTU 1153, Lalat, Improved Lalat, MTU-1001, MTU-1010 for medium land and Grmin Krishi Mausam Sewa India Meteorological Department Orissa University of Agriculture and Technology RRTTS, Chiplima, Sambalpur."
         ]
      },
      "mango": {
         "advisory": [
            "Presently, most of the Mango fruits are at its physiological maturity stage so harvesting of mango fruits should be advised through hand picking or plucking with a harvester.",
            "To control fruit fly attack, use of fruit fly trap should be advised.",
            "For control of black tip and internal necrosis, spraying of borax (1%) should be advised.",
            "For new planting in rainy season, farmers are advised to start digging of pits before onset of monsoon and leave that for direct exposure of sun to kill insects and their eggs."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Prevailing weather condition is favorable for increasing the sucking insect pest population in vegetable crops so its regular monitoring should be advised. If attack of those insects is noticed, then spraying of Thiamethoxam 25% WG @ 0.2-0.3g or Imidacloprid 17.8% SL @ 0.3ml per liter of water should be advised.",
            "To control fruit and shoot borer / fruit borer attack in Tomato, Brinjal and Okra spraying of Emamectin Benzoate @ 0.4 g per liter of water should be advised under clear weather."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "To protect the animal from heat wave, farmers should make provision to provide fresh clean and cold drinking water to the animal along with green grass, protein-fat bypass supplement, mineral mixture and salt. Keep animals in shade and don't make them work between 11 am to 4 pm. Deworming and vaccination of animal should be ensured before commencement of monsoon to avoid spreading of diseases during rainy season."
         ]
      },
      "poultry": {
         "advisory": [
            "During heat wave period covering the window with wet gunny bag and thatching of roof with straw and make provision to ensure proper ventilation and cooling of poultry shed. Feeding will be continued with supplement of vitamin E and C with water till the end of heat wave. Deworming and vaccination of poultry birds against ranikhet disease must be ensured."
         ]
      }
   },
   "date": "31-05-2024"
}