{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 42,
         "wind_speed": 16,
         "wind_direction": 63,
         "cloud_cover": 7
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 85,
         "rh_min": 47,
         "wind_speed": 10,
         "wind_direction": 101,
         "cloud_cover": 8
      },
      "22-07-2024": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 87,
         "rh_min": 53,
         "wind_speed": 12,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 64,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 77,
         "rh_min": 60,
         "wind_speed": 24,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "vegetable"
   ],
   "general_advisory": "As there is a chance of occurrence of light to moderate rainfall along with heavy rainfall in one or two places in upcoming days, farmers are advised to avoid irrigation as well as spraying operation during that period and should wait some days for transplanting of rice and planting of fruit and vegetable crops. Looking to the high wind speed condition make provision to support the crops.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Nursery sowing should be completed by end of 2nd fortnight of July. Keep 3 pheromone traps /acre of rice nursery for monitoring the stem borer and leaf folder infestation. Whenever the number of male moths/trap reaches 4 or 5 apply Azadirachtin 0.15% EC @..."
         ]
      },
      "maize": {
         "advisory": [
            "The ideal sowing time is June 20 to end of July for kharif maize. However, this will be dependent on the time of onset of monsoon. In fields where water stagnation may occur, early sowing is desirables so that plant reaches a firm stand to avoid lodging due to ..."
         ]
      },
      "vegetable": {
         "advisory": [
            "Farmers should start raised bed nursery preparation for kharif vegetable crops with proper drainage system to avoid water logging. Kharif vine vegetables should be prepared in the bags. Looking to the upcoming rainfall condition, farmers should avoid ..."
         ]
      }
   },
   "date": "19-07-2024"
}