{
   "weather_details": {
      "15/06/2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 65,
         "rh_min": 41,
         "wind_speed": 20,
         "wind_direction": 212,
         "cloud_cover": 7
      },
      "16/06/2024": {
         "rainfall": 2,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 67,
         "rh_min": 36,
         "wind_speed": 20,
         "wind_direction": 207,
         "cloud_cover": 5
      },
      "17/06/2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 25,
         "rh_max": 66,
         "rh_min": 43,
         "wind_speed": 20,
         "wind_direction": 212,
         "cloud_cover": 4
      },
      "18/06/2024": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 24,
         "rh_max": 78,
         "rh_min": 52,
         "wind_speed": 18,
         "wind_direction": 204,
         "cloud_cover": 7
      },
      "19/06/2024": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 24,
         "rh_max": 80,
         "rh_min": 46,
         "wind_speed": 21,
         "wind_direction": 225,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "paddy",
      "maize",
      "groundnut",
      "yam",
      "brinjal",
      "okra",
      "carp"
   ],
   "general_advisory": "Prepare nursery bed and sowing may be done after monsoon showers in rainfed transplanted rice areas. Mulching is advised to reduce evaporation from soil in orchard crops. Always use certified seeds for paddy cultivation. Seed treatment is mandatory for maize to avoid the infestation of Fall Army Worm. Suitable varieties of groundnut should be used and treated with recommended bacterial culture. Plant yam varieties like Shreekirti, Shreerupa, Hatikhoj, etc. with proper land preparation. Control damping off disease in brinjal seedlings. Use neem-based pesticides for pest control in okra.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Wet Nursery Field Preparation - Irrigate the nursery field and apply necessary fertilizers during last puddling. Sow sprouted seeds and provide appropriate irrigation."
         ]
      },
      "maize": {
         "advisory": [
            "Seed Treatment - Treat seeds with recommended pesticide to avoid Fall Army Worm infestation."
         ]
      },
      "groundnut": {
         "advisory": [
            "Use suitable varieties and treat seeds with recommended bacterial culture."
         ]
      },
      "yam": {
         "advisory": [
            "Plant yam varieties and provide necessary land preparation."
         ]
      },
      "brinjal": {
         "advisory": [
            "Control damping off disease in brinjal seedlings."
         ]
      },
      "okra": {
         "advisory": [
            "Use neem-based pesticides for pest control in okra."
         ]
      },
      "carp": {
         "advisory": [
            "Stock carp varieties in the specified ratio for increased benefits.",
            "Maintain pond quality with suitable feed and supplements."
         ]
      }
   },
   "date": "14-06-2024"
}