{
   "weather_details": {
      "2024-07-20": {
         "rainfall": 20,
         "t_max": 31,
         "t_min": 25,
         "rh_max": 90,
         "rh_min": 65,
         "wind_speed": 15,
         "wind_direction": 72,
         "cloud_cover": 8
      },
      "2024-07-21": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 91,
         "rh_min": 62,
         "wind_speed": 12,
         "wind_direction": 112,
         "cloud_cover": 8
      },
      "2024-07-22": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 86,
         "rh_min": 58,
         "wind_speed": 10,
         "wind_direction": 158,
         "cloud_cover": 7
      },
      "2024-07-23": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 82,
         "rh_min": 60,
         "wind_speed": 14,
         "wind_direction": 238,
         "cloud_cover": 7
      },
      "2024-07-24": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 83,
         "rh_min": 61,
         "wind_speed": 20,
         "wind_direction": 248,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "paddy",
      "groundnut",
      "maize",
      "pigeon pea",
      "okra",
      "brinjal",
      "goat"
   ],
   "general_advisory": "For one-acre area of paddy transplanting, 400 m2 size of land is required for nursery raising. Before sowing, paddy seeds should be treated with Trichoderma powder formulation. Go for non-paddy crops in the upland to avoid terminal drought. Intercropping of cereals+pulses/oilseeds is recommended. Go for early sowing/transplanting as much as possible to complete these by mid-August. Go for medium duration rice varieties in medium land. Go for line sowing of rice followed by early beaushaning and weeding.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "In assured irrigated areas select the land for wet bed nursery close to source of irrigation water with good drainage facilities.",
            "It is advisable to follow community nursery approach at village level.",
            "Divide nursery area into smaller plots of 1.5-metre-long, 10 cm height and convenient length.",
            "Sprouted Seeds should be sown @ 40-50 g/ m2 area of seed bed by line sowing with 5 cm gap between each line or direct broadcasting and put dried compost over seeds."
         ]
      },
      "groundnut": {
         "advisory": [
            "Apply well powdered Gypsum @ 100 kg/acre and incorporate into the soil along with the basal fertilizers.",
            "If pre-emergence herbicide is not applied during sowing then apply post-emergence herbicide like Imazethapyr 10 % SL at 15-DAS.",
            "For better peg formation in groundnut crop hoeing and earthing up should be done at 20-25 DAS."
         ]
      },
      "maize": {
         "advisory": [
            "Seed rate for maize is 6-7kg/acre.",
            "To avoid the infestation of Fall Army Worm, treat seeds with Cyantraniliprole19.8%+ Thiamethoxam 19.8% FS.",
            "Keep row to row spacing at 60 cm and plant to plant at 20 cm.",
            "For chemical control of weeds in Maize, spray Atrazine 50 % W.P herbicide @ 800 g /acre by mixing in water."
         ]
      },
      "pigeon pea": {
         "advisory": [
            "Some improved varieties of Arhar are PRG-235, PRG 176, VL ARHAR-1, T-Arhar etc.",
            "Seed treatment can be done with Carbendazim 50 % WP or Carboxin 37.5 % + Thiram 37.5% D.S WP.",
            "Treat the seeds with recommended species of Rhizobium bacterial culture before sowing.",
            "Apply well decomposed FYM during final land preparation."
         ]
      },
      "okra": {
         "advisory": [
            "The seed rate for HYV okra is 4 -kg/acre whereas for hybrid the seed rate is 1.5 kg/acre.",
            "Treat the seed with imidacloprid for resistance against pest infestation."
         ]
      },
      "brinjal": {
         "advisory": [
            "For cultivation of an acre of brinjal crop, use improved variety and hybrid seeds.",
            "Land preparation with well decomposed FYM is necessary.",
            "Seed treatment can be done with Carbendazim 50 % WP or Carboxin 37.5 % + Thiram 37.5% D.S WP.",
            "Transplant 4 weeks old seedlings to the main field."
         ]
      },
      "goat": {
         "advisory": [
            "Use sand over the floor to keep it dry and clean for the animals.",
            "Floor space requirement for different goats should be maintained accordingly."
         ]
      }
   },
   "date": "19-07-2024"
}