{
   "weather_details": {
      "2024-02-21": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 21,
         "rh_max": 51,
         "rh_min": 21,
         "wind_speed": 9,
         "wind_direction": 244,
         "cloud_cover": 1
      },
      "2024-02-22": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 21,
         "rh_max": 54,
         "rh_min": 21,
         "wind_speed": 12,
         "wind_direction": 199,
         "cloud_cover": 3
      },
      "2024-02-23": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 68,
         "rh_min": 26,
         "wind_speed": 14,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "2024-02-24": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 54,
         "rh_min": 29,
         "wind_speed": 12,
         "wind_direction": 30,
         "cloud_cover": 7
      },
      "2024-02-25": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 60,
         "rh_min": 30,
         "wind_speed": 10,
         "wind_direction": 117,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "mustard",
      "brinjal",
      "onion",
      "tomato",
      "marigold",
      "potato",
      "cabbage",
      "chicken"
   ],
   "general_advisory": "Harvestable produce i.e., matured fruits, vegetables and flowers must be harvested and marketed to avoid deterioration of quality due to chances of occurrence of rain. Apply frequent light irrigation to summer paddy seedlings in nursery if required...",
   "crops_data": {
      "rice": {
         "advisory": [
            "The crops are at two to four week stage in nursery. Apply light and frequent irrigation to protect from cold. The transplanted paddy seedlings require specific nutrients for growth..."
         ]
      },
      "mustard": {
         "advisory": [
            "The mustard crop is at the flowering stage. Apply specific chemicals to manage Downy Mildew and white rust. Use appropriate insecticides to prevent infestation..."
         ]
      },
      "brinjal": {
         "advisory": [
            "The larvae of brinjal shoot and fruit borer burrows into the petioles and tender shoots. Remove affected parts and manage the pest with specific methods..."
         ]
      },
      "onion": {
         "advisory": [
            "The transplanted onion is at vegetative to bulb formation stage. Maintain proper soil moisture and irrigation. Be aware of thrips infestation and manage it accordingly..."
         ]
      },
      "tomato": {
         "advisory": [
            "The transplanted tomato crop is at fruit maturity to harvesting stage. Prevent whitefly infestation by using traps and specific insecticides. Manage fruit borer issues..."
         ]
      },
      "marigold": {
         "advisory": [
            "Manage potential red mite infestation in prevailing weather conditions by using specific spray treatments..."
         ]
      },
      "potato": {
         "advisory": [
            "Be aware of cut worm infestation in the early stages of crop. Use specific insecticides and spraying methods to manage pests effectively..."
         ]
      },
      "cabbage": {
         "advisory": [
            "Harvest the matured cabbage crop. Monitor for Dimond Back Moth and Head Borer infestation and use appropriate control measures..."
         ]
      },
      "chicken": {
         "advisory": [
            "During the summer season, adjust feeding times to avoid high temperatures. Maintain cleanliness and hygiene in the poultry unit..."
         ]
      }
   },
   "date": "20-02-2024"
}