{
   "weather_details": {
      "2024-02-21": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 21,
         "rh_max": 51,
         "rh_min": 21,
         "wind_speed": 9,
         "wind_direction": 244,
         "cloud_cover": 1
      },
      "2024-02-22": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 21,
         "rh_max": 54,
         "rh_min": 21,
         "wind_speed": 12,
         "wind_direction": 199,
         "cloud_cover": 3
      },
      "2024-02-23": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 68,
         "rh_min": 26,
         "wind_speed": 14,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "2024-02-24": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 22,
         "rh_max": 54,
         "rh_min": 29,
         "wind_speed": 12,
         "wind_direction": 30,
         "cloud_cover": 7
      },
      "2024-02-25": {
         "rainfall": 2,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 60,
         "rh_min": 30,
         "wind_speed": 10,
         "wind_direction": 117,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "mustard",
      "brinjal",
      "onion",
      "tomato",
      "marigold",
      "potato",
      "cabbage",
      "chicken"
   ],
   "general_advisory": "Harvestable produce i.e., matured fruits, vegetables and flowers must be harvested and marketed to avoid deterioration of quality due to chances of occurrence of rain. Apply frequent light irrigation to summer paddy seedlings in the nursery if required. Cover vegetable crops with polythene without holes to protect from the rain. Remove covers during the daytime. Take plant protection measures to prevent diseases and pests. Use insecticides in the afternoon to avoid disturbing Honeybees. Always use flat-fan or flood-jet nozzle for herbicide spraying.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Apply Metalaxyl+Mancozeb solution in case of root disease",
            "Provide light and frequent irrigation to paddy seedlings in the nursery",
            "Apply specific amount of DAP, MOP, and Urea during transplanting"
         ]
      },
      "mustard": {
         "advisory": [
            "Manage Downy Mildew and white rust with chemical sprays",
            "Prevent Mustard sawfly and leaf Webber infestation with suitable insecticides",
            "Deal with aphid and painted bug infestation using appropriate pesticides"
         ]
      },
      "brinjal": {
         "advisory": [
            "Control brinjal shoot and fruit borer with necessary interventions",
            "Use pheromone traps for pest management",
            "Apply neem-based pesticide during primary stage of infestation"
         ]
      },
      "onion": {
         "advisory": [
            "Provide frequent light irrigation to maintain soil moisture",
            "Manage thrips infestation with regular irrigation and interculture operations",
            "Use neem-based pesticide for pest control"
         ]
      },
      "tomato": {
         "advisory": [
            "Control whiteflies infestation in Tomato crop using traps and neem-based sprays",
            "Deal with fruit borer and other pests using specific insecticides",
            "Ensure adequate irrigation and proper management practices"
         ]
      },
      "marigold": {
         "advisory": [
            "Take measures to manage Red Spider Mites in flowers like Marigold",
            "Use Propargite or Fenpyroximate for effective control"
         ]
      },
      "potato": {
         "advisory": [
            "Prevent Cut Worm infestation with suitable insecticide sprays",
            "Manage sucking pests like Aphids and Jassids using neem-based pesticides",
            "Control late blight disease with proper fungicides"
         ]
      },
      "cabbage": {
         "advisory": [
            "Harvest matured cabbage crops",
            "Monitor and manage Dimond Back Moth and Head Borer infestations",
            "Apply appropriate chemical sprays for effective pest control"
         ]
      },
      "chicken": {
         "advisory": [
            "Adjust feeding times during high temperatures",
            "Regularly clean and disinfect poultry units",
            "Follow hygiene practices to prevent diseases"
         ]
      }
   },
   "date": "20-02-2024"
}