{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 26,
         "rh_max": 46,
         "rh_min": 11,
         "wind_speed": 8,
         "wind_direction": 288,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 26,
         "rh_max": 63,
         "rh_min": 10,
         "wind_speed": 7,
         "wind_direction": 198,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 53,
         "rh_min": 16,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 51,
         "rh_min": 12,
         "wind_speed": 9,
         "wind_direction": 165,
         "cloud_cover": 1
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 35,
         "rh_min": 8,
         "wind_speed": 10,
         "wind_direction": 202,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "paddy",
      "sugarcane",
      "maize",
      "tomato",
      "brinjal",
      "coconut",
      "vegetable",
      "fingerlings",
      "black gram",
      "green gram",
      "onion",
      "mango",
      "okra"
   ],
   "general_advisory": "In paddy crop, Panicle initiation, Panicle emergence, flowering and milking stages are the critical stages. In these stages water scarcity or deficit of water causes comparatively greater reduction in yields. Hence, water deficit during these stages should be avoided. Cover the rows with dry leaves in Sugarcane. Top-dress with 4% potassium to protect crop from water scarcity during summer. Apply sprinkler irrigation to bring down the heat effect. Conserve up to 50% water by irrigating alternate rows. The high temperature increases the water requirement of maize crop. Irrigate the crop. Never allow water to remain stagnant for more than six hours in the field. Spread polythene in irrigation channels to save water wastage during irrigation in sandy and loamy soil. High temperature in day hours may lead to wilting in tomato and brinjal. Apply 1g Streptocyclin in 10-liter water in the root zone. Mulch coconut leaves 1.8 m around a coconut tree to reduce water loss. Cover with paper caps on the newly planted vegetable seedlings during the daytime. In shallow ponds, harvest fingerlings, if water temperature rises to 30 0C. Ensure enough water depth before introducing fingerlings in a pond.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Yellow stem borer management - Due to rise in temperature there are chances of increase in stem borer infestation in paddy crop. To manage Yellow Stem Borer in paddy spray Fipronil 5%SC @ 400ml/acre or Flubendiamide 20% WG @ 50g/acre or Chlorantraniliprole 18.5% SC @ 60ml /acre or Chromafenozide 80%WP @ 50g/acre.",
            "Blast Disease Management - To manage blast disease spray Hexaconazole 5 % SC @ 400-ml/acre or Azoxystrobin 18.2% + Difenoconazole 11.4 % S.C @ 200-ml/acre or Tebuconazole 50%+ Trifloxystr obin 25 % WG @ 80-gram/acre."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Early Shoot Borer : To manage early shoot borer in Sugarcane, irrigate the crop frequently during hot months. Timely cutting the attacked shoot at or just below the ground level ensures destruction of most of the caterpillar. Collect and destroy the egg masses manually. In furrow, apply Fipronil 0.3% GR @ 10 kg/acre at the time of first earthing up."
         ]
      },
      "maize": {
         "advisory": [
            "The high temperature increases the water requirement of maize crop. Irrigate the crop. Never allow water to remain stagnant for more than six hours in the field."
         ]
      },
      "tomato": {
         "advisory": [
            "High temperature in day hours may lead to wilting in tomato and brinjal. Apply 1g Streptocyclin in 10-liter water in the root zone."
         ]
      },
      "brinjal": {
         "advisory": [
            "Brinjal shoot and fruit borer: To manage this insect, install 20 nos. of pheromone trap having Leucin Lure per acre. During the primary stage of pest infestation spray neem-based pesticide (Azadirachtin) 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. Go for chemical control if there is 4% withering of terminal shoot or 14% fruits infested with borers. For chemical control spray Spinosad 45 % SC @ 75-ml/acre or Emamectin Benzoate 5% SG @ 80-gram/acre or Chlorantraniliprole 18.5 % SC @80-ml/acre or Spinetoram 11.7 % SC @ 200-ml /acre. Do not repeat the same insecticide. Use any of the above insecticides alternately at 15-days interval."
         ]
      },
      "coconut": {
         "advisory": [
            "Mulch coconut leaves 1.8 m around a coconut tree to reduce water loss."
         ]
      },
      "vegetable": {
         "advisory": [
            "Cover with paper caps on the newly planted vegetable seedlings during the daytime."
         ]
      },
      "fingerlings": {
         "advisory": [
            "In shallow ponds, harvest fingerlings, if water temperature rises to 30 0C. Ensure enough water depth before introducing fingerlings in a pond."
         ]
      },
      "black gram": {
         "advisory": [
            "Tobacco Caterpillar Management: Check the migration of caterpillars by dusting with Chlorpyriphos 1.5 % D @ 10 kg around the field. For chemical control spray Novaluron 5.25 %+ Indoxacarb 4.25 % @ 400-ml/acre or Lambda Cyhalothrin 4.9 CS @ 300 ml or Flubendiamide 20 % WG @ 120 gram. For spraying of insecticides 200 liters of water per acre is required."
         ]
      },
      "green gram": {
         "advisory": [
            "Tobacco Caterpillar Management: Check the migration of caterpillars by dusting with Chlorpyriphos 1.5 % D @ 10 kg around the field. For chemical control spray Novaluron 5.25 %+ Indoxacarb 4.25 % @ 400-ml/acre or Lambda Cyhalothrin 4.9 CS @ 300 ml or Flubendiamide 20 % WG @ 120 gram. For spraying of insecticides 200 liters of water per acre is required."
         ]
      },
      "onion": {
         "advisory": [
            "After harvesting of onion, cut the tops leaving 2.0 -2.5 cm above bulb. The harvested bulb should be dried in a well-ventilated concrete floored room. Well-dried bulbs can be stored for a longer period."
         ]
      },
      "mango": {
         "advisory": [
            "Mango hopper: To control mango hoppers spray Imidacloprid 17.8% SL @ 5 ml/15 liters of water or Thiamethoxam 25% W.G @ 3 ml/15 liters of water or Acetamiprid 20% S.P. @ 4g / 15 liters of water. Application of smoke below the plants can also help in reducing the pest population."
         ]
      },
      "okra": {
         "advisory": [
            "Whitefly Infestation: To prevent whitefly infestation in okra seeds should be treated with Imidacloprid @ 7-gram/kg of seeds before sowing. Install 8-10 nos of yellow sticky traps starting from the 2-3 leaf stage of the crop."
         ]
      }
   },
   "date": "02-04-2024"
}