{
   "weather_details": {
      "27/03/2024": {
         "rainfall": 0,
         "t_max": 38,
         "t_min": 23,
         "rh_max": 60,
         "rh_min": 22,
         "wind_speed": 8,
         "wind_direction": 198,
         "cloud_cover": 0
      },
      "28/03/2024": {
         "rainfall": 0,
         "t_max": 38,
         "t_min": 23,
         "rh_max": 64,
         "rh_min": 18,
         "wind_speed": 9,
         "wind_direction": 198,
         "cloud_cover": 0
      },
      "29/03/2024": {
         "rainfall": 0,
         "t_max": 39,
         "t_min": 24,
         "rh_max": 60,
         "rh_min": 16,
         "wind_speed": 9,
         "wind_direction": 198,
         "cloud_cover": 0
      },
      "30/03/2024": {
         "rainfall": 0,
         "t_max": 39,
         "t_min": 24,
         "rh_max": 65,
         "rh_min": 19,
         "wind_speed": 9,
         "wind_direction": 180,
         "cloud_cover": 0
      },
      "31/03/2024": {
         "rainfall": 2,
         "t_max": 39,
         "t_min": 24,
         "rh_max": 60,
         "rh_min": 23,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "paddy",
      "pointed gourd",
      "onion",
      "chilli",
      "summer sunflower",
      "tobacco caterpillar",
      "whitefly infestation in okra",
      "yellow mosaic viral disease",
      "mango hopper"
   ],
   "general_advisory": "Dry weather may prevail over the district of Nayagarh for the next five days except very light rainfall on Sunday. The sky condition may remain clear to generally cloudy for the next five days. In the next 5 days, the wind speed will remain within 08-09 km/h. The daily maximum and minimum temperature are likely to remain 38-39°C and 23-24°C respectively for the next five days.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Yellow stem borer management - Due to rise in temperature there are chances of increase in stem borer infestation in paddy crop. To manage Yellow Stem Borer in paddy spray Fipronil 5%SC @ 400ml/acre or Flubendiamide 20% WG @ 50g/acre or Chlorantraniliprole 18.5% SC @ 60ml /acre or Chromafenozide 80%WP @ 50g/acre.",
            "Blast Disease Management  - To manage blast disease spray Hexaconazole 5 % SC @ 400-ml/acre or Azoxystrobin 18.2% + Difenoconazole 11.4 % S.C @ 200-ml/acre or Tebuconazole 50%+ Trifloxystrobin 25 % WG @ 80-gram/acre."
         ]
      },
      "pointed gourd": {
         "advisory": [
            "Pointed gourd is at flowering and fruiting stage. Don’t go for weeding. Grasses and weeds will help in maintaining the humidity and it is safe for creeping of the vines and does not allow the fruit to come in contact with soil and avoid fruit rot."
         ]
      },
      "onion": {
         "advisory": [
            "After harvesting of onion, cut the tops leaving 2.0-2.5 cm above bulb. The harvested bulb should be dried in well ventilated concrete floored room. Well dried bulbs can be stored for longer period."
         ]
      },
      "chilli": {
         "advisory": [
            "For long term storage of chilli, first pick the ripened chilli fruits from plants and shade dry for 3 to 4 days. In this process we can get uniform colour fruits. Again, sundry the fruits for 3 to 4 days and reduce 10% of moisture content from it. Store it in a gunny bag without any contact to wall and floor."
         ]
      },
      "summer sunflower": {
         "advisory": [
            "Summer sunflower crop is at pre-flowering stage. Spray 2-3 g Borax per litre water."
         ]
      },
      "tobacco caterpillar": {
         "advisory": [
            "Monitor the emergence of Tobacco Caterpillar adult moths by setting up Pheromone traps having Spodolure @ 6-8 nos/acre in green gram and black gram."
         ]
      },
      "whitefly infestation in okra": {
         "advisory": [
            "To prevent whitefly infestation in okra seeds should be treated with Imidacloprid @ 7-gram/kg of seeds before sowing. Install 8-10 nos of yellow sticky traps starting from 2-3 leaf stage of the crop."
         ]
      },
      "yellow mosaic viral disease": {
         "advisory": [
            "Yellow mosaic viral disease (YMV)  - To manage this disease whitefly management should be done. Diseased plants should be rogued out to prevent further spread of the disease. To manage whitefly infestation at early stage of crop spray Neem based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. If the infestation is severe than go for chemical pesticide like Thiamethoxam @ 40- gram/acre or Acetamiprid @ 50-gram/acre by mixing in 200-litre of water."
         ]
      },
      "mango hopper": {
         "advisory": [
            "Mango hopper  -To control mango hoppers spray Imidacloprid 17.8% SL @ 5 ml/15 litre of water or Thiamethoxam 25% W.G @ 3ml/15 litre of water or Acetamiprid 20% S.P. @ 4g /15litre of water. Application of smoke below the plants can also help in reducing the pest population."
         ]
      }
   },
   "date": "26-03-2024"
}