{
   "weather_details": {
      "27-03-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 21,
         "rh_max": 39,
         "rh_min": 17,
         "wind_speed": 9,
         "wind_direction": 216,
         "cloud_cover": 0
      },
      "28-03-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 21,
         "rh_max": 36,
         "rh_min": 14,
         "wind_speed": 10,
         "wind_direction": 300,
         "cloud_cover": 0
      },
      "29-03-2024": {
         "rainfall": 0,
         "t_max": 38,
         "t_min": 23,
         "rh_max": 34,
         "rh_min": 14,
         "wind_speed": 9,
         "wind_direction": 225,
         "cloud_cover": 0
      },
      "30-03-2024": {
         "rainfall": 0,
         "t_max": 38,
         "t_min": 23,
         "rh_max": 38,
         "rh_min": 18,
         "wind_speed": 11,
         "wind_direction": 238,
         "cloud_cover": 2
      },
      "31-03-2024": {
         "rainfall": 0,
         "t_max": 38,
         "t_min": 25,
         "rh_max": 44,
         "rh_min": 17,
         "wind_speed": 11,
         "wind_direction": 206,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "summer paddy",
      "groundnut",
      "hybrid maize",
      "tomato",
      "chilli",
      "brinjal",
      "onion",
      "mango",
      "cattle & buffalo",
      "goat & sheep",
      "poultry"
   ],
   "general_advisory": "Keeping in view of dry and sunny weather during next five days, farmers are advised to resume fertilizer and pesticide application where it is required. Regular monitoring of crop field is advisable for incidence of insects and diseases.",
   "crops_data": {
      "summer paddy": {
         "advisory": [
            "Disease and Insect Management: Blast: If infestation of blast disease is noticed in direct seeded rice, spray Carbendazim 50 WP @ 1g/ltr of water or Trifloxystrobin 25% + Tebuconazole 50% @ 4 g /10 ltrs of water or Edifenphos 50 EC @ 1 ml/ltr of water. Stem borer/Leaf folder: Apply nitrogenous fertilizer cautiously to avoid heavy infestation of stem borer. Collect and destroy egg masses of stem borer where ever possible. Install 3 pheromone traps with 5mg lure/acre in the rice field for monitoring of the yellow stem borer and leaf folder just after the transplanting. Whenever the number of male moths/trap reaches 4 or 5, spray Azadiractin 0.15% neem seed kernel-based EC formulation @ 4 ml/ltrs of water or apply Cartap hydrochloride 4G @ 10 kg/acre mixing with sand at 1:1 ratio or spray Chlorantraniliprole 18.5% SC @ 3ml or Flubendiamide 39.35% M/M SC @ 1ml by mixing with 10 liters of water. Brown spot: If infestation of brown spot is noticed, spray Propiconazole 25% EC @ 1 ml or Carbendazim 12% + Mancozeb 63% @ 2.5 g by mixing with one liter of water. Thrips: During high temperature, there is a chance of thrips infestation in paddy. To protect, apply Thiamethoxam 25% WG @ 2 g per 10 liters of water."
         ]
      },
      "groundnut": {
         "advisory": [
            "Disease & Insect Management: Leaf miner: Due to rise in day temperature infestation of leaf miner may be seen. Spray Profenophos 50% EC @ 2ml/liter of water if infestation is observed. Tobacco Caterpillar: To monitor effectively install pheromone trap (Spodo lure) @ 8 no./ac at vegetative stage and replace the lure after 3 weeks. Tikka: Spray Mancozeb 75% WP @ 3g/lit or Tebuconazole 29.5% EC @ 1.0 ml/lit or Carbendazim 50% WP @ 2g/ltr of water if tikka disease is noticed."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "Insect Management: Stem Borer: For effective control of stem borer spray Fipronil 5% SC or Profenophos 50% EC @ 2ml/ltr of water. FAW: Apply Emamectin Benzoate 5 % SG @ 2 ml/ 5 ltr of water to control FAW infestation."
         ]
      },
      "tomato": {
         "advisory": [
            "Disease and Insect Management: Fruit & Shoot borer: Spray Chlorantraniliprole 18.5% SC @ 3ml or Cyntraniliprole 10.26% OD @ 18 ml or Indoxacarb 14.5% SC @ 10 ml by mixing with 10 liters of water. Leaf blight: Spray Copper oxychloride 50% WP @ 3g /ltr of water."
         ]
      },
      "chilli": {
         "advisory": [
            "Disease and Insect Management: Thrips / Leaf curl virus: To manage thrips infestation install Blue sticky trap @ 8 nos./acre. For chemical control spray Emamectin Benzoate 5% SG @ 2 g or Fipronil 5% SC @ 10 ml or Imidacloprid 17.8% SL 1.5 ml by mixing with 5 ltrs of water. Fruit Borer: Install pheromone trap @ 8 nos./ac with Heli lure at vegetative stage and replace the lure after weeks."
         ]
      },
      "brinjal": {
         "advisory": [
            "Insect Management: Fruit and Shoot borer: Install pheromone trap/Wata trap @ 8 nos. per acre area at vegetative stage and replace lure after 3 weeks. To control chemically, spray Spinosad 45% SC @ 5.5 ml by mixing with 15 liters of water or Thiodicarb 75 % WP @ 2ml/ltr of water."
         ]
      },
      "onion": {
         "advisory": [
            "Disease and Insect Management: Purple blotch: Spray Difenoconazole 25% EC or Tebuconazole 25.9% EC or Kitazin 48% EC @ 1g/ltr of water. Thrips: Install blue sticky trap @ 8/ acre at vegetative stage. For chemical control, spray Thiomethoxam 25 WG @ 1g/ 5 liters of water or Acetamiprid 20% SP @ 1g/ 4 liters of water."
         ]
      },
      "mango": {
         "advisory": [
            "For control of fruit drop in mango orchards, spray of 20 ppm Planofix @ 2ml/ 4.5 liters of water. To control fungal disease spraying of Karathane @ 5 ml per 10 litre of water is advisable."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "It is beneficial to add 5-10% of fat in the diet of high yielding (10-15 ltr) cattle by reducing the fiber in the ration and add antioxidant like vitamin A & E in the diet. Sprinkle water over dairy cattle & buffalo twice or thrice a day to reduce their body temperature."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "Allow the goats & sheeps to graze only from 7-11 AM in the morning & 4-7 PM in the evening."
         ]
      },
      "poultry": {
         "advisory": [
            "Keep the curtains of poultry shed close during day time. If required, sprinkle water over them during day time for a cooling effect."
         ]
      }
   },
   "date": "26-03-2024"
}