{
   "weather_details": {
      "13/04/2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 68,
         "rh_min": 45,
         "wind_speed": 14,
         "wind_direction": 243,
         "cloud_cover": 3
      },
      "14/04/2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 76,
         "rh_min": 46,
         "wind_speed": 21,
         "wind_direction": 207,
         "cloud_cover": 2
      },
      "15/04/2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 75,
         "rh_min": 51,
         "wind_speed": 21,
         "wind_direction": 202,
         "cloud_cover": 1
      },
      "16/04/2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 54,
         "wind_speed": 24,
         "wind_direction": 202,
         "cloud_cover": 0
      },
      "17/04/2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 57,
         "wind_speed": 26,
         "wind_direction": 202,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "paddy",
      "groundnut",
      "cucurbits",
      "chilli",
      "mango",
      "animal husbandry"
   ],
   "general_advisory": "Transplanting of vegetables should be done in afternoon hour to avoid high temperature. In case of ear cutting caterpillar incidence in paddy, spray Quinalphos 25EC @ 400 ml/acre or Chlorpyriphos 20EC @ 500ml/acre in 200 litres of water. It should be applied in the morning hour to the base of the crop. After harvesting, Blackgram and Greengram, dry the seeds until the optimum moisture content is attained. Clean the entire surface where the storage is to be done. At the time of harvesting groundnut pods usually have moisture content around 40-50% and hence need to be dried under direct sunlight to bring moisture content below 10% for safe storage. Cover the rows with dry leaves in Sugarcane. Top-dress with 4% potassium to protect crop from water scarcity during summer. Apply sprinkler irrigation to bring down the heat effect. Conserve up to 50% water by irrigating alternate rows. High temperature in day hours may lead to wilting in tomato and brinjal. Apply 1g Streptocyclin in 10 liter water in root zone. Mulch coconut leaves 1.8 m around a coconut tree to reduce water loss.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Gundi Bug management - To manage Gundi Bug spray Chlorpyriphos 20% EC @ 400- ml/ acre or Malathion 50 % EC @ 400- ml/ acre by mixing in 200-litre of water. Dusting of Chlorpyriphos 1.5 % D @ 10-kg/acre 3 or Malathion 5 % D.P @ 10 kg/acre should be done uniformly during morning hours, when there is no or minimum wind.",
            "BPH and WBPH management - If infestation of BPH and WBPH occur (5-10 hoppers/hill), spray Neem Based Pesticide (Azadirachtin) 1500 PPM @ 600- ml/acre at the base of the plant. If problem persists, spray Pymetrozine 50% WG @ 120 g/acre or Dinotefuran 20 % SG @ 80 g/acre or Flonicamid 50 % WG @ 60- gram/acre or Triflumezopyrim 10% SC @ 100 ml / acre at the base of the plant. Use only pesticides recommended for brown plant hopper at recommended dose only and do not use same pesticide repeatedly."
         ]
      },
      "groundnut": {
         "advisory": [
            "Post Harvest Management - Groundnut should be stored in polythene lined gunny bags with desiccant like fused Calcium Chloride @ 250-gram/30-kg of seeds. The desiccant should be tied with cotton cloth and kept inside perforated plastic box. The sealed bags should be kept vertically inside a well-ventilated room at room temperature."
         ]
      },
      "cucurbits": {
         "advisory": [
            "Downy Mildew management - To manage Downy Mildew disease in cucurbits spray Copper Hydroxide 77 % WP @ 3-gram/litre or Fosetyl -AL 80 % WP @ 3- gram/litre or Carbendazim 12 % + Mancozeb 63 % WP @ 2-gram/litre."
         ]
      },
      "chilli": {
         "advisory": [
            "Fruit rot and die back management - There are chances of fruit rot and die back disease incidence in chilli crop. To manage these disease spray Propineb 70 % WP @ 500 gram/acre or Difenoconazole 25 % EC @ 100-ml/acre or Azoxystrobin 23 % SC @ 200-ml/acre. The fungicide should be sprayed first just before flowering and second at fruit formation stage."
         ]
      },
      "mango": {
         "advisory": [
            "Mango hopper - To control mango hoppers spray Imidacloprid 17.8% SL @ 5 ml/15 litre of water or Thiamethoxam 25% W.G @ 3ml/15 litre of water or Acetamiprid 20% S.P. @ 4g / 15litre of water. Application of smoke below the plants can also help in reducing the pest population."
         ]
      },
      "animal husbandry": {
         "advisory": [
            "Due to severe heat there is a reduction of growth rate and milk production in animals and if the treatment is not provided in time then the animal may die. During scorching heat the animals should be tied under tree shed. If the roof of the animal shed is made up of tin or asbestos, then put straw over it and sprinkle water on it from time to time. Cover the windows and doors of the shed with wet gunny bag and remove it after sunset. Do white washing over walls and the roof of the house. If you are keeping high producers then install fans, water sprinklers, and other heat-reducing instruments. If the animal succumbs due to heat stress then apply ice and wet clothes over its head and call a Veterinarian as soon as possible."
         ]
      }
   },
   "date": "12-04-2024"
}