{
   "weather_details": {
      "2024-06-19": {
         "rainfall": 2,
         "t_max": 38,
         "t_min": 26,
         "rh_max": 84,
         "rh_min": 30,
         "wind_speed": 10,
         "wind_direction": 234,
         "cloud_cover": 6
      },
      "2024-06-20": {
         "rainfall": 5,
         "t_max": 37,
         "t_min": 26,
         "rh_max": 73,
         "rh_min": 34,
         "wind_speed": 11,
         "wind_direction": 246,
         "cloud_cover": 7
      },
      "2024-06-21": {
         "rainfall": 5,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 57,
         "wind_speed": 9,
         "wind_direction": 245,
         "cloud_cover": 7
      },
      "2024-06-22": {
         "rainfall": 10,
         "t_max": 36,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 46,
         "wind_speed": 10,
         "wind_direction": 259,
         "cloud_cover": 8
      },
      "2024-06-23": {
         "rainfall": 10,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 56,
         "wind_speed": 8,
         "wind_direction": 236,
         "cloud_cover": 8
      }
   },
   "names_of_crops": [
      "rice",
      "cotton",
      "goat"
   ],
   "general_advisory": "Intercropping of cereals+pulses/oilseeds is recommended. Go for early sowing/transplanting as far as possible to complete these by mid-August. Go for medium duration rice varieties in medium land. Go for line sowing of rice followed by early beaushaning and weeding. This will avoid the rainfall required for transplanting, and over-aged seedlings if transplanted late. Go for non-paddy crops in the upland to avoid terminal drought.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Sowing should be started soon after received of good amount (weekly average 10mm) of early monsoon showers where direct seeding is practiced. Incorporate FYM or compost @ 2000 Kg/acre. Apply 26 kg DAP and 20 kg MoP per acre during last ploughing. Sow the short duration varieties @ 25-30 kg/acre behind the plough with maintaining 15-20 cm row to row distance. Before sowing seed should be treated with Trichoderma viride @ 10 g or Carbendazim 50% WP @ 1.5 g/kg seed."
         ]
      },
      "cotton": {
         "advisory": [
            "After monsoon rainfall go for ploughing. Plough the field with mould board plough or disc plough for deep ploughing. Keep the field clean. Apply 2 tonnes of compost during last ploughing. Purchase suitable hybrid seeds and fertilizers from licensed dealer. Avoid growing longer duration hybrids in Rainfed area."
         ]
      },
      "goat": {
         "advisory": [
            "By using sand over the floor we can keep the floor dry so that the animals are kept free from different diseases. The speciality of this shed is the floor is made of bricks and cement and sand from river is spread over it by a thickness of 4-6 inches. The sand soaks the urine so that the animals can sleep over it comfortably. It is also easier to clean the faecal material over the sand floor. To keep the sand dry it is stirred upside down in 15-20 days interval. The floor space requirement for kid is 0.5, for adult 1.2, for buck and pregnant female 2 square metre floor space is necessary which is suitable for every type of shed."
         ]
      }
   },
   "date": "18-06-2024"
}