{
   "weather_details": {
      "01-02-2025": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 20,
         "rh_max": 27,
         "rh_min": 74,
         "wind_speed": 2,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "02-02-2025": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 20,
         "rh_max": 24,
         "rh_min": 81,
         "wind_speed": 3,
         "wind_direction": 202,
         "cloud_cover": 1
      },
      "03-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 21,
         "rh_max": 20,
         "rh_min": 61,
         "wind_speed": 3,
         "wind_direction": 0,
         "cloud_cover": 2
      },
      "04-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 24,
         "rh_min": 73,
         "wind_speed": 4,
         "wind_direction": 63,
         "cloud_cover": 3
      },
      "05-02-2025": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 23,
         "rh_min": 63,
         "wind_speed": 5,
         "wind_direction": 79,
         "cloud_cover": 3
      }
   },
   "names_of_crops": [
      "dry season rice",
      "green gram/black gram",
      "mango",
      "vegetable crops",
      "livestock"
   ],
   "general_advisory": "As per the extended range forecast (date :-30.01.2025) of IMD, MC, Bhubaneswar, dry weather along with normal to above normal minimum temperature (night temperature) is expected over the districts of Odisha during week-1 (31st January to 6th February, 2025) and in week-2 (7th to 13th February, 2025), minimum temperature is very likely to be normal over the state.\n\nLooking to the dry weather condition in upcoming days farmers are advised to provide one irrigation in crop field and conduct all kind of spraying and intercultural operations in standing crop fields.\n\nFarmers should keep their field weed-free for proper crop growth.\n\nPrevailing temperature condition (high gap in day and night temperature) may affect various types of crops (favor different kinds of insect attack) as well as animals.",
   "crops_data": {
      "dry season rice": {
         "advisory": [
            "Transplanting: Transplanting of 3-5 week old seedlings should be advised in well-puddled soil at a spacing of 15 cm x 15 cm with 3-4 seedlings per hill at shallow depth. Apply (DAP 44 kg + MOP 22 kg) or (Urea 22 kg + SSP 125 kg + MOP 22 kg) as basal dose during final puddling.",
            "Weed Management: Farmers those have already completed transplanting, apply granular herbicide Bensulfuron-methyl + Pretilachlor @ 4 kg/acre at 5-8 DAT. Mix the granular herbicide with 4 kg of sand/acre and broadcast it uniformly in the field or spray Pyrazosulfuron-ethyl 10 WP @ 80 g/acre in 140 liters of water at 3-5 DAT or spray Bispyribac sodium @ 120 ml/acre at 10-15 DAT or 2-3 leaf stage of weeds in 140 liters of water.",
            "Insect/Pest management: In just transplanted field use 3 pheromone traps with 5mg lure/acre in the Gramin Krishi Mausam Sewa India Meteorological Department Orissa University of Agriculture and Technology RRTTS, Chiplima, Sambalpur. Whenever the number of male moths in trap reaches 4 or 5, spraying of Azadiractin 0.15% neem seed kernel based EC formulation @ 800 ml/acre should be advised. Farmers may also broadcast granular insecticide Chlorantraniliprole 4% GR @ 4 kg/acre or Cartap hydrochloride 4G @ 10kg/acre mixing with sand at 1:1 ratio or spray Chlorantraniliprole 18.5% SC @ 60 ml/acre in 200 liters of water to control these insects."
         ]
      },
      "green gram/black gram": {
         "advisory": [
            "Vegetative/Flowering: If sucking insect attack is noticed in Green/Black gram field then farmers should use 8 nos. of yellow sticky trap per acre to control these insect at vegetative stage. At initial stage of attack, farmers should spray 5 ml neem oil per liter of water to control these insect.",
            "Insecticide application should be avoided at flowering stage."
         ]
      },
      "mango": {
         "advisory": [
            "Flower bud initiation: Wrap or fix polythene/alkathane sheet tightly on Mango trees to manage mango mealy bug. Training and pruning of diseased and unwanted branches and leaves should be advised.",
            "If powdery mildew infestation or any fungal infection observed in Mango orchard then spraying of wettable sulphur @ 2g per liter of water should be advised."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Vegetative/Flowering/Fruiting Stage: To control leaf eating caterpillar and fruit borer/shoot and fruit borer in Tomato and Brinjal, spraying of Emamectin Benzoate @ 0.4 g per liter of water should be advised.",
            "For Diamond Back Moth attack in Cauliflower, spraying of Spinosad 45 SC @ 0.5 ml or Fipronil 5% SC @ 2ml or Neem oil @ 5ml per liter of water should be advised.",
            "Regular monitoring against sucking insect attack should be advised.",
            "Avoid chemical application at flowering stage."
         ]
      },
      "livestock": {
         "advisory": [
            "To maintain the body temperature of animals in prevailing weather condition (large gap in day and night temperature), they should be fed with a mixture of oil cakes and jiggery including covering of body during cold hours. Pregnant animal (> 6 months) should be given additional feed.",
            "Vaccination against FMF, HS, BQ etc. should be advised. Deworming of animals is advised to control harmful worm."
         ]
      }
   },
   "date": "31-01-2025"
}