{
   "weather_details": {
      "27-03-2024": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 22,
         "rh_max": 48,
         "rh_min": 18,
         "wind_speed": 8,
         "wind_direction": 225,
         "cloud_cover": 0
      },
      "28-03-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 22,
         "rh_max": 46,
         "rh_min": 13,
         "wind_speed": 7,
         "wind_direction": 240,
         "cloud_cover": 0
      },
      "29-03-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 23,
         "rh_max": 41,
         "rh_min": 12,
         "wind_speed": 7,
         "wind_direction": 288,
         "cloud_cover": 0
      },
      "30-03-2024": {
         "rainfall": 0,
         "t_max": 38,
         "t_min": 23,
         "rh_max": 39,
         "rh_min": 14,
         "wind_speed": 9,
         "wind_direction": 210,
         "cloud_cover": 6
      },
      "31-03-2024": {
         "rainfall": 4,
         "t_max": 38,
         "t_min": 24,
         "rh_max": 35,
         "rh_min": 12,
         "wind_speed": 10,
         "wind_direction": 251,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "rice",
      "green gram",
      "maize",
      "mango",
      "mustard",
      "pea",
      "vegetable crops",
      "cow",
      "buffalo"
   ],
   "general_advisory": "As there is a chance of dry weather condition along with increased maximum temperature expected during the upcoming week, farmers are advised to apply need based irrigation in crop fields and conduct fertilizer application and spraying operations. Proper care should be taken during spraying operations due to the possibility of cloudy weather and light rain. Mulching with crop residue or polythene is recommended to conserve soil moisture and maintain soil temperature.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers are advised to apply top dressing of urea fertilizer in rice plants during the tillering stage under adequate moisture conditions.",
            "To control yellow stem borer, spraying of Chlorantraniliprole 18.5% SC or Fipronil 5% should be advised under clear sky."
         ]
      },
      "green gram": {
         "advisory": [
            "To control aphids attack in pulse crops, spraying of imidacloprid or Thiamethoxam should be advised under clear weather.",
            "For yellow mosaic virus transmitted through white fly, spraying of Acetamiprid 20% SP should be advised."
         ]
      },
      "maize": {
         "advisory": [
            "Farmers are advised to drain out excess water from the field and apply fertilizer under proper moisture conditions.",
            "To control stem borer, spraying of Fipronil 5% SC or Profenophos 50% EC should be advised."
         ]
      },
      "mango": {
         "advisory": [
            "To control mango hopper, spraying of Acephate, Chloropyriphos, or Thiamethoxam is advised.",
            "For powdery mildew disease, spraying of soluble sulphur should be advised."
         ]
      },
      "mustard": {
         "advisory": [
            "To increase fruit size at mustard size fruit stage, KNO3 2% should be applied."
         ]
      },
      "pea": {
         "advisory": [
            "Spraying of Planofix should be advised at Mango with pea size fruit stage to reduce fruit drops."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Proper monitoring against root and fruit rot disease infestation in vegetable crops is advised.",
            "To control various pests in Tomato and Brinjal, appropriate insecticides should be sprayed under clear weather."
         ]
      },
      "cow": {
         "advisory": [
            "To protect the animal from heat, provision of fresh clean and cold drinking water along with salt is advised.",
            "Keep animals in shade and avoid making them work between 11 am to 4 pm."
         ]
      },
      "buffalo": {
         "advisory": [
            "Provide shade, fresh clean water, and salt to protect buffalo from heat.",
            "Cover the shed roof with straw, paint it white, or plaster with dung-mud to reduce temperature."
         ]
      }
   },
   "date": "26-03-2024"
}