{
   "weather_details": {
      "19-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 59,
         "rh_min": 94,
         "wind_speed": 4,
         "wind_direction": 84,
         "cloud_cover": 4
      },
      "20-10-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 25,
         "rh_max": 53,
         "rh_min": 92,
         "wind_speed": 4,
         "wind_direction": 68,
         "cloud_cover": 6
      },
      "21-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 47,
         "rh_min": 89,
         "wind_speed": 4,
         "wind_direction": 70,
         "cloud_cover": 6
      },
      "22-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 41,
         "rh_min": 85,
         "wind_speed": 4,
         "wind_direction": 36,
         "cloud_cover": 4
      },
      "23-10-2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 42,
         "rh_min": 79,
         "wind_speed": 5,
         "wind_direction": 17,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "cotton",
      "okra",
      "cole crop",
      "mango",
      "cow/buffalo"
   ],
   "general_advisory": "Dry weather condition is expected in upcoming days, so farmers are advised to conduct agricultural operation (irrigation, spraying, intercultural operation etc.) during that period. Sowing of green fodder should be advised to avail proper diet to animals. Farmers should start nursery sowing and planting of Cole crops and other winter season vegetable. Deworming and vaccination against Foot and Mouth Disease and Brucellosis should be advised in animals.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers should maintain adequate moisture in rice field by applying one irrigation because there is very less chance of rainfall in upcoming days.",
            "To control gall midge attack in rice field, farmers should spray Lambda-cyhalothrin 05% EC, thiamethoxam 25% WG, Fipronil 5% SC, or Chloropyriphos 20 EC in clear and calm weather condition.",
            "To control leaf folder, spraying of Chlorantraniliprole 18.5% SC, Tetraniliprole 200 SC, or Flubendiamide 20 WG in clear weather should be advised."
         ]
      },
      "cotton": {
         "advisory": [
            "To control bollworm complex in cotton crop, farmers are advised to spray Emamectin benzoate 5% SG or Profenophos 50% EC in clear weather."
         ]
      },
      "okra": {
         "advisory": [
            "To control Fruit and shoot borer in Okra, spraying of Neem based pesticide 1500 ppm should be advised at initial stages."
         ]
      },
      "cole crop": {
         "advisory": [
            "Nursery bed should be prepared with a length of 3m, 1m breadth, and 15-20 cm height. Before sowing, application of 15-30 kg well decomposed FYM and 150 grams of chlorpyriphos dust to each nursery bed should be advised.",
            "Where irrigation facilities are available, planting of crop is advised in already prepared field."
         ]
      },
      "mango": {
         "advisory": [
            "In the old Mango orchard, training, pruning, and cleaning of weed, diseased and infected branches and leaves should be advised.",
            "If leaf webber infestation occurs, then spraying of quinalfos 20 EC should be advised.",
            "In newly planted mango orchard, if leaf cutting weevil attack is observed then farmers should spray Lambda cyhalothrin 5% EC, Chloropyriphos 20 EC, Spinosad 45% SC, or quinalfos 20 EC to control this insect."
         ]
      },
      "cow/buffalo": {
         "advisory": [
            "FMD is a highly contagious viral disease in Cow and Buffalo. Preventive and control measures include vaccination, deworming, antimicrobial treatment, and isolation of affected animals."
         ]
      }
   },
   "date": "18-10-2024"
}