{
   "weather_details": {
      "11-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 18,
         "rh_max": 35,
         "rh_min": 84,
         "wind_speed": 5,
         "wind_direction": 344,
         "cloud_cover": 3
      },
      "12-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 17,
         "rh_max": 31,
         "rh_min": 72,
         "wind_speed": 4,
         "wind_direction": 11,
         "cloud_cover": 1
      },
      "13-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 16,
         "rh_max": 27,
         "rh_min": 69,
         "wind_speed": 4,
         "wind_direction": 27,
         "cloud_cover": 0
      },
      "14-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 15,
         "rh_max": 23,
         "rh_min": 62,
         "wind_speed": 4,
         "wind_direction": 7,
         "cloud_cover": 0
      },
      "15-12-2024": {
         "rainfall": 0,
         "t_max": 28,
         "t_min": 14,
         "rh_max": 21,
         "rh_min": 59,
         "wind_speed": 5,
         "wind_direction": 6,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "rice",
      "green gram/black gram",
      "ground nut",
      "cole crop"
   ],
   "general_advisory": "Looking to the dry weather condition in upcoming days, farmers are advised to harvest their matured crops and conduct spraying operations. Farmers are advised to complete the sowing of Rabi crops like Mustard, Chickpea, Groundnut, Green gram/Black Gram etc. and start land preparation for nursery sowing of Rabi Paddy where irrigation facilities are available. Deworming and vaccination should be advised in animals to boost immunity and protect them from any harmful diseases.",
   "crops_data": {
      "rice": {
         "advisory": [
            "There is no rainfall event is expected in upcoming days so farmers are advised to conduct harvesting operations and make provision to keep the harvested paddy crop in safe places to avoid any further damage.",
            "After harvesting rice should be dried in the field for 2-3 days and thereafter threshing should be done. Rice should be stored at a moisture level of 12% in safe places.",
            "Prevailing weather condition is favourable for False Smut disease infestation in late maturing rice varieties so its regular monitoring should be advised. If infestation noticed, then spraying of Copper hydroxide 77% @ 2g/ltr or Tebuconazole 25% @ 2g/ltr should be advised when the sky is clear. Repeat the spray after 7-10 days for its effective control."
         ]
      },
      "green gram/black gram": {
         "advisory": [
            "Farmers are advised to complete sowing of green gram/black gram in the upcoming week.",
            "One week before sowing, seed should be treated with carbendazim @ 1.5-2.0g and imidacloprid @ 5g per kg seeds. Seven days after this treatment, 200g Rizobium culture and 3-4g sodium molybdate should be mixed in 10kg seeds in 400ml of water and mixed it thoroughly and dry it in shade for half an hour then go for sowing in the field. Seed should be sown with a seed rate of 8-10 kg/ac with a spacing of 30cm×10cm.",
            "Varieties: Green Gram: - Kamadeva, Durga, IPM 02-3, IPM 02-14, TARM1. Black Gram: - Prasada, Usala, PU 31, IPU2-43, Mahuri"
         ]
      },
      "ground nut": {
         "advisory": [
            "Farmers who have not yet sown seeds can use improved Groundnut varieties such as TAG-24, JL-24, Girnar-3, Smruti, TG-3, TG-22, Kadri-5, Kadri-6, Kadri-9, TPG-41, GPBD-4, Devi, CO-7, Dharani, and Divya etc. All these varieties are harvested within 100 to 130 days.",
            "Ensure seed treatment before sowing of seed and if possible, treat with bacteria or phospho culture 7 days after treatment. For 10 kg of seed, a farmer can use 200 grams of rhizobium culture and 200 grams of phospho culture within 3 hours of sowing. 40 to 50 kg of seed or 60 to 70 kg of pod is required per acre. Seeds should be sown within 2 to 3 days of husking at a depth of 5 cm.",
            "If the seedlings are of 10 days old, it is recommended to conduct gap filling where the seedlings have not emerged."
         ]
      },
      "cole crop": {
         "advisory": [
            "During panting, polythene can be used as mulching material or if planting already done straw can be used for the same purpose to maintain moisture as well as soil temperature vegetable crops.",
            "Regular monitoring against the attack of Diamond back moth in cauliflower should be advised and if possible, farmers should use pheromone trap in the field for this purpose.",
            "If attack observed then spraying of neem oil @ 5 ml or Emamectin Benzoate @ 0.4 g per liter water should be advised after the occurrence of rain."
         ]
      }
   },
   "date": "10-12-2024"
}