{
  "weather": {
    "07-02-2024": {
      "Rainfall (mm)": 0,
      "Max Temperature (º C)": 32,
      "Min Temperature ( ºC)": 19,
      "Total cloud cover (okta)": 0,
      "Max Relative Humidity (%)": 55,
      "Min Relative Humidity (%)": 22,
      "Wind speed (km/h)": 9,
      "Wind direction (deg)": 22
    },
    "08-02-2024": {
      "Rainfall (mm)": 0,
      "Max Temperature (º C)": 32,
      "Min Temperature ( ºC)": 17,
      "Total cloud cover (okta)": 0,
      "Max Relative Humidity (%)": 38,
      "Min Relative Humidity (%)": 25,
      "Wind speed (km/h)": 10,
      "Wind direction (deg)": 0
    },
    "09-02-2024": {
      "Rainfall (mm)": 0,
      "Max Temperature (º C)": 31,
      "Min Temperature ( ºC)": 15,
      "Total cloud cover (okta)": 0,
      "Max Relative Humidity (%)": 31,
      "Min Relative Humidity (%)": 18,
      "Wind speed (km/h)": 9,
      "Wind direction (deg)": 255
    },
    "10-02-2024": {
      "Rainfall (mm)": 0,
      "Max Temperature (º C)": 30,
      "Min Temperature ( ºC)": 15,
      "Total cloud cover (okta)": 5,
      "Max Relative Humidity (%)": 48,
      "Min Relative Humidity (%)": 17,
      "Wind speed (km/h)": 8,
      "Wind direction (deg)": 63
    },
    "11-02-2024": {
      "Rainfall (mm)": 10,
      "Max Temperature (º C)": 29,
      "Min Temperature ( ºC)": 17,
      "Total cloud cover (okta)": 7,
      "Max Relative Humidity (%)": 75,
      "Min Relative Humidity (%)": 26,
      "Wind speed (km/h)": 9,
      "Wind direction (deg)": 45
    }
  },
  "general_advice": "As per extended range forecast of IMD, rainfall is above normal, maximum and minimum temperature is expected to be normal for Odisha during 11.02.2024 to 17.02.2024. Farmers are advised to start sowing (nursery) for summer vegetable cultivation. Spraying operations should be done during upcoming 3-4 days because there is a chance of occurrence of light rainfall in some places is expected at the end of this week.",
  "name_of_crops": [
    "Green Gram/Black Gram",
    "Mustard",
    "Sesame",
    "Groundnut",
    "Tomato, Brinjal, Chilli",
    "Tomato"
  ],
  "crops_data": {
    "Green Gram/Black Gram": {
      "advisory": "Yellow mosaic virus (transmitted through white fly) attack symptoms is observed in some farmers field so to control this insect spraying of Acetamiprid 20% SP @ 40 g/acre in 200-250 liters of water should be advised under clear sky."
    },
    "Mustard": {
      "advisory": "To control aphid and mustard sawfly attack in mustard crop, spraying of Imidachlorprid @ 0.3 ml or Thiamethoxam @ 0.3 g and Chloropyriphos @ 2 ml per liter of water respectively should be advised under clear weather condition."
    },
    "Sesame": {
      "advisory": "Sowing of Sesame crop should be advised with a seed rate @ 2-2.5 kg seeds per acre. Before sowing, seed treatment should be done with 2g Carbendazim (Bavistin) and due to small seed size it should be mixed with dry sand during sowing in line."
    },
    "Groundnut": {
      "advisory": "Spraying of Imazethapyr @ 3 ml/liter of water should be advised within 15 days old crop."
    },
    "Tomato, Brinjal, Chilli": {
      "advisory": "To control leaf eating caterpillar and fruit borer/shoot and fruit borer in Tomato and Brinjal, spraying of Emamectin Benzoate @ 0.4 g per liter of water should be advised under clear weather condition. If white fly attack is observed in case Tomato and Brinjal, spraying of Thiamethoxam @ 0.3 g per liter of water should be advised under clear weather condition."
    },
    "Tomato": {
      "advisory": "Farmers should start sowing of tomato seed for summer cultivation in nursery bed because prevailing temperature suitable for germination of seed. One hoeing and weeding operation should be advised in case of crop having vegetative growth stage. Farmers are advised to keep the animal shed clean and dry to avoid disease and insect attack and also provide mineral mixture, jaggery etc. along with fresh clean drinking water to the animal in their daily ration to make them healthy."
    }
  },
  "date": "06-02-2024"
}