{
  "weather": {
    "31-01-2024": {
      "Rainfall": "0",
      "Cloud Cover": "30.0-33.3",
      "T-MAX": "17.8-21.4"
    },
    "07-02-2024": {
      "Rainfall": "0",
      "Cloud Cover": "34",
      "T-MAX": "20",
      "T-MIN": "20"
    },
    "08-02-2024": {
      "Rainfall": "0",
      "Cloud Cover": "33",
      "T-MAX": "19",
      "T-MIN": "19"
    },
    "09-02-2024": {
      "Rainfall": "0",
      "Cloud Cover": "31",
      "T-MAX": "17",
      "T-MIN": "17"
    },
    "10-02-2024": {
      "Rainfall": "0",
      "Cloud Cover": "30",
      "T-MAX": "17",
      "T-MIN": "17"
    },
    "11-02-2024": {
      "Rainfall": "0",
      "Cloud Cover": "29",
      "T-MAX": "19",
      "T-MIN": "19"
    }
  },
  "general_advice": "Farmers are advised to irrigate their field as there is mildly dry condition prevailed. Rabi season crop needs 10-15 irrigations at 7-10 days interval depending upon the soil moisture. Groundnut crop is at flowering stage, apply Gypsum 200 kg per acre. In onion crop, go for inter culture and hand weeding at 15-20 DAT. Apply 30kg of urea and 15kg of MOP fertilizer at this stage. Farmers those who have already transplanted paddy should apply 35 kg Urea per acre at 3 weeks after transplanting at active tillering stage for high yielding paddy varieties. To manage stem borer in paddy at early stage of crop, apply Cartap Hydrochloride 4%G @ 10kg/acre or Fipronil 0.3 % GR @ 10kg/acre or Chlorantraniliprole 0.4 % GR @ 4kg/acre or Imidacloprid 0.3% GR @ 6kg/acre by mixing it with sand at 1:1 ratio. Carry out planting of Sugarcane crop. To manage sett rot disease after planting basal drenching with Carbendazim 12% + Mancozeb 63% @ 400-gram/acre or foliar spray with Metalaxyl 8% + Mancozeb 64% WP @ 400-gram/acre by mixing in 200-litre of water. To control Bihar hairy caterpillar in green gram and black gram crop, spray Chlorpyriphos 50% + Cypermethrin 5 % E.C @ 400 ml/acre by mixing it in 200 litre of water. Farmers are also advised for specific fertilizer application and pest management for various crops like Paddy, Sugarcane, Black Gram, Green Gram, Groundnut, Brinjal, Potato, Onion, and Mango. Animal husbandry and poultry related advice is also provided.",
  "date": "06-02-2024"
}