{
  "weather": {
    "07-02-2024": {
      "T. Max.": 29,
      "T. Min.": 15,
      "Wind": {
        "Rainfall": 0,
        "speed": 15
      }
    },
    "08-02-2024": {
      "T. Max.": 33,
      "T. Min.": 14,
      "Wind": {
        "Rainfall": 0,
        "speed": 14
      }
    },
    "09-02-2024": {
      "T. Max.": 31,
      "T. Min.": 12,
      "Wind": {
        "Rainfall": 0,
        "speed": 12
      }
    },
    "10-02-2024": {
      "T. Max.": 30,
      "T. Min.": 12,
      "Wind": {
        "Rainfall": 0,
        "speed": 12
      }
    },
    "11-02-2024": {
      "T. Max.": 29,
      "T. Min.": 14,
      "Wind": {
        "Rainfall": 0,
        "speed": 14
      }
    }
  },
  "general_advice": "No rainfall and dry weather expected during next five days. So, go for irrigation in crop field as per requirement. Farmers are advised for not to burn the residue of *kharif* crops in the fields because it not only pollute the environment but also causes the severe health problems.",
  "name_of_crops": [
    "Rice",
    "Maize",
    "Groundnut",
    "Mustard/Toria",
    "Cauliflower",
    "Brinjal",
    "Tomato",
    "Okra",
    "Chilli"
  ],
  "crops_data": {
    "Rice": {
      "advisory": "Apply light irrigation to the nursery beds twice a week. The rice seedlings at 4-5 leaf stage are ready for transplanting. Blast in rice nursery may observe, to control it spray the nursery area with Tebuconazole 50% + Trifloxystrobin 25% WG @ 0.4 g/litre of water. For transplanted rice apply 4.5 kg urea, 44 kg DAP and 22 kg MoP per acre as basal dose during final puddling."
    },
    "Maize": {
      "advisory": "Fall army worm may observe in *rabi* maize field, to control it spray Emamectin benzoate 5% SG @ 0.4 g/litre of water or Chlorantraniliprole 18.5% SC @ 0.4 ml/litre of water. Complete the sowing of summer maize within 1st week of February at a spacing of 60 cm x 20 cm with seed rate of 6 kg/acre. Apply of 52 kg DAP and 40 kg MoP per acre as basal dose. To control weeds spray Atrazine 50% WP @ 800 g/acre with 200 litres of water within 3 days after sowing."
    },
    "Groundnut": {
      "advisory": "Chances of tobacco caterpillar infestation in *rabi* groundnut, to control it spray Thiamethoxam 12.6% + Lambda-Cyhalothrin 9.5% ZC @ 0.3 ml/litre of water or Profenophos 50% EC @ 2 ml/litre of water. Collar rot and stem rot may observe in *rabi* groundnut, to control it spray Metalaxyl 8% + Mancozeb 64%WP @ 2 g/litre of water or Carbendazim 50% WP @ 1.5 g/litre of water to the base of the plant. Go for land preparation and sowing of summer groundnut at a spacing of 25 cm x 10 cm with seed rate of 50 kg/acre. Apply 35 kg DAP, 4 kg urea and 27 kg MoP per acre along with 10 kg zinc sulfate and 4 kg borax/acre as basal. Before sowing seed should be treated with 10 g Trichoderma harzianum/viride or 3 g Carboxin 37.5% + Thiram 37.5% DS for one kg seed."
    },
    "Mustard/Toria": {
      "advisory": "Chances of aphid infestation, if observe spray Dimethoate 30% EC @ 1.5 ml/litre of water or Imidacloprid 17.8 % SL @ 0.3 ml/litre of water."
    },
    "Cauliflower": {
      "advisory": "Chances of diamond back moth infestation in cauliflower, if observe spray Azadirachtin 5% W/W @ 0.5 ml/litre of water or Emamectin benzoate 5% SG @ 0.4 g/litre of water."
    },
    "Brinjal": {
      "advisory": "Shoot and fruit borer may reported in brinjal field, to control it spray spray Azadirachtin 1% EC @ 3 ml/litre of water or Emamectin benzoate 5% SG @ 0.4 g/litre of water."
    },
    "Tomato": {
      "advisory": "Chances of infestation of sucking pests like white fly and aphid in tomato, to control these spray Thiamethoxam 12.6% + Lambda Cyhalothrin 9.5 ZC @ 3.75 ml or Azadirachtin 5% EC @ 7.5 ml in 15 litre of water."
    },
    "Okra": {
      "advisory": "To control fruit borer in okra spray neem based pesticide 300 ppm @ 5ml/litre of water. At later stages spray of Spinosad 45% SC @ 0.4ml/litre of water."
    },
    "Chilli": {
      "advisory": "Fruit rot infestation may observe in field, if observe spray Azoxystrobin 23% SC @ 1 ml/litre of water or Tebuconazole 25.9% EC @ 1 ml/litre of water."
    }
  },
  "date": "06-02-2024"
}