{
  "weather": {
    "Weather table": {
      "Rainfall (mm)": 0.8,
      "Maximum temperature (C)": "29.0-32.0",
      "Minimum temperature (C)": "17.0-22.0"
    }
  },
  "general_advice": "As per Medium range weather forecast of IMD, Dry weather for 5 days forecasted so Farmers are advised to give necessary irrigation to field & vegetable crops. Utilising the available water (Rainfall/Irrigation) puddle the land & complete the transplanting of summer rice with basal application of 35kg DAP,20 kg MOP &10 kg ZnSO4 /acre. Inspect the go down &open the doors & windows for sometime for ventilation & need based spraying of Lambda Cyahalothrin4.9CS@1.5ml/li. of water to minimize the infestation of storage pest. To reduce incidence of Powdery mildew, Anthracnose & Stem rot in blackgram spraying of (Tebuconazole + Sulphur) @500g/acre recommended. The mustard crop is at the flowering stage. The rainfall received during the last week which results in higher humidity and lower temperature might aggravate Aphid, Leaf Webber and Tobacco Caterpillar infestation in mustard crop. To manage these pests at early stage of infestation spray Neem-based pesticide (Neem Oil 1500 PPM) @ 600-ml/acre by mixing in 200-litre of water. After 7-10 days need based spraying of Emamectin Benzoate @300g/acre is recommended. Spraying of Insecticide should be done at the afternoon hours to protect the honeybees & other beneficial insects. Complete the sowing of summer Greengram as soon as possible to avoid the infestation of sucking pest and viral disease under delayed sowing condition. To prevent from wilting or partial wilting in brinjal and tomato apply Neem or Karanjaa cake and spray Tebuconazole fungicide @ 1ml/liter to plant and plant base. Provide bamboo or wooden stake for better fruit set and growth of Tomato plants. For minimizing the infestation of sucking insect pests like white fly, leaf hopper,thirps  and aphid in vegetables nursery and main field, spray Thiamethoxam @ 0.4g/litre of water or Difenthurian @1g/li Of water. To control leaf eating caterpillar and fruit borer in winter vegetables like Brinjal, Cole crops, Chilly & tomato apply 0.5 g Emamectin benzoate or Spinosad 0.4 ml/ liter of water. Sowing of Recommended HYV/Hybrid of Cucurbits after treating the seeds with Imidachloprid 600FS@(8-10)ml/kg seeds to minimize the incidence of viral /phytoplasma incidence. Spray The Marigold Plant With Difenthurion @1G/L Of Water Or Abamectin @0.75Ml/L Of water to control the infestation of Thrips,Aphids,Mites and Leaf Minor. For spraying of incidence of leaf spot & Blight spraying of (Carbendazim+Mancozeb) recommended. As the winter is in the starting phase, there is a possibility of \"EUS\" disease in fish. Farmers are advised to apply \"Cifax\" @ 400 ml mixed with 40 litre of water in one acre pond area as a preventive measure. The fishes should be fed daily with oil cake bran mixture at the rate of 2-3 % of their total biomass. Animals should be given mineral mixture along with salt regularly and wheat grains, jaggery etc. may be provided @ 10%-20% in the daily ration during winter season to meet the energy requirement of the animals",
  "name_of_crops": [
    "Rice",
    "Blackgram",
    "Rapeseed & Mustard",
    "Greengram",
    "Tomato & Brinjal",
    "Vegetables",
    "Cucurbits",
    "Marigold",
    "Pisciculture",
    "Animal Science"
  ],
  "crops_data": {
    "Rice": {
      "advisory": "Utilising the available water (Rainfall/Irrigation) puddle the land & complete the transplanting of summer rice with basal application of 35kg DAP,20 kg MOP &10 kg ZnSO4 /acre."
    },
    "Blackgram": {
      "advisory": "To reduce incidence of Powdery mildew, Anthracnose & Stem rot in blackgram spraying of (Tebuconazole + Sulphur) @500g/acre recommended."
    },
    "Rapeseed & Mustard": {
      "advisory": "The mustard crop is at the flowering stage. The rainfall received during the last week which results in higher humidity and lower temperature might aggravate Aphid, Leaf Webber and Tobacco Caterpillar infestation in mustard crop. To manage these pests at early stage of infestation spray Neem-based pesticide (Neem Oil 1500 PPM) @ 600-ml/acre by mixing in 200-litre of water. After 7-10 days need based spraying of Emamectin Benzoate @300g/acre is recommended."
    },
    "Greengram": {
      "advisory": "Complete the sowing of summer Greengram as soon as possible to avoid the infestation of sucking pest and viral disease under delayed sowing condition."
    },
    "Tomato & Brinjal": {
      "advisory": "To prevent from wilting or partial wilting in brinjal and tomato apply Neem or Karanjaa cake and spray Tebuconazole fungicide @ 1ml/liter to plant and plant base."
    },
    "Vegetables": {
      "advisory": "Provide bamboo or wooden stake for better fruit set and growth of Tomato plants. For minimizing the infestation of sucking insect pests like white fly, leaf hopper,thirps  and aphid in vegetables nursery and main field, spray Thiamethoxam @ 0.4g/litre of water or Difenthurian @1g/li Of water. To control leaf eating caterpillar and fruit borer in winter vegetables like Brinjal, Cole crops, Chilly & tomato apply 0.5 g Emamectin benzoate or Spinosad 0.4 ml/ liter of water."
    },
    "Cucurbits": {
      "advisory": "Sowing of Recommended HYV/Hybrid of Cucurbits after treating the seeds with Imidachloprid 600FS@(8-10)ml/kg seeds to minimize the incidence of viral /phytoplasma incidence."
    },
    "Marigold": {
      "advisory": "Spray The Marigold Plant With Difenthurion @1G/L Of Water Or Abamectin @0.75Ml/L Of water to control the infestation of Thrips,Aphids,Mites and Leaf Minor. For spraying of incidence of leaf spot & Blight spraying of (Carbendazim+Mancozeb) recommended."
    },
    "Pisciculture": {
      "advisory": "As the winter is in the starting phase, there is a possibility of \"EUS\" disease in fish. Farmers are advised to apply \"Cifax\" @ 400 ml mixed with 40 litre of water in one acre pond area as a preventive measure. The fishes should be fed daily with oil cake bran mixture at the rate of 2-3 % of their total biomass."
    },
    "Animal Science": {
      "advisory": "Animals should be given mineral mixture along with salt regularly and wheat grains, jaggery etc. may be provided @ 10%-20% in the daily ration during winter season to meet the energy requirement of the animals"
    }
  },
  "date": "06-02-2024"
}