{
  "weather": {
    "07/02/2024": {
      "Rainfall (mm)": 0,
      "T-MAX (C )": 34,
      "T-MIN (C )": 21,
      "Cloud Cover": 1,
      "Rh Max (%)": 93,
      "Rh Min (%)": 40,
      "Wind speed (kmph)": 11,
      "Wind Direction (deg)": 200
    },
    "08/02/2024": {
      "Rainfall (mm)": 0,
      "T-MAX (C )": 33,
      "T-MIN (C )": 20,
      "Cloud Cover": 1,
      "Rh Max (%)": 95,
      "Rh Min (%)": 38,
      "Wind speed (kmph)": 8,
      "Wind Direction (deg)": 135
    },
    "09/02/2024": {
      "Rainfall (mm)": 0,
      "T-MAX (C )": 33,
      "T-MIN (C )": 19,
      "Cloud Cover": 2,
      "Rh Max (%)": 91,
      "Rh Min (%)": 49,
      "Wind speed (kmph)": 9,
      "Wind Direction (deg)": 150
    },
    "10/02/2024": {
      "Rainfall (mm)": 0,
      "T-MAX (C )": 32,
      "T-MIN (C )": 19,
      "Cloud Cover": 1,
      "Rh Max (%)": 62,
      "Rh Min (%)": 43,
      "Wind speed (kmph)": 9,
      "Wind Direction (deg)": 112
    }
  },
  "general_advice": "Complete the transplanting of 3-5 week old seedlings in well puddled soil at a spacing of 15cm × 15cm with 3-4 seedlings per hill at shallow depth. In bacterial blight endemic areas, dip the seedling roots in 0.1% (1g in one litre of water) Plantomycin solution before transplanting for 30 minutes. Seedling treatment with 0.2% Chloropyriphos for 10-12 hours to control stemborer in the main field if granular insecticides have not been applied previously in the nursery. Apply (DAP 44 kg + MOP 22 kg) or (Urea 22 kg + SSP 125 kg + MOP 22 kg) as basal dose during final puddling. Farmers those have already completed transplanting, apply granular herbicide Bensulfuron-methyl + Pretilachlor @ 4kg/ acre at 5-8 days after transplanting. In just transplanted field put 3 pheromone traps with 5mg lure/acre in the rice field for monitoring of the yellow stem borer and leaf folder. Rabi crop needs 10-15 irrigations at 7-10 days interval depending upon the soil moisture condition. Sugarcane crop is a heavy feeder. Apply 87-kg of DAP, 20-kg of MOP and 4- tonne of FYM at the time of planting in trenches. Top dressing with Urea @ 60-kg per acre each at 45, 75 and 105 days after planting should be done. To manage early and late leaf blight in tomato, spray Mancozeb 75% WP @ 600 gram/acre or Zineb 75% WP @ 500gram/acre at 7 days interval. PADDY (Summer): Post-emergence Weed Management In transplanted and broadcasted paddy to control grasses, sedges and broad leaf weeds farmers are advised to spray, Bispyribac Sodium 10% E.C. @ 80 ml/acre or Ethoxysulfuron 15% WDG @ 40gram acre at 3 to 4 leaf stage by mixing in 200litre of water. If only broad leaf weeds and sedges are dominant in the field spray ready mix Metsulfuron methyl 10%+ Chlorimuron ethyl 10% WP @ 8gram /acre at 20-25 DAT by mixing in 200 litre of water. SUGARCANE: Sett Rot management To manage sett rot disease after planting basal drenching with Carbendazim 12% + Mancozeb 63% @ 400-gram/acre or foliar spray with Metalaxyl 8% + Mancozeb 64% WP @ 400-gram/acre by mixing in 200-litre of water. BLACKGRAM AND GREENGRAM: Aphid To control aphids during primary stage of pest infestation spray Neem Based Pesticide (Azadirachtin) 1500 PPM @ 600 ml/acre. Then spray Thiamethoxam 25% W.G @ 40 gram/acre or Acetamiprid 20% S.P. @ 50 gram/acre or Imidacloprid 17.8% SL @ 60-ml/acre by mixing in 200 litres of water. COLE CROPS: Alternaria Leaf Spot There are chances of Alternaria leaf spot disease incidence in Cole crops due to current cloudy weather condition. To control this disease in Cole crops spray Mancozeb 75 % WP @ 600-gram/acre or carbendazim 12 % + Mancozeb 63 % WP @ 400-gram/acre by mixing in 200-litre of water. TOMATO & BRINJAL: Whiteflies To manage whiteflies pest in Tomato and Brinjal crop, use yellow sticky traps @ 8-10/acre to attract and kill the insects. During primary stage of pest infestation spray neem-based pesticide (Azadirachtin) 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. To manage this pest chemically spray Thiamethoxam 25 % WG @ 40-gram/acre or Pyriproxifen 10% EC @ 200-ml/acre or Spiromesifen 22.9% SC @ 250-ml/acre by mixing in 200- litre of water. POULTRY: Sleeping disease of poultry has been found. Vaccinate the chicks with Lasota at 7 days and with IBD vaccines within 13-15 days.",
  "name_of_crops": [
    "PADDY",
    "SUGARCANE",
    "BLACKGRAM AND GREENGRAM",
    "COLE CROPS",
    "TOMATO & BRINJAL",
    "POULTRY"
  ],
  "crops_data": {
    "PADDY": {
      "advisory": "Post-emergence Weed Management In transplanted and broadcasted paddy to control grasses, sedges and broad leaf weeds farmers are advised to spray, Bispyribac Sodium 10% E.C. @ 80 ml/acre or Ethoxysulfuron 15% WDG @ 40gram acre at 3 to 4 leaf stage by mixing in 200litre of water. If only broad leaf weeds and sedges are dominant in the field spray ready mix Metsulfuron methyl 10%+ Chlorimuron ethyl 10% WP @ 8gram /acre at 20-25 DAT by mixing in 200 litre of water."
    },
    "SUGARCANE": {
      "advisory": "Sett Rot management To manage sett rot disease after planting basal drenching with Carbendazim 12% + Mancozeb 63% @ 400-gram/acre or foliar spray with Metalaxyl 8% + Mancozeb 64% WP @ 400-gram/acre by mixing in 200-litre of water."
    },
    "BLACKGRAM AND GREENGRAM": {
      "advisory": "Aphid To control aphids during primary stage of pest infestation spray Neem Based Pesticide (Azadirachtin) 1500 PPM @ 600 ml/acre. Then spray Thiamethoxam 25% W.G @ 40 gram/acre or Acetamiprid 20% S.P. @ 50 gram/acre or Imidacloprid 17.8% SL @ 60-ml/acre by mixing in 200 litres of water."
    },
    "COLE CROPS": {
      "advisory": "Alternaria Leaf Spot There are chances of Alternaria leaf spot disease incidence in Cole crops due to current cloudy weather condition. To control this disease in Cole crops spray Mancozeb 75 % WP @ 600-gram/acre or carbendazim 12 % + Mancozeb 63 % WP @ 400-gram/acre by mixing in 200-litre of water."
    },
    "TOMATO & BRINJAL": {
      "advisory": "Whiteflies To manage whiteflies pest in Tomato and Brinjal crop, use yellow sticky traps @ 8-10/acre to attract and kill the insects. During primary stage of pest infestation spray neem-based pesticide (Azadirachtin) 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. To manage this pest chemically spray Thiamethoxam 25 % WG @ 40-gram/acre or Pyriproxifen 10% EC @ 200-ml/acre or Spiromesifen 22.9% SC @ 250-ml/acre by mixing in 200- litre of water."
    },
    "POULTRY": {
      "advisory": "Sleeping disease of poultry has been found. Vaccinate the chicks with Lasota at 7 days and with IBD vaccines within 13-15 days."
    }
  },
  "date": "06-02-2024"
}