{
   "weather_details": {
      "10-02-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 19,
         "rh_max": 47,
         "rh_min": 21,
         "wind_speed": 8,
         "wind_direction": 90,
         "cloud_cover": 0
      },
      "11-02-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 19,
         "rh_max": 51,
         "rh_min": 18,
         "wind_speed": 7,
         "wind_direction": 72,
         "cloud_cover": 0
      },
      "12-02-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 20,
         "rh_max": 50,
         "rh_min": 17,
         "wind_speed": 7,
         "wind_direction": 90,
         "cloud_cover": 7
      },
      "13-02-2024": {
         "rainfall": 5,
         "t_max": 28,
         "t_min": 21,
         "rh_max": 58,
         "rh_min": 19,
         "wind_speed": 7,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "14-02-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 64,
         "rh_min": 19,
         "wind_speed": 8,
         "wind_direction": 161,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "sugarcane",
      "blackgram",
      "rapeseed & mustard",
      "cucurbits",
      "tomato & brinjal"
   ],
   "general_advisory": "Rice Farmers are advised to give necessary irrigation to field & vegetable crops. Sugarcane farmers should remove disease & pest infected plants and dispose properly. Blackgram farmers should spray recommended pesticides to reduce disease incidence. Rapeseed & Mustard farmers should control pests through proper spraying. Vegetable farmers should sow recommended seeds and apply necessary treatments. Pisciculture advice includes feeding fishes daily with specific mixture. Animal Science advisory includes providing mineral mixture and wheat grains in winter.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers those have completed transplanting, apply herbicide Bensulfuron-methyl + Pretilachl after 5-8 days after transplanting.",
            "Complete the transplanting of summer rice with basal application of specific fertilizers.",
            "In bacterial blight endemic areas, dip the seedling roots in Plantomycin solution before transplanting."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Remove disease & pest infected plants in Ratoon crop followed by recommended fertilizer application and spraying of Fipronil.",
            "Sugarcane Sett treatment recommended for decreased diseases like Red Rot & Wilt."
         ]
      },
      "blackgram": {
         "advisory": [
            "To reduce incidence of Powdery mildew, Anthracnose & Stem rot, spraying of (Tebuconazole + Sulphur) recommended.",
            "To control aphids, spray Neem Based Pesticide initially and then Thiamethoxam or Acetamiprid as required."
         ]
      },
      "rapeseed & mustard": {
         "advisory": [
            "Control aphids by spraying Dimethoate in Mustard and Toria.",
            "To control Mustard Sawfly, Leaf Webber and Tobacco Caterpillar, spray Neem-based pesticide at early stage."
         ]
      },
      "cucurbits": {
         "advisory": [
            "Sow Recommended HYV/Hybrid of Cucurbits after treating seeds.",
            "Spray Acephate along with neem oil formulation to minimize damage by Red Pumpkin Beetle."
         ]
      },
      "tomato & brinjal": {
         "advisory": [
            "Apply Neem or Karanjaa cake to prevent wilting.",
            "Provide support for better fruit set and growth of Tomato plants.",
            "Spray Thiamethoxam or Difenthurian to control pests in vegetables."
         ]
      }
   },
   "date": "09-02-2024"
}