{
   "weather_details": {
      "10-02-2024": {
         "rainfall": 0,
         "t_max": 27,
         "t_min": 11,
         "rh_max": 40,
         "rh_min": 22,
         "wind_speed": 6,
         "wind_direction": 120,
         "cloud_cover": 0
      },
      "11-02-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 13,
         "rh_max": 38,
         "rh_min": 19,
         "wind_speed": 5,
         "wind_direction": 135,
         "cloud_cover": 1
      },
      "12-02-2024": {
         "rainfall": 5,
         "t_max": 27,
         "t_min": 14,
         "rh_max": 41,
         "rh_min": 20,
         "wind_speed": 5,
         "wind_direction": 162,
         "cloud_cover": 7
      },
      "13-02-2024": {
         "rainfall": 4,
         "t_max": 27,
         "t_min": 15,
         "rh_max": 49,
         "rh_min": 25,
         "wind_speed": 7,
         "wind_direction": 180,
         "cloud_cover": 7
      },
      "14-02-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 58,
         "rh_min": 23,
         "wind_speed": 7,
         "wind_direction": 79,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "chickpea",
      "linseed",
      "mustard",
      "vegetables",
      "flowers",
      "cow"
   ],
   "general_advisory": "According to IMD, light rainfall over the Keonjhar district is forecasted. Harvest the matured crops and store them in safe storage. Use Aluminium Phosphide (Celphos tablets) as fumigants for safe storage. Carefully monitor the field for disease and pests. Postpone the spraying activities. Make bunds to store water. Remove excess water through proper drainage channel.",
   "crops_data": {
      "chickpea": {
         "advisory": [
            "Alternaria blight in chickpea can be managed by spraying Mancozeb @ 2.5 g/lt of water or Carbendazim @ 1 g/lt of water.",
            "Avoid excessive irrigation to the crop.",
            "To control powdery mildew disease in chickpea spray with Dithane - M 45 @ 2.5 g/lt of water."
         ]
      },
      "linseed": {
         "advisory": [
            "In case of Utera/Paira cropping, apply top dressing of Urea in the pre-flowering stage.",
            "Spraying of Imidachloprid @ 2 g/lt of water can reduce the aphids population."
         ]
      },
      "mustard": {
         "advisory": [
            "Mustard are in flowering and pod filling stage.",
            "Aphids in Mustard and Toria can be controlled by spraying Dimethoate 30% EC @ 2 ml/lit."
         ]
      },
      "vegetables": {
         "advisory": [
            "Brinjal: Whitefly and aphids in brinjal can be managed by spraying Phosphamidon 40% SL @ 1.5 ml/lt of water. For fruit and shoot borer management in brinjal, spray Emamectin benzoate @ 4 g/10lt of water. Little leaf in brinjal can be controlled by spraying Methyl demeton 30 EC @ 1 ml/lt of water to control the vectors.",
            "Cauliflower: Diamond back moth in cauliflower can be managed by spraying Cartap hydrochloride @ 1 g/lt of water. Fall army worm or head borer can be controlled by spraying Emamectin benzoate 5% SG @ 4-5 g/10lt of water. Aphids in Cauliflower can be controlled by spraying Thiomethoxam 25% W.G @ 80g or Acetamiprid 20% S.P @ 30g per acre in 200 lt of water.",
            "Cabbage: To control Cabbage head borer, apply Novaluron 10% EC @ 400 ml or Spinosad 2.5% SC @ 300ml or Emamectin benzoate 5% SG @ 100g in 200lt of water and spray on leaves.",
            "Chilli: Symptoms of chilli thrips can be seen by leaf crinkles and upward curling. Spray Imidachloprid 17.8% SL @ 3 ml/10 lt of water or Emamectin benzoate 5% SG @ 4g/10 lt of water.",
            "Tomato: Remove the disease-affected leaves and twigs. Make the field clean and remove the weeds. For managing fruit borer in tomato, spray Flubendiamide 5g/10 lt of water."
         ]
      },
      "flowers": {
         "advisory": [
            "Rose: To control Thrips, aphids and leafhoppers spray Methyl demeton 25 EC @ 2 ml/lt or Carbofuran 3G @ 5 g/plant.",
            "Marigold: Mealy bug in marigold can be controlled by spraying Fish oil or resin soap @ 25 g/lt. In severe infestation, spray Dimethoate or Prophenophos @ 2 ml/lt."
         ]
      },
      "cow": {
         "advisory": [
            "Provide clean drinking water to the calves and cows.",
            "Arrange proper heat to the sheds to reduce the cold waves."
         ]
      }
   },
   "date": "09-02-2024"
}