{
   "weather_details": {
      "10-07-2024": {
         "rainfall": 10,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 81,
         "rh_min": 48,
         "wind_speed": 15,
         "wind_direction": 201,
         "cloud_cover": 8
      },
      "11-07-2024": {
         "rainfall": 3,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 48,
         "wind_speed": 16,
         "wind_direction": 202,
         "cloud_cover": 7
      },
      "12-07-2024": {
         "rainfall": 4,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 77,
         "rh_min": 44,
         "wind_speed": 14,
         "wind_direction": 204,
         "cloud_cover": 6
      },
      "13-07-2024": {
         "rainfall": 2,
         "t_max": 35,
         "t_min": 26,
         "rh_max": 74,
         "rh_min": 44,
         "wind_speed": 10,
         "wind_direction": 202,
         "cloud_cover": 6
      },
      "14-07-2024": {
         "rainfall": 12,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 77,
         "rh_min": 43,
         "wind_speed": 10,
         "wind_direction": 153,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "rice",
      "jute",
      "sugarcane",
      "vegetables",
      "pisciculture",
      "livestock"
   ],
   "general_advisory": "For Kharif paddy cultivation, use good quality seeds like -for Medium land -use Salandi, Kaling dhan -1301, Pratikhya (120-130 days), for shallow medium land -Swarna, Ranidhan, Mrunalini, MTU-1140, Kaling Dhan 1401, for Low land - Kaling Dhan 1502, Kalachampa, Kaling Dhan -1501, CR-1009 (140-145 days), for Flood affected area - Swarna sub 1, CR-1009 Sub 1.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Land preparation: Prevailing weather condition may increase the chances of BLB & Blast in nursery stage in paddy so Tricyclazole @1g/li or Plantomycin @ 1 gm/li recommended. Prepare well pulverised nursery bed for Kharif Rice. Sowing of pre-generated seeds should be done after seed treatment with Carbendazim @ 2 gm along with Plantomycin @ 1 gm per Kg seed."
         ]
      },
      "jute": {
         "advisory": [
            "Vegetative stage: Current rainy weather is favourable for attack of insect pest like semilooper, Bihari hair caterpillar and other foliage feeders. To control these insects, spray Lamba cyhalothrin 4.9CS @ 250 ml/acre."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Vegetative stage: Wrapping and propping should be done when the crop becomes 4-5 months old in medium and late duration varieties. To control early shot borer in sugarcane foliar spray of Fipronil 5SC @400 ml/acre is advised."
         ]
      },
      "vegetables": {
         "advisory": [
            "Nursery/Flowering/Fruiting: For preventing wilt, other fungal & bacterial diseases in the main field spraying of Tebuconazole @1 ml/li of water along with plantomycin @1g/li of water before 7 days of transplanting as nursery treatment recommended. Prevailing weather condition may increase the mealy bug in okra & brinjal to control this spraying of Thiamethoxam 0.4 g/l of water recommended. To control Fruit and shoot borer in Brinjal, Tomato & Okra Spray Neem based pesticide 1500ppm @600ml/acre at initial stages."
         ]
      },
      "pisciculture": {
         "advisory": [
            "Carp such as Rohu, Catla and Mrigal, which grow rapidly, should be stocked in a certain ratio of 4:3:3 to increase the benefits. Generally, a density of 5,000 fingerlings/ha is kept as a standard stocking. Groundnut oil cake and rice bran is given in same ratio @ 5% of the total biomass of stocking material. Cow dung, urea and super phosphate should be applied to increase pond quality. In 8-10 months, fishes attain their marketable size."
         ]
      },
      "livestock": {
         "advisory": [
            "If the animals have not yet been vaccinated against FMD, Haemorrhagic Septicaemia, Black Quarter, Enterotoxemia etc., these must be done. Animals should be given mineral mixture along with salt regularly and wheat grains, jaggery etc. may be provided @ 10%-20% in the daily ration during the winter season to meet the energy requirement of the animals."
         ]
      }
   },
   "date": "09-07-2024"
}