{
   "weather_details": {
      "2024-02-10": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 18,
         "rh_max": 95,
         "rh_min": 38,
         "wind_speed": 5,
         "wind_direction": 146,
         "cloud_cover": 6
      },
      "2024-02-11": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 19,
         "rh_max": 83,
         "rh_min": 28,
         "wind_speed": 4,
         "wind_direction": 161,
         "cloud_cover": 1
      },
      "2024-02-12": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 19,
         "rh_max": 63,
         "rh_min": 24,
         "wind_speed": 5,
         "wind_direction": 153,
         "cloud_cover": 1
      },
      "2024-02-13": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 18,
         "rh_max": 59,
         "rh_min": 18,
         "wind_speed": 6,
         "wind_direction": 158,
         "cloud_cover": 4
      },
      "2024-02-14": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 17,
         "rh_max": 66,
         "rh_min": 17,
         "wind_speed": 5,
         "wind_direction": 161,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "rice",
      "groundnut",
      "onion",
      "mango",
      "cow"
   ],
   "general_advisory": "The mean maximum daily temperature was 34.1°C and the mean minimum daily temperature was 17.3°C of the Gajapati district during the last week. The district received 0.7 mm of rainfall during the last week. Seedling treatment with 0.2% Chloropyriphos for 10-12 hours to control stemborer in the main field if granular insecticides have not been applied previously in the nursery. Keep bunding water in the main field of rice under late transplanting. Plan for irrigation to summer paddy and other crops observing soil moisture. Carry on intercultural operation, fertilizer, and weedicide application. Continue harvesting matured crops and keep the products in a safe place to protect them from rain. Spray insecticides or pesticides in crops as per requirement.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers those who are going for transplanting should apply 35- kg DAP, 30- kg MOP and 8-kg Urea per acre during last puddling. For sandy soil apply 35 kg DAP, 15 kg MOP and 8 kg Urea per acre during last puddling. In Zinc deficient soil apply Zinc Sulphate (21%) @ 10 kg/acre at every three years.",
            "Transplanting of 25-30 days old seedlings should be done at a spacing of 20 x15 cm, plant 2-3 seedlings per hill for high yielding varieties."
         ]
      },
      "groundnut": {
         "advisory": [
            "To control Tikka disease spray Chlorothalonil 75% WP @ 400-gram/ acre or Mancozeb 75% WP @ 600 gram/acre or Hexaconazole 5% E.C @ 300ml/acre."
         ]
      },
      "onion": {
         "advisory": [
            "To manage purple blotch and Stemphylium leaf blight disease in onion spray Mancozeb 75% WP @ 600gram/acre or Difenoconazole 25% EC @ 200ml/acre or Tebuconazole 25.9% E.C @ 100ml/acre by mixing in 200 litre of water at 15 days interval. Add a spreader or sticker for retention and spread of spray fluid on erect leaves of onion."
         ]
      },
      "mango": {
         "advisory": [
            "Due to cloudy weather there are chances of infestation of sucking pest like Mango Hoppers in Mango plant. To control mango hoppers spray Imidacloprid 17.8% SL @ 5ml/15litre of water or Thiamethoxam 25% W.G @ 3 ml/15litre of water or Acetamiprid 20% S.P. @ 4gram /15litre of water. First spray should be done at the time of panicle emergence and second spray two weeks after first spray. Application of smoke below the plants can also help in reducing the pest population."
         ]
      },
      "cow": {
         "advisory": [
            "The space left for ventilation must be closed in night, as the night temperature is expected to fall in coming days. Provide sufficient clean drinking water to animals. Don't feed wet or water soaked straw to cattle. Before feeding dry it well under Sun. Animal's shed and its floor should not remain wet and cool for longer periods of time. This may expose the animals, especially younger ones, to various ailments like pneumonia, fever, coccidiosis, diarrhea and even death in severe cases. Good ventilation must be ensured during winter. Vaccinate calves above 3 months against Food and Mouth disease."
         ]
      }
   },
   "date": "09-02-2024"
}