{
   "weather_details": {
      "11-12-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "rh_max": 85,
         "rh_min": 35,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 4
      },
      "12-12-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 16,
         "rh_max": 68,
         "rh_min": 31,
         "wind_speed": 1,
         "wind_direction": 45,
         "cloud_cover": 2
      },
      "13-12-2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 15,
         "rh_max": 68,
         "rh_min": 28,
         "wind_speed": 1,
         "wind_direction": 108,
         "cloud_cover": 1
      },
      "14-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 15,
         "rh_max": 63,
         "rh_min": 25,
         "wind_speed": 1,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "15-12-2024": {
         "rainfall": 0,
         "t_max": 29,
         "t_min": 14,
         "rh_max": 63,
         "rh_min": 22,
         "wind_speed": 1,
         "wind_direction": 63,
         "cloud_cover": 0
      }
   },
   "names_of_crops": [
      "paddy",
      "cotton",
      "arhar",
      "greengram/blackgram",
      "groundnut",
      "mustard & toria",
      "sunflower",
      "onion",
      "cauliflower & cabbage",
      "tomato",
      "rose",
      "merigold",
      "cattle & buffalo",
      "goat",
      "poultry"
   ],
   "general_advisory": "In view  of dry weather  prediction  during next five days, farmers are advised  to resume  harvesting  of matured  rice. Farmers are advised not to burn the residue of kharif paddy in the field rather try to incorporate into the soil by ploughing. To prevent damage from fog, low temperature and moisture stress, provide light irrigation to standing crops & vegetables during morning hours. Cover the vegetable nursery with polythene to avoid poor germination due to low temperature. Farmers are advised to undertake intercultural operations in vegetables to remove the weed. Application of optimum dose of fertilizers is recommended followed by irrigation in timely sown vegetables. SMS Advisory  ▪ Vaccinate animals against FMD, BQ, HS, PPR & Goat Pox.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Farmers are advised for, not to burn the residue of kharif paddy in the fields because it not only pollutes the environment but also causes the severe health (respiratory) problems. Farmers are advised to mix the residue of paddy crop in the soil. It increases the soil fertility. It can be used as mulching for deceasing soil evaporation and to conserve soil moisture.",
            "Rodent /Rats : If ‘Rodent/Rats’ problem is noticed, locate the rodent burrow in the crop field and surrounding areas. Place Aluminium Phosphide 6% tablet @ One tablet (12 gm) per burrow and seal the burrow with mud which will kill the rodents."
         ]
      },
      "cotton": {
         "advisory": [
            "Picking should be done when there is complete bursting of bolls.",
            "Dry the seed cotton on concrete floor or tarpaulin sheets to reduce the moisture to 8-10%. Store the seed cotton obtained from the 1st picking separately for getting better price.",
            "Foliar spray of liquid fertilizers like NPK -19-19-19 should be done @ 20 g/10 liters of water for better plant growth and boll development",
            "Regular monitoring of the crop to know about incidence of any new pest and diseases.  For further information, contact the IMD, Bhubaneswar, Tel.#0674 -2596116"
         ]
      },
      "arhar": {
         "advisory": [
            "Prevailing weather condition favours the following pest attack. So, recommended control measures should be followed as required.",
            "Pod borer:  To control , apply Benfuracarb 40% EC @  1lit/ac  or Deltamethrin 2.8% EC @  200 ml/ac or Spinosad 45% SC @ 60 ml/ac or Flubendiamide 39.35% SC @ 40ml/ac mixed with 200  liters of water.",
            "Pod sucking bug and Aphid:  To control , spray Thiamethoxam 25% WG @ 40g/ac or Imidacloprid 17.8% SL @ 60 ml/acre mixed with  200 liters of water."
         ]
      },
      "greengram/blackgram": {
         "advisory": [
            "Weed Management:  Apply Pendimithalin  30% EC @ 1.20 liter/acre mixed with 200 liters of water at 1-2 DAS."
         ]
      },
      "groundnut": {
         "advisory": [
            "Weed Management:  Apply Oxyflourfen 23.5% EC @ 80ml/acre mixed with 200 liters of water at 2-3 DAS.",
            "Apply Imazethapyr 10% SL @ 3ml/ltr of water within 15 DAS as early post emergence herbicide."
         ]
      },
      "mustard & toria": {
         "advisory": [
            "Weed Management:  Apply Quizalofop -ethyl 5% EC as post emergence @ 2ml /liter of water at 15-20 DAS.",
            "Undertake  intercultural operation like weeding and earthing up followed  by fertilizer application  (Urea  @ 35-40kg/ac  + MOP @ 10kg/ac ) and irrigation  at 3-week  stage."
         ]
      },
      "sunflower": {
         "advisory": [
            "Undertake  intercultural operation like weeding and earthing up followed  by 1st top dressing (Urea  @ 6-10 kg/ac ) and irrigation  at 3-week  stage.",
            "Sucking pest complex (Aphid, Hopper, Thrips & White fly):  Prevailing weather condition favours the development of sucking pests. Need based spray of Acetamiprid  20% SP  @ 50g/acre or Imidacloprid 17.8% SL @ 60 ml/acre mixed with 200 ltrs of water is recommended."
         ]
      },
      "onion": {
         "advisory": [
            "Damping off:  Application of Bavistin or Thiram @ 2g/liter of water is recommended in fifteen days interval as preventive measure of damping off."
         ]
      },
      "cauliflower & cabbage": {
         "advisory": [
            "Dimond back moth:  Spray bio insecticide Azadiractin 0.03% (300 ppm) @ 5 ml/liter of water or Beauveria bassiana 5% WP @ 800 g/acre mixed with 200 liters of water. To control chemically, spray Fipronil 5% SC @ 2ml/ltr or Chlorpyriphos 20% EC @ 4ml/ltr of water.",
            "Tobacco leaf eating caterpillar:  Spray Cyantraniliprole 10.26% OD @ 6  ml/5 ltr of water."
         ]
      },
      "tomato": {
         "advisory": [
            "In view of  high humid condition wilting may occur at this stage. Spray Mancozeb 75% WP @ 2g/ltr of water if symptom  is noticed ."
         ]
      },
      "rose": {
         "advisory": [
            "Black spot : Prevailing weather condition is favorable for black spot disease . To control, spray Copper Oxychloride  50% WP @ 3 g/lit of water."
         ]
      },
      "merigold": {
         "advisory": [
            "Flower and bud rot:  Flower and bud rot may occur in prevailing weather condition . Spray Mancozeb 75% WP @ 2g/ltr of water as control measure ."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "Farmers are requested to vaccinate their cattle  & buffalo  against FMD  through  NADCP . Farmers can increase milk production by controlling and preventing Foot and Mouth Disease (FMD)",
            "Calves of 4 - 8 months of age should be vaccinated against  Brucellosis ."
         ]
      },
      "goat": {
         "advisory": [
            "Protect Goat from chill wind and damp floors."
         ]
      },
      "poultry": {
         "advisory": [
            "Make necessary arrangements to provide heat especially to chicks during night hours to reduce the mortality rate. Make proper brooding arrangement for chicks. Keep the poultry house clean and clamp free."
         ]
      }
   },
   "date": "10-12-2024"
}