{
   "weather_details": {
      "2024-07-13": {
         "rainfall": 5,
         "t_max": 32,
         "t_min": 27,
         "rh_max": 75,
         "rh_min": 48,
         "wind_speed": 12,
         "wind_direction": 210,
         "cloud_cover": 7
      },
      "2024-07-14": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 79,
         "rh_min": 51,
         "wind_speed": 10,
         "wind_direction": 285,
         "cloud_cover": 8
      },
      "2024-07-15": {
         "rainfall": 30,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 53,
         "wind_speed": 8,
         "wind_direction": 281,
         "cloud_cover": 8
      },
      "2024-07-16": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 63,
         "wind_speed": 7,
         "wind_direction": 72,
         "cloud_cover": 8
      },
      "2024-07-17": {
         "rainfall": 10,
         "t_max": 29,
         "t_min": 23,
         "rh_max": 87,
         "rh_min": 65,
         "wind_speed": 8,
         "wind_direction": 116,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "finger millet",
      "maize",
      "rice",
      "mango"
   ],
   "general_advisory": "Incorporate well-decomposed Farm Yard Manure or cow-dung @ 8 quintals /acre during the final land preparation in direct seeded rice. As sufficient rain is expected farmers can go for sowing and nursery preparation of kharif vegetables.",
   "crops_data": {
      "finger millet": {
         "advisory": [
            "Use quality seeds like Arjuna, Kalua, Bhairavi, Chilika and seed rate is 1.5 kg for SMI methods, 2.5 Kg for line sowing and 4 kg/ac for broadcasting. Apply 10 g N and 10 g P  per sq meter of nursery. For direct sowing apply 4 t FYM/ac. The fertilizer dose is 50:25:25 kg NPK/ha. To protect from termites apply 10 kg Chlorpyriphos at final preparation of the field."
         ]
      },
      "maize": {
         "advisory": [
            "For sowing of maize seed require is 6-7kg/acre. To avoid the infestation of Fall Army Worm, treat the seeds with 4-ml Cyantraniliprole19.8%+ Thiamethoxam 19.8% FS per kg. spacing of row to row at 60 cm and plant to plant at 20 cm. Apply 55 kg of DAP  and 22-kg of potash as basal fertilizer. For chemical control of weeds in Maize, spray Atrazine 50 % W.P herbicide @ 800 g /acre by mixing it in 200 litres of water within 1-2 DAS."
         ]
      },
      "rice": {
         "advisory": [
            "In assured irrigated areas select the land for wet bed nursery close to source of irrigation water with good drainage facilities. It is advisable to follow community nursery approach at village level. Divide nursery area into smaller plots of 1.5-metre-long, 10 cm height and convenient length. Irrigation channels of size 30 cm in width should be made along the beds for irrigation/drainage. Sprouted Seeds should be sown @ 40-50 g/ m2 area of seed bed by line sowing with 5 cm gap between each line or direct broadcasting and put dried compost over seeds."
         ]
      },
      "mango": {
         "advisory": [
            "Time is the optimum for mango planting. Grow Baiganpalli, Totapuri, Bombay green, Suvarnarekha, Neelam, Himsagar , Langra, Dusheri, Amrapalli, Mallika, Ratna, Rummani, Sindhu, Alphanso and Keshar , etc. Plant the seedlings in 1x1x1 m pit at 05x05 m distance. Before planting apply 80:100:60 g of NPK and two baskets of compost/pit"
         ]
      }
   },
   "date": "12-07-2024"
}