{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 15,
         "t_max": 30,
         "t_min": 21,
         "rh_max": 90,
         "rh_min": 55,
         "wind_speed": 8,
         "wind_direction": 63,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 87,
         "rh_min": 58,
         "wind_speed": 9,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 23,
         "rh_max": 84,
         "rh_min": 63,
         "wind_speed": 14,
         "wind_direction": 243,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 81,
         "rh_min": 62,
         "wind_speed": 21,
         "wind_direction": 248,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 78,
         "rh_min": 55,
         "wind_speed": 22,
         "wind_direction": 248,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "rice",
      "maize",
      "vegetable crops",
      "animal husbandry"
   ],
   "general_advisory": "Farmers are advised to avoid irrigation during periods of rainfall, delay transplanting of rice and planting of fruit and vegetable crops due to expected high wind speeds. Store rainwater for future use. Ensure proper deworming and vaccination of animals to prevent infectious diseases during the rainy season.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Nursery sowing should be completed by end of 2nd fortnight of July. Keep pheromone traps for monitoring infestation. Prepare main fields by puddling twice and land leveling. Apply specific basal doses based on soil type. Transplant seedlings at recommended spacing.",
            "Farmers advised to store rainwater and make provision for crop support."
         ]
      },
      "maize": {
         "advisory": [
            "Ideal sowing time for kharif maize is June 20 to end of July. Treat seeds before sowing. Implement weed control measures. Avoid spraying and intercultural operations during upcoming rainfall."
         ]
      },
      "vegetable crops": {
         "advisory": [
            "Start raised bed nursery preparation for kharif vegetable crops. Ensure proper drainage. Avoid planting during periods of rainfall."
         ]
      },
      "animal husbandry": {
         "advisory": [
            "Ensure deworming and vaccination of animals. Provide clean drinking water. Avoid grazing in open places during warning period."
         ]
      }
   },
   "date": "19-07-2024"
}