{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 25,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 92,
         "rh_min": 63,
         "wind_speed": 14,
         "wind_direction": 68,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 90,
         "rh_min": 58,
         "wind_speed": 11,
         "wind_direction": 90,
         "cloud_cover": 7
      },
      "22-07-2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 87,
         "rh_min": 58,
         "wind_speed": 10,
         "wind_direction": 255,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 10,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 84,
         "rh_min": 64,
         "wind_speed": 17,
         "wind_direction": 252,
         "cloud_cover": 7
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 83,
         "rh_min": 57,
         "wind_speed": 19,
         "wind_direction": 249,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "paddy",
      "sugarcane",
      "brinjal",
      "okra",
      "banana",
      "cattles",
      "goat",
      "fishery"
   ],
   "general_advisory": "In view of heavy rainfall forecast, stop sowing of seeds and top dressing of fertilizers. Make provisions for drainage where kharif maize or pulses have been sown. Cover the vegetable nursery with polythene to protect it from heavy rain and ensure proper drainage. Prevailing cloudy weather and high relative humidity conditions are favorable for pest attacks in standing crops, so regular monitoring and appropriate plant protection measures should be taken.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Transplanting of 20-25 days old seedlings should have a spacing of 20x15 cm and plant 2-3 seedlings per hill for high yielding varieties.",
            "To control weed infestation in paddy fields, use pre-emergence herbicides like Pretilachlor or Oxadiargyl."
         ]
      },
      "sugarcane": {
         "advisory": [
            "In medium and long duration sugarcane varieties, wrapping and propping should be done in 4-5 months old crop to keep the cane erect.",
            "To manage mealy bug in sugarcane crop, apply Imidacloprid or Thiamethoxam."
         ]
      },
      "brinjal": {
         "advisory": [
            "To control damping off disease of brinjal seedlings in the nursery, ensure proper drainage system.",
            "Seed treatment should be done with Trichoderma asperellum or Pseudomonas fluorescens before sowing."
         ]
      },
      "okra": {
         "advisory": [
            "After cessation of rain, spray Thiamethoxam or Acetamiprid to control sucking pests in okra.",
            "Take preventive measures against aphids, Jassids, thrips, and whiteflies in Okra due to prevailing weather conditions."
         ]
      },
      "banana": {
         "advisory": [
            "Provide staking and make provision for drainage for banana plants.",
            "To manage panama wilt, select disease-free planting material and resistant cultivars."
         ]
      },
      "cattles": {
         "advisory": [
            "During the rainy season, keep the animals indoors and feed them good quality green, dry fodder, and concentrate feed."
         ]
      },
      "goat": {
         "advisory": [
            "Deworm the goats at the onset, middle, and end of the rainy season.",
            "Vaccinate the goats against PPR disease and ET disease after one month.",
            "Clean the hooves with lime twice a week to reduce hoof ulcers during the rainy season."
         ]
      },
      "fishery": {
         "advisory": [
            "After heavy rainfall, apply disinfectant in the pond to maintain salinity levels.",
            "Erect bamboo or nylon mesh screens at inlets and outlets to prevent fish loss and entry of unwanted fish."
         ]
      }
   },
   "date": "19-07-2024"
}