{
   "weather_details": {
      "20-07-2024": {
         "rainfall": 35,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 90,
         "rh_min": 62,
         "wind_speed": 8,
         "wind_direction": 202,
         "cloud_cover": 8
      },
      "21-07-2024": {
         "rainfall": 30,
         "t_max": 30,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 67,
         "wind_speed": 10,
         "wind_direction": 245,
         "cloud_cover": 8
      },
      "22-07-2024": {
         "rainfall": 15,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 88,
         "rh_min": 74,
         "wind_speed": 14,
         "wind_direction": 243,
         "cloud_cover": 7
      },
      "23-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 83,
         "rh_min": 68,
         "wind_speed": 20,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "24-07-2024": {
         "rainfall": 5,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 81,
         "rh_min": 61,
         "wind_speed": 20,
         "wind_direction": 248,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "direct seeded paddy",
      "transplanted paddy",
      "cotton",
      "arhar",
      "hybrid maize",
      "brinjal & chilli",
      "okra",
      "onion",
      "mango",
      "papaya",
      "poultry",
      "goat & sheep"
   ],
   "general_advisory": "In view of weather forecast by IMD, farmers are advised to withhold sowing operation for the time being and to resume the sowing soon after receding of rain by utilizing available soil moisture. In view of above forecast farmers advised to avoid the application of fertilizers and pesticides in standing crops until receding of rainfall. Make arrangements for draining out excess water from the field of Maize, Arhar, Groundnut and vegetables. Harvest the matured vegetable before the impending rain. SMS Advisory: Protect the vegetable seedlings in nursery from heavy rain by covering with plastic or polythene sheet over the nursery bed.",
   "crops_data": {
      "direct seeded paddy": {
         "advisory": [
            "Weed Management: If pre-emergence herbicide has not been applied then apply Bispyribac sodium 10% SC (Nominee gold) @ 120ml/acre by mixing with 200 liters of water at 15-20 DAS or apply Fenoxaprop-p-ethyl 10% EC (Whipsuper) @240-260 ml/acre by mixing with 200 liters of water at 20-25 DAS in upland condition.",
            "Nutrient Management: Apply 26 kg urea/acre after weeding in upland condition and 36 kg urea/acre after beushening in medium and low land condition as top dressing."
         ]
      },
      "transplanted paddy": {
         "advisory": [
            "Land Preparation: Puddling should be done twice in 7-10 days interval in the main field followed by land leveling for uniform crop stand. Incorporate dhaincha green manuring crop during initial puddling of the main field. Incorporate well-decomposed FYM @ 8 q/acre during the final land preparation.",
            "Recommended dose of Fertilizer: Apply 26 kg DAP + 10 kg MOP + 10 kg ZnSO4 in upland condition and 35 kg DAP + 13 kg MOP + 10 kg ZnSO4 per acre in medium and low land condition as basal application. In boron-deficient soil apply borax @2kg/ac during final land preparation."
         ]
      },
      "cotton": {
         "advisory": [
            "Make drainage channel for draining out excess rainwater.",
            "Undertake hoeing, weeding and 1st top dressing followed by earthing up at three-week stage of cotton. Apply 26 kg urea with 20 kg MOP in hybrids and 20 kg urea with 15 kg MOP in high-yielding varieties as 1st top dressing."
         ]
      },
      "arhar": {
         "advisory": [
            "Create drainage channel to drain away excess rainwater.",
            "Hoeing, weeding followed by earthing up should be done at three-week stage."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "Develop drainage system to avoid waterlogging condition due to excess rainfall.",
            "At three-week stage go for hoeing, weeding and 1st top dressing followed by earthing up. Apply 75 kg urea as 1st top dressing."
         ]
      },
      "brinjal & chilli": {
         "advisory": [
            "Prepare raised bed nursery for Kharif vegetables like Brinjal, Chilli, etc. for timely planting.",
            "Seed rate - 200-250 g/acre.",
            "Transplant 30-45 days old seedlings in the main field.",
            "Make necessary drainage channels to prevent waterlogging condition.",
            "Identify and fill gaps in the main field to maintain plant population."
         ]
      },
      "okra": {
         "advisory": [
            "Sowing should be completed by the end of July to get a higher yield.",
            "Apply well-decomposed FYM @ 2t/acre at the time of land preparation.",
            "Seed rate - 4kg/acre. Seed should be treated with Bavistin @ 2g/kg of seed before sowing to prevent from wilting disease.",
            "Provide drainage facility to avoid waterlogging condition due to heavy rainfall."
         ]
      },
      "onion": {
         "advisory": [
            "Suitable varieties like Bhima Raj, Bhima Dark Red, Bhima Super, etc. should be selected.",
            "Raised nursery beds should be prepared under an overhead-protected structure for Kharif onion.",
            "Seed treatment, sowing, and followed by the application of paddy straw mulching is advised to obtain good seedling.",
            "Apply Chloropyriphos @ 1ml/lit of water to prevent termite infestation."
         ]
      },
      "mango": {
         "advisory": [
            "Ideal time for planting mango is July to August.",
            "Select suitable variety like, Banganpalli, Totapuri, Bombay green, Su barnarekha, Neelam, Himsagar, Langra, Dusheri, Amrapalli, Mallika, Ratna, Ramkella, Rummani, Sindhu, Alphanso, and Keshar, etc. Use healthy unbranched grafted seedlings.",
            "Plant the saplings in 1m x 1m x 1m pit at 10m x 10m distance. Apply 5kg FYM/pit before planting."
         ]
      },
      "papaya": {
         "advisory": [
            "This is suitable time for planting papaya.",
            "HYV for papaya are Honeydew, Coorg honey dew, CO-1, CO-2, Pusa delicious, Pusa majesty, and Pusa giant.",
            "Plant the seedling at 2.5m x 2.5m distance and 0.5m x 0.5m x 0.5m pit. Disease resistance and Tissue culture seedling should use. Apply a mixture of topsoil and well-rotten FYM in the pit before planting."
         ]
      },
      "poultry": {
         "advisory": [
            "Repair the poultry house to stop rainwater from getting inside. Don’t allow the litter material to get wet.",
            "Prevent the feed ingredients from getting wet which might lead to fungal growth in the feed."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "Deworm them to reduce the load of internal parasites.",
            "Dipping should be done in case of sheep against external parasites.",
            "Keep animals indoor during rainy hours and provide clean and wholesome water."
         ]
      }
   },
   "date": "19-07-2024"
}