{
   "weather_details": {
      "2024-02-21": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 19,
         "rh_max": 83,
         "rh_min": 19,
         "wind_speed": 7,
         "wind_direction": 225,
         "cloud_cover": 0
      },
      "2024-02-22": {
         "rainfall": 0,
         "t_max": 36,
         "t_min": 19,
         "rh_max": 80,
         "rh_min": 19,
         "wind_speed": 9,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "2024-02-23": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 19,
         "rh_max": 89,
         "rh_min": 27,
         "wind_speed": 10,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "2024-02-24": {
         "rainfall": 5,
         "t_max": 34,
         "t_min": 20,
         "rh_max": 82,
         "rh_min": 25,
         "wind_speed": 7,
         "wind_direction": 225,
         "cloud_cover": 6
      },
      "2024-02-25": {
         "rainfall": 15,
         "t_max": 33,
         "t_min": 20,
         "rh_max": 88,
         "rh_min": 21,
         "wind_speed": 5,
         "wind_direction": 153,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "rice",
      "groundnut",
      "brinjal",
      "tomato",
      "onion",
      "cow",
      "goat",
      "common carp",
      "chick"
   ],
   "general_advisory": "The mean maximum daily temperature was 34.7°C and the mean minimum daily temperature was 17.4°C of the Gajapati district during the last week. The district received 0.8 mm of rainfall during the last week. If rabi green gram, black gram, mustard, peas, Sunflower, etc. crops are in the harvesting stage then harvest them and also shift them to a safe place. Plan for irrigation to summer paddy and other crops observing soil moisture. Carry on intercultural operation, fertilizer, and weedicide application. Continue harvesting matured tomato, cabbage, cauliflower, and other crops. Spray insecticides or pesticides in crops as per requirement.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Farmers those who have already transplanted should apply 35 kg Urea per acre at 3 weeks after transplanting at active tillering stage for high yielding paddy varieties. In transplanted and broadcasted paddy to control grasses, sedges and broadleaf weeds farmers are advised to spray, Bispyribac Sodium 10% E.C. @ 80 ml/acre or Ethoxysulfuron 15% WDG @ 40-gram acre at 3 to 4 leaf stage by mixing in 200-litre of water. If only broad leaf weeds and sedges are dominant in the field spray ready mix Metsulfuron methyl 10% + Chlorimuronethyl 10% WP @ 8-gram /acre at 20-25 DAT by mixing in 200 litre of water. Always use flat-fan or flood-jet nozzle and clean water for herbicide spraying. Drain out excess water from paddy field before herbicide application and irrigate the field after two days of application of herbicide."
         ]
      },
      "groundnut": {
         "advisory": [
            "To manage aphids, and thrips spray Neem Based Pesticide 300 PPM @ 1-litre /acre during primary stage of infestation. If the infestation is severe than spray Thiamethoxam 25% W.G @ 40 gram/acre or Imidacloprid 17.8% SL @ 50-ml/acre by mixing it in 200 litre of water. To manage leaf miner in groundnut spray neem Based Pesticide 300 PPM @ 1-litre /acre during primary stage of infestation. To manage leaf miner chemically spray Profenophos 50% EC @ 400 ml/acre or Chlorpyriphos 50% + Cypermethrin 5 % E.C @ 400 ml/acre by mixing it in 200-litre of water. There may be chances of incidence of tikka disease in groundnut. Due to the disease incidence, black & nearly circular spots appear on the lower surface of the leaflets of infected plant. Lesions are rough in appearance. In extreme cases many lesions coalesce resulting in premature senescence and shedding of the leaflets. To manage this disease spray Chlorothalonil 75% @ 400-gram/ acre or Mancozeb 75% WP @ 600-gram/acre or Hexaconazole 5% E.C @ 300-ml/acre."
         ]
      },
      "brinjal": {
         "advisory": [
            "The larvae of brinjal shoot and fruit borer burrows into the petioles and tender shoots which results in withering of terminal shoots, drooping of leaves and shedding of flower buds. To manage the pest, remove the affected terminal shoot showing bore holes and the affected fruits. To manage this insect, install 20 nos. of pheromone trap having Leucin Lure per acre. During the primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. Go for chemical control if there is 4% withering of terminal shoot or 14% fruits infested with borers. For chemical control spray Spinosad 45 % SC @ 75- ml/acre or Emamectin Benzoate 5% SG @ 80-gram/ acre or Chlorantraniliprole 18.5 % SC @ 80-ml/acre or Spinetoram 11.7 % SC @ 200-ml /acre. Do not repeat the same insecticide. Use any of the above insecticides alternately at 15-days interval."
         ]
      },
      "tomato": {
         "advisory": [
            "The transplanted tomato crop is at fruit development to maturity (nine to twelve week) stage in the main field. There are chances of infestation of whiteflies in Tomato Crop. Both nymphs and adults of whiteflies cause direct damage by sucking sap from the underside of the plant. The damage symptoms of whiteflies in tomato are chlorotic spots, yellowing of leaves, upward curling, and finally drying of leaves. Whiteflies are also a vector of viral diseases which can result in total crop losses. To manage this pest in Tomato crop, use yellow sticky traps @ 8- 10/acre to attract and kill the insects. During the primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. To manage this pest chemically spray Thiamethoxam 25 % WG @ 40-gram/acre or Pyriproxifen 10% EC @ 200-ml/acre or Spiromesifen 22.9% SC @ 250-ml/acre by mixing in 200-litre of water. To manage fruit borer in tomato first collect and destroy the affected fruits and grown-up larvae. Set up 20 nos. of pheromone trap having Helilure per acre. During the primary stage of pest infestation spray neem-based pesticide 1500 PPM @ 600-ml/acre by mixing in 200-litre of water. Go for spraying of insecticide if there are 10% fruits infested with borer. For chemical control spray Chlorantraniliprole 18.5% S.C @ 80 -ml/acre or Flubendiamide 39.5 % M/M S.C @ 40-ml/acre or Indoxacarb 14.5% S.C. @ 200-ml/acre. For spraying of insecticides 200-litre of water per acre is required. Use any of the above insecticides alternately at 15 days interval."
         ]
      },
      "onion": {
         "advisory": [
            "The transplanted onion is at vegetative to bulb formation (six to nine week) stage. Onion being a shallow-rooted crop, needs frequent light irrigation to maintain optimum soil moisture for proper growth and bulb development. Rabi crop needs 10-15 irrigations at 7-10 days intervals depending upon the soil moisture condition. There are chances of infestation of thrips in onion crop. To manage thrips Interculture operation and irrigation should be done at regular intervals. To manage thrips during the primary stage of pest infestation spray Neem Based Pesticide 1500 PPM @ 600 ml/acre. To manage this pest chemically in onion chemically spray Thiamethoxam 25% W. G @ 40 gram/acre or Acetamiprid 20% S.P. @ 50 gram/acre by mixing in 200-litre of water. Add a spreader or sticker for retention and spread of spray fluid on erect leaves of onion."
         ]
      },
      "cow": {
         "advisory": [
            "The space left for ventilation must be closed in the night, as the night temperature is expected to fall in the coming days. Provide sufficient clean drinking water to animals. Don’t feed wet or water-soaked straw to cattle. Before feeding dry it well under the Sun. The animal’s shed and its floor should not remain wet and cool for longer periods of time. This may expose the animals, especially younger ones, to various ailments like pneumonia, fever, coccidiosis, diarrhea, and even death in severe cases. Good ventilation must be ensured during winter. Vaccinate calves above 3 months against Foot and Mouth disease."
         ]
      },
      "goat": {
         "advisory": [
            "TPPR disease also known as ‘Goat Plague’ is common during the winter. This viral disease that affects goats and sheep which causes sudden fever, pneumonia, and coughing. Affected animals appear restless, have a dull coat, dry muzzle, and depressed appetite. Pregnant animals may abort. Vaccinate the animals."
         ]
      },
      "common carp": {
         "advisory": [
            "In the prevailing winter, there is a possibility of “EUS” (Epizootic vicerative syndrome). Farmers are advised to apply “Citax” @ 400 ml with 40l of water in one-acre pond area as a preventive measure. Fishes should be provided daily oil cake bran mixture @ of 2-3%, of their biomass."
         ]
      },
      "chick": {
         "advisory": [
            "To protect the poultry from cold, cover the farm with polythene or gunny bag. Provision for 2-watt light bulb per chick to ensure their health from the cold wave."
         ]
      }
   },
   "date": "20-02-2024"
}