{
   "weather_details": {
      "21/02/2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 18,
         "rh_max": 43,
         "rh_min": 18,
         "wind_speed": 8,
         "wind_direction": 248,
         "cloud_cover": 0
      },
      "22/02/2024": {
         "rainfall": 0,
         "t_max": 35,
         "t_min": 18,
         "rh_max": 44,
         "rh_min": 15,
         "wind_speed": 10,
         "wind_direction": 238,
         "cloud_cover": 2
      },
      "23/02/2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 19,
         "rh_max": 51,
         "rh_min": 17,
         "wind_speed": 13,
         "wind_direction": 245,
         "cloud_cover": 6
      },
      "24/02/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 17,
         "rh_max": 50,
         "rh_min": 20,
         "wind_speed": 13,
         "wind_direction": 27,
         "cloud_cover": 5
      },
      "25/02/2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 16,
         "rh_max": 44,
         "rh_min": 18,
         "wind_speed": 12,
         "wind_direction": 64,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "paddy",
      "sunflower",
      "sri paddy",
      "sunner pulses"
   ],
   "general_advisory": "Due to low temperature, apply thin layer of dry FYM on nursery to maintain the temperature. Start sowing the summer crops when the temperature is conducive for germination.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "At 3 weeks of paddy, top dress with 16 kg Nitrogen per acre. After 48 hours of fertilizer application, refill the field with water and maintain 5 cm water.",
            "Water management: Paddy needs everyday 1 cm water for its optimum growth. Provide irrigation at critical stages like Jointing, Panicle growth, Anthesis, and Milking stage. At the time of Transplanting, keep nail depth water in the field. Maintain 5 cm water up to 25 days of transplanting. It will help more number of tillers."
         ]
      },
      "sunflower": {
         "advisory": [
            "At 25 to 30 days after sowing the sunflower, apply 6-8 kg nitrogen per acre. Go for thinning operation. Also complete sowing of summer sunflower in irrigated areas. Choose good varieties like MSFH 17, KBSH1, Jwalamukhi @ 2 kg seed per acre. The spacing is 60 X 30 cm. Before sowing, soak the seeds overnight for proper germination. For higher oil content, apply gypsum @ 100 kg/acre and 4 kg Borax along with basal dose of fertilizer. Apply the basal dose as 12:32: 24 kg NPK per acre. Treat the seeds with 4 g Trichoderma per kilogram seed."
         ]
      },
      "sri paddy": {
         "advisory": [
            "Transplant the 10-12 days old seedling on the main field.",
            "Applying 200 grams of mustard oil or til oil per quintal to mung blackgram reduces the risk of moth infestation."
         ]
      },
      "sunner pulses": {
         "advisory": [
            "National crops of pulses with high yield in dry season are Mung varieties like IPM-02-14 (65 days), IPM-02-3 (65 days), PDM-11 (65 days), PDM-54 (60 to 65 days), Durga (60 to 65 days), Samrat (65 to 70 days), K-851 (60 to 65 days) and Blackgram varieties like Sarla (65 to 70 days), PU-31 (70 days), PU-30 (65 to 70 days), PU-35 (65 to 70 days), PU-19 (65 to 70 days) etc. Collect and sow in the land 25 kg of seeds are required per hectare. Before sowing treat the seeds with Carbendazim @ 2 g/kg of seeds seven days before sowing. In the previous night of sowing, treat the seeds with rhizobium culture @ 20g per kg of seeds. Sow it in the spacing of 25cm X 10 cm spacing."
         ]
      }
   },
   "date": "20-02-2024"
}