{
   "weather_details": {
      "21/02/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 80,
         "rh_min": 60,
         "wind_speed": 26,
         "wind_direction": 202,
         "cloud_cover": 0
      },
      "22/02/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 83,
         "rh_min": 61,
         "wind_speed": 30,
         "wind_direction": 202,
         "cloud_cover": 1
      },
      "23/02/2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 26,
         "rh_max": 86,
         "rh_min": 68,
         "wind_speed": 29,
         "wind_direction": 202,
         "cloud_cover": 1
      },
      "24/02/2024": {
         "rainfall": 10,
         "t_max": 30,
         "t_min": 26,
         "rh_max": 85,
         "rh_min": 65,
         "wind_speed": 22,
         "wind_direction": 201,
         "cloud_cover": 7
      },
      "25/02/2024": {
         "rainfall": 5,
         "t_max": 29,
         "t_min": 24,
         "rh_max": 87,
         "rh_min": 65,
         "wind_speed": 12,
         "wind_direction": 162,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "paddy",
      "cashew",
      "cowpea",
      "cluster bean",
      "pumpkin",
      "cucumber",
      "watermelon",
      "vegetables",
      "mustard",
      "sugarcane",
      "mung",
      "biri",
      "kulthi",
      "potato",
      "groundnut",
      "blackgram",
      "greengram",
      "brinjal",
      "cole crops"
   ],
   "general_advisory": "February-March is the ideal time for sowing of Cowpea, Cluster bean, Pumpkin, Cucumber, and Watermelon. Transplanting of vegetables should be done in afternoon hour to avoid high temperature. Harvest the mustard crop as soon as the pods turn yellowish-brown. The crop is liable to shattering, hence it should be harvested just before the pods open to avoid losses. Harvest the potato crop which are at 75-85 days after planting and when majority of the leaves turn yellowish brown.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "If pre-emergence herbicides were not applied in paddy, to control weeds spray Bispyribacsodium @ 120 ml /acre at 10-12 DAS or, 2-3 leaf stage of weeds or, Penoxsulum 1.02% + Cyhalofop-butyl 5.1 % @ 800ml/acre at 15-20 DAS in 140 litres of water.",
            "PADDY (Summer): Fertilizer Application (ActiveTillering) - Farmers those who have already transplanted should apply 35 kg Urea per acre at 3 weeks after transplanting at active tillering stage for high yielding paddy varieties.",
            "Yellow Stem Borer management - To manage stem borer in paddy at an early stage of crop, apply Cartap Hydrochloride 4 % G (@ 8-kg/acre or Fipronil 0.3 % GR @ 10-kg/acre or Chlorantraniliprole 0.4 % GR @ 4-kg/acre or Imidacloprid 0.3% GR @ 6-kg/acre by mixing it with sand at 1: 1 ratio."
         ]
      },
      "cashew": {
         "advisory": [
            "For controlling stem and root borer in cashew remove the minimum width of the bark (only the damaged or tunneled portions) retaining at least 50% of the bark circumference."
         ]
      },
      "cowpea": {
         "advisory": [
            "February-March is the ideal time for sowing of Cowpea."
         ]
      },
      "cluster bean": {
         "advisory": [
            "February-March is the ideal time for sowing of Cluster bean."
         ]
      },
      "pumpkin": {
         "advisory": [
            "February-March is the ideal time for sowing of Pumpkin."
         ]
      },
      "cucumber": {
         "advisory": [
            "February-March is the ideal time for sowing of Cucumber."
         ]
      },
      "watermelon": {
         "advisory": [
            "February-March is the ideal time for sowing of Watermelon."
         ]
      },
      "vegetables": {
         "advisory": [
            "Transplanting of vegetables should be done in the afternoon hour to avoid high temperature."
         ]
      },
      "mustard": {
         "advisory": [
            "Harvest the mustard crop as soon as the pods turn yellowish-brown.",
            "Harvested crop should be stacked in a threshing floor for 5 days before threshing. After thrashing dry, the seeds in sunlight for a few days to bring the moisture content of seeds up to 8 %."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Planting of Sugarcane is under progress.",
            "SUGARCANE Sett Rot management - To manage sett rot disease after planting basal drenching with Carbendazim 12% + Mancozeb 63% @ 400-gram/acre or foliar spray with Metalaxyl 8% + Mancozeb 64% WP @ 400-gram/acre by mixing in 200-litre of water."
         ]
      },
      "mung": {
         "advisory": [
            "Harvesting of rabi paira pulses like Mung is continuing."
         ]
      },
      "biri": {
         "advisory": [
            "Harvesting of rabi paira pulses like Biri is continuing."
         ]
      },
      "kulthi": {
         "advisory": [
            "Harvesting of rabi paira pulses like Kulthi is continuing."
         ]
      },
      "potato": {
         "advisory": [
            "Harvest the potato crop which are at 75-85 days after planting and when majority of the leaves turn yellowish brown.",
            "For harvesting stop the irrigation 15 days before. All the harvested tubers should be kept in a shed for 24 hours. Remove all the damaged and rotten tubers."
         ]
      },
      "groundnut": {
         "advisory": [
            "To manage Tobacco Caterpillar pest in Groundnut, Blackgram, Greengram during primary stages of pest infestation proper surveillance should be done to collect and destroy egg mass and caterpillar of the pest. Monitor the emergence of adult moths by setting up Pheromone traps having Spodolure @ 6-8 nos/acre. Check the migration of caterpillars by dusting with Chlorpyriphos 1.5 % D @ 10 kg around the field."
         ]
      },
      "blackgram": {
         "advisory": [
            "To control aphids during the primary stage of pest infestation spray Neem Based Pesticide (Azadirachtin) 1500 PPM @ 600 ml/acre. Then spray Thiamethoxam 25% W.G @ 40 gram/acre or Acetamiprid 20% S.P. @ 50 gram/acre or Imidacloprid 17.8% SL @ 60-ml/acre by mixing in 200 litres of water."
         ]
      },
      "greengram": {
         "advisory": [
            "To control aphids during the primary stage of pest infestation spray Neem Based Pesticide (Azadirachtin) 1500 PPM @ 600 ml/acre. Then spray Thiamethoxam 25% W.G @ 40 gram/acre or Acetamiprid 20% S.P. @ 50 gram/acre or Imidacloprid 17.8% SL @ 60-ml/acre by mixing in 200 litres of water."
         ]
      },
      "brinjal": {
         "advisory": [
            "To manage little leaf in brinjal first remove and destroy the infected plant. To manage the vector of the disease spray Thiamethoxam 25 % WG @ 40-gram/acre or Flonicamid 50% WG @ 60-gram/acre or Dinotefuran 20 % SG @ 80-gram/acre."
         ]
      },
      "cole crops": {
         "advisory": [
            "To manage leaf webber and head borer pests, regular monitoring of pest infestation should be carried out. Collect and destroy the caterpillars and egg masses in the early stages of pest attack. Spray Neem based Pesticide (Azadirachtin) 300 PPM @ 1-litre /acre by mixing in 200-litre of water.",
            "To manage these pests chemically spray Tolfenpyrad 15 % EC@ 400-ml/acre or Flubendiamide 20 % WG @ 20-gram/acre or Chlorfenapyr 10 % SC @ 400-ml/acre or Spinosad 45 % SC @ 75-ml/acre by mixing in 200-litre of water."
         ]
      }
   },
   "date": "20-02-2024"
}