{
   "weather_details": {
      "2024-10-26": {
         "rainfall": 90,
         "t_max": 26,
         "t_min": 23,
         "rh_max": 89,
         "rh_min": 96,
         "wind_speed": 18,
         "wind_direction": 39,
         "cloud_cover": 8
      },
      "2024-10-27": {
         "rainfall": 20,
         "t_max": 25,
         "t_min": 23,
         "rh_max": 83,
         "rh_min": 97,
         "wind_speed": 4,
         "wind_direction": 68,
         "cloud_cover": 8
      },
      "2024-10-28": {
         "rainfall": 4,
         "t_max": 26,
         "t_min": 24,
         "rh_max": 72,
         "rh_min": 97,
         "wind_speed": 2,
         "wind_direction": 68,
         "cloud_cover": 7
      },
      "2024-10-29": {
         "rainfall": 2,
         "t_max": 28,
         "t_min": 24,
         "rh_max": 68,
         "rh_min": 96,
         "wind_speed": 0,
         "wind_direction": 90,
         "cloud_cover": 5
      },
      "2024-10-30": {
         "rainfall": 1,
         "t_max": 30,
         "t_min": 25,
         "rh_max": 59,
         "rh_min": 94,
         "wind_speed": 3,
         "wind_direction": 220,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "rice",
      "green gram",
      "horticulture",
      "french bean",
      "banana",
      "papaya",
      "coconut",
      "others (soil / land preparation)"
   ],
   "general_advisory": "Keep the harvested paddy and non-paddy crops in a safe and waterproof place to avoid rainfall and high wind speed. Go for plucking of flowers to avoid deterioration of flower quality. Make strong wooden support for papaya and banana plants to avoid lodging. Harvest the mature vegetables. Make strong support for trailing-type vegetables. Avoid spraying of pesticides during this period. Don't let the domestic animals outside during this period. Make provision of fodder and clean drinking water for 2-3 days. Don't tie cattle under trees or near any big trees.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Make a path at an interval of 10 feet for better drainage of rainwater.",
            "Spray 2% salt solution (20gm salt in 1 liter water) in the place where the harvesting of matured rice grain is not possible. It is used to prevent the germination of rice grain.",
            "When there is 80-85% ripening in rice grain in the panicle, harvest the crops and store in a safe place.",
            "Safely place the harvested grain from the rice field.",
            "Harvested straw should be kept in a proper way.",
            "Take necessary action to protect the rice grain in godown (mandi) from rain."
         ]
      },
      "green gram": {
         "advisory": [
            "Aftercare in pulses (Pigeon pea, green gram, black gram). Make provision for drainage.",
            "Spray 1.5% chloropyriphos or 0.4% fenovalarate into the ridges to check the spreading of black-headed caterpillar pest to other fields in pulse crop.",
            "In green gram/black gram, there is a chance of infestation of leaf-eating caterpillar and black-headed caterpillar.",
            "To control from this, spray a mixture of 2 m.l profenophos 50%EC or 2 ml quinalphos 25%EC or 1 ml dichlorovos 76%EC per liter of water @200 liters per acre during the afternoon."
         ]
      },
      "horticulture": {
         "advisory": [
            "Make provision for drainage.",
            "If seedlings of brinjal or tomato set topple by means of rain, straighten them by staking and earthing up.",
            "Spray 1.5gm streptocycline + 3gm copper oxychloride per liter water to the root zone for wilting in brinjal and tomato, 200 liters mixture required for one acre."
         ]
      },
      "french bean": {
         "advisory": [
            "Make provision for drainage.",
            "Spray 0.4 ml flubendiamide 39.35%SC/liter, there is a requirement of 200-liter insecticide for the attack of hairy caterpillar.",
            "If cercospora leaf spot is seen, then spray 1ml difenoconazole 25%EC or 2gm carbendazim 12% + mancozeb 63%WP (2gm)/1 liter water. 200-liter mixture is required to spray 1 acre."
         ]
      },
      "banana": {
         "advisory": [
            "Make provision for drainage.",
            "To control from sigatoka leaf spot spray 2 gm carbendazim 12% + mancozeb 63%WP or chlorothalonil 75%WP per liter of water."
         ]
      },
      "papaya": {
         "advisory": [
            "Make provision for drainage.",
            "Spray 0.3 ml imidachloprid 17.8%SL or 0.3 gm thiomethoxam 25%WG per liter of water to prevent from mealybug and aphid."
         ]
      },
      "coconut": {
         "advisory": [
            "To control from the infestation of red palm weevil, apply carbendazim 3%G + sand 1:1 ratio in the hole of the stem and plug the hole.",
            "To control from Rhinoceros beetle, clean the nearby compost yard of the coconut garden and disinfect it by applying 1.5% chloropyriphos dust."
         ]
      },
      "others (soil / land preparation)": {
         "advisory": [
            "Adequate drainage facilities in the nursery beds should be provided.",
            "When it is raining, cover the nursery bed with white polythene film, avoid black polythene cover as the seedlings grow tall under it.",
            "If seed sowing is not done, then sow the seeds after seed treatment and by measuring appropriate soil moisture.",
            "Apply 2gm metalaxyl 8% + mancozeb 64% or 1gm captan 70% + hexaconazole 5%WP / 1 liter water after rain for collar rot in seedlings."
         ]
      }
   },
   "date": "25-10-2024"
}