{
   "weather_details": {
      "29/06/2024": {
         "rainfall": 15,
         "t_max": 34,
         "t_min": 26,
         "rh_max": 74,
         "rh_min": 56,
         "wind_speed": 21,
         "wind_direction": 207,
         "cloud_cover": 8
      },
      "30/06/2024": {
         "rainfall": 10,
         "t_max": 32,
         "t_min": 26,
         "rh_max": 71,
         "rh_min": 58,
         "wind_speed": 25,
         "wind_direction": 225,
         "cloud_cover": 8
      },
      "01/07/2024": {
         "rainfall": 3,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 69,
         "rh_min": 60,
         "wind_speed": 26,
         "wind_direction": 243,
         "cloud_cover": 7
      },
      "02/07/2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 74,
         "rh_min": 61,
         "wind_speed": 26,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "03/07/2024": {
         "rainfall": 2,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 69,
         "rh_min": 51,
         "wind_speed": 27,
         "wind_direction": 246,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "paddy",
      "maize",
      "sugarcane",
      "papaya",
      "poultry"
   ],
   "general_advisory": "For better agricultural benefits use, OUAT KALINGA products (Seedlings, Saplings & QPM, Tissue Culture Plants, Fruits & Vegetables, Value Added Products, Fingerlings/Yearlings, Poultry chicks, Breeds, Mushroom & Spawn, Bio-Fertilizer, Bio-Pesticides, Vermi & VermiCompost, and Farm Implements).",
   "crops_data": {
      "paddy": {
         "advisory": [
            "For paddy cultivation, always use certified seeds. Germination test is advisable before sowing.",
            "Use 24-30 kg of paddy seeds/acre for broadcasting and 12-16 kg seeds/acre for sowing by seed drill depending on the test weight of the seed.",
            "For one-acre area of paddy transplanting, 400 m2 (10 Decimal) size of land is required for nursery raising.",
            "Incorporate the dhaincha green manuring crop at the time of initial puddling of the main field.",
            "Apply full dose of Phosphorus and Potash @ 12kg each/acre (preferably 75 kg SSP or 27 kg DAP + 20 kg MOP) as band placement behind the plough or by fertilizer cum seed drill in upland rice as basal dose.",
            "Arhar can be grown as an intercrop in groundnut at 6:2 row ratio (Groundnut: Arhar) for more profit and soil health management.",
            "In okra for providing resistance against infestation of sucking pests at an early stage of the crop, treat the seed with imidacloprid.",
            "Before sowing, paddy seeds should be treated with Trichoderma powder formulation @ 10g/kg of seeds or any other seed treating chemicals like Thiram 75% @ 3 gm or Captan 50% @ 3 gm per kg of seeds procured from the Government approved agencies.",
            "Farmers are advised to go for sowing in sufficient soil moisture (if the rainfall more than 75mm for the preceding week).",
            "Sow the paddy seeds in line, preferably with seed drill or three tine cultivator-cum-seed drill or behind the country plough at 15 x 15 cm or 20 x 10 cm spacing. Seed should be placed at a depth of 4-6 cm."
         ]
      },
      "maize": {
         "advisory": [
            "Seed rate for maize is 6-7kg/acre.",
            "To avoid the infestation of Fall Army Worm, treat 1-kg seeds with 4-ml Cyantraniliprole19.8% + Thiamethoxam 19.8% FS.",
            "Keep row to row spacing at 60 cm and plant to plant at 20 cm.",
            "To maintain optimum plant population, use a seed drill for sowing or sow the seeds behind the plough.",
            "Apply 55 kg of DAP and 22-kg of potash as basal fertilizer.",
            "For chemical control of weeds in Maize, spray Atrazine 50 % W.P herbicide @ 800 g /acre by mixing it in 200 litres of water within 1-2 DAS."
         ]
      },
      "sugarcane": {
         "advisory": [
            "Early shoot borer management - There are chances of early shoot borer infestation in sugarcane crop.",
            "Collect and destroy the egg masses manually.",
            "In furrow, apply Fipronil 0.3% GR @ 10 kg/acre at the time of the first earthing up.",
            "In case of severe infestation spray Fipronil 5 % SC @ 600ml/acre or Profenophos 50% EC @ 400ml/acre or Chlorantraniliprole 18.5 % SC @ 150 ml/acre by mixing it in 200-litre of water."
         ]
      },
      "papaya": {
         "advisory": [
            "Now the weather is optimum for planting of Papaya.",
            "HYV for papaya are Honeydew, Coorg honey dew, CO-1, CO-2, Pusa delicious, Pusa majesty, and Pusa giant.",
            "Plant the seedling at 2.5 x 2.5-meter distance and 0.5 x 0.5 x 0.5-meter pit.",
            "Disease resistance and Tissue culture seedling should be used."
         ]
      },
      "poultry": {
         "advisory": [
            "During the rainy season, make provision to ensure proper ventilation by allowing an opening of 1-2 ft at the top of side curtains during the day and the side walls of the empty shed should be completely covered with polythene curtains.",
            "The drainage ditch around the shed should be clear to avoid insect pest attack and in the roofs, the side overhangs should be a minimum of 3 to 4 ft to prevent entry of direct rainwater into the shed.",
            "Deworming and vaccination of poultry birds against ranikhet disease must be ensured."
         ]
      }
   },
   "date": "28-06-2024"
}