{
   "weather_details": {
      "2024-06-29": {
         "rainfall": 30,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 72,
         "rh_min": 52,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "2024-06-30": {
         "rainfall": 15,
         "t_max": 31,
         "t_min": 24,
         "rh_max": 72,
         "rh_min": 54,
         "wind_speed": 12,
         "wind_direction": 248,
         "cloud_cover": 8
      },
      "2024-07-01": {
         "rainfall": 4,
         "t_max": 32,
         "t_min": 25,
         "rh_max": 75,
         "rh_min": 57,
         "wind_speed": 14,
         "wind_direction": 246,
         "cloud_cover": 7
      },
      "2024-07-02": {
         "rainfall": 2,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 74,
         "rh_min": 56,
         "wind_speed": 13,
         "wind_direction": 248,
         "cloud_cover": 6
      },
      "2024-07-03": {
         "rainfall": 1,
         "t_max": 33,
         "t_min": 27,
         "rh_max": 74,
         "rh_min": 58,
         "wind_speed": 13,
         "wind_direction": 246,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "rice",
      "goat",
      "common carp",
      "green manuring crops"
   ],
   "general_advisory": "Light to moderate rain is expected farmers can go for the sowing of kharif crops in appropriate soil moisture conditions. For one-acre area of paddy transplanting 400 m2 (10 Decimal) size of land is required for nursery raising. Before sowing, paddy seeds should be treated with Trichoderma powder formulation@10g/kg of seeds or any other seed treating chemicals like Thiram 75% @ 3 gm or Captan 50% @ 3 gm per kg of seeds procured from the Government approved agencies. Go for non-paddy crops in the upland to avoid terminal drought. Intercropping of cereals+pulses/oilseeds is recommended.",
   "crops_data": {
      "rice": {
         "advisory": [
            "In assured irrigated areas select the land for wet bed nursery close to source of irrigation water with good drainage facilities. It is advisable to follow community nursery approach at village level. Divide nursery area into smaller plots of 1.5-metre-long, 10 cm height and convenient length. Irrigation channels of size 30 cm in width should be made along the beds for irrigation/drainage. Sprouted Seeds should be sown @ 40-50 g/ m2 area of seed bed by line sowing with 5 cm gap between each line or direct broadcasting and put dried compost over seeds."
         ]
      },
      "goat": {
         "advisory": [
            "By using sand over the floor we can keep the floor dry so that the animals are kept free from different diseases. The specialty of this shed is the floor is made of bricks and cement and sand from river is spread over it by a thickness of 4-6 inches. The sand soaks the urine so that the animals can sleep over it comfortably. It is also easier to clean the faecal material over the sand floor. To keep the sand dry it is stirred upside down in 15-20 days interval. The floor space requirement for kid is 0.5, for adult 1.2, for buck and pregnant female 2 square metre floor space is necessary which is suitable for every type of shed."
         ]
      },
      "common carp": {
         "advisory": [
            "Carp such as Rohu, Catla and Mrigal, which grow rapidly, should be stocked in a certain ratio of 4:3:3 to increase the benefits. Generally, a density of 5,000 fingerlings/ha is kept as a standard stocking. Groundnut oil cake and rice bran is given in same ratio @ 5% of the total biomass of stocking material. Cow dung, urea and super phosphate should be applied to increase pond quality. In 8-10 months, fishes attain their marketable size."
         ]
      },
      "green manuring crops": {
         "advisory": [
            "Green manuring crops are sown in medium and low land conditions at 6-8 weeks before planting. Use 10 kg seeds per acre. Otherwise 6 kg/acre in case of mixed planting with paddy. Sowing time should be adjusted in such a way that the crop will attain a 5-week stage just at 7 days before transplanting. Apply all the recommended doses of phosphorous of rice (100 kg of SSP) to the field during sowing time."
         ]
      }
   },
   "date": "28-06-2024"
}