{
   "weather_details": {
      "30-10-2024": {
         "rainfall": 7,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 95,
         "rh_min": 62,
         "wind_speed": 0,
         "wind_direction": 0,
         "cloud_cover": 0
      },
      "31-10-2024": {
         "rainfall": 2,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 92,
         "rh_min": 60,
         "wind_speed": 1,
         "wind_direction": 225,
         "cloud_cover": 5
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 30,
         "t_min": 22,
         "rh_max": 91,
         "rh_min": 54,
         "wind_speed": 1,
         "wind_direction": 214,
         "cloud_cover": 5
      },
      "02-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 88,
         "rh_min": 44,
         "wind_speed": 2,
         "wind_direction": 284,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 23,
         "rh_max": 79,
         "rh_min": 38,
         "wind_speed": 1,
         "wind_direction": 315,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "paddy",
      "cotton",
      "mustard",
      "toria",
      "arhar",
      "hybrid maize",
      "brinjal",
      "chilli",
      "cattle",
      "buffalo",
      "goat",
      "sheep",
      "poultry"
   ],
   "general_advisory": "Based on the above five days weather forecast received from IMD, farmers are advised to withhold irrigation and spraying of chemicals for the next 2 to 3 days. Protect the vegetable nursery of Chilli, tomato, onion, cole crops and brinjal etc. from rain by covering with plastic or polythene sheet. Harvest the matured vegetables & pulses and store in a safe place. Field preparation should be started for rabi crops. Bunds, channels, uncultivated fields and field roads should be cleaned, by removing weeds. Now is the suitable time for sowing mustard, sarson, sunflower, field pea, carrot, radish etc. So, farmers are advised to act accordingly. Pulses like lentil/black gram/green gram can be broadcasted in the standing matured crop (Rice) one week before harvesting to utilize the residual moisture in the soil in suitable areas. Farmers are advised to transplant mature seedlings (35-40 days old) of cauliflower, cabbage, broccoli, tomato etc. in raised beds during clear weather.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "In early maturing varieties, harvest the crop when 80-85% of the grains are matured either manually by sickle or by using combine harvester or reaper. Paddy grains need to be sun-dried to 14% moisture content for consumption purpose and for seed purpose it should be dried to 12% moisture for better self-life.",
            "South-West monsoon has already withdrawn from Odisha. As the crop is at reproductive stage in most of the areas, try to provide supplemental irrigation. If feasible, apply foliar spray of KNO3 @ 5g/litre of water or water-soluble fertilizers like 13:0:45 at 5 g/litre of water or 19:19:19 at 5g/litre of water to improve plants resistance to abiotic stress.",
            "Pest Management: Infestation of BPH may be observed at this stage of paddy. If the population of Brown Planthopper (BPH) exceeds ETL (5-10 hoppers/hill), farmers are advised to undertake alternate wetting and drying technique (water should not stand in the field for a long time). If the problem still persists, spray Pymetrozine 50% WG @ 120 g/acre or Dinotefuran 20% SG @ 80 g/acre or Imidacloprid 17.8% SL @ 50 ml/acre or Buprofezin 20% + Acephate 50% WP @ 400 g/acre or Flonicamid 50% WG @ 60g/acre mixed with 200 liters of water. Avoid using nitrogenous fertilizers during infestation of BPH."
         ]
      },
      "cotton": {
         "advisory": [
            "American bollworm: For chemical control, apply Emamectin benzoate 5 % SG @ 4g or Profenophos 50 % EC @ 30 ml mixed with 10 litres of water to control American bollworm in Non-Bt cotton areas.",
            "Bacterial leaf blight: Apply Streptocycline 1.5 g + Copper Oxychloride 50% WP @ 25 g per 10 litres of water as a control measure.",
            "To control grey mildew infestation, spray Copper Oxychloride 25g + Plantomycin 10 g mixed with 10 liters of water."
         ]
      },
      "mustard": {
         "advisory": [
            "Suitable time for sowing is from Mid-October to Mid-November. Treat the seed with Thiram @ 2.5g/kg or Bavistin @ 2g/kg seed before sowing.",
            "Seed rate for Mustard 2.5 – 3 kg/acre and 1.5 -2.0 kg/acre is for Toria.",
            "Suitable variety: Mustard -Pusa bold, Pusa Jaikisan, JD-6. Toria - M 29, Anuradha, Parbati."
         ]
      },
      "toria": {
         "advisory": [
            "Suitable time for sowing is from Mid-October to Mid-November. Treat the seed with Thiram @ 2.5g/kg or Bavistin @ 2g/kg seed before sowing.",
            "Seed rate for Mustard 2.5 – 3 kg/acre and 1.5 -2.0 kg/acre is for Toria.",
            "Suitable variety: Mustard -Pusa bold, Pusa Jaikisan, JD-6. Toria - M 29, Anuradha, Parbati."
         ]
      },
      "arhar": {
         "advisory": [
            "Pest Management: Leaf webber/Leaf folder/Defoliators: These insects may be observed at this stage. Spray Profenophos 50% EC or Chlorpyriphos 50 % + Cypermethrin 5 % EC @ 2 ml/lit @ 2ml/lit of water to control.",
            "Pod borer: To control, apply neem-based pesticides Azadiractin 0.03% (300 ppm) @ 5ml/liter of water at the initial stage of infestation."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "American Cob Borer: Apply Flubendiamide 39.35 % SC @ 4 ml mixed with 10 liters of water to control infestation of American cob borer."
         ]
      },
      "brinjal": {
         "advisory": [
            "For monitoring of borer insect, farmers are advised to use pheromone trap @ 8/acre. To control chemically, spray Spinosad 45% SC @ 1.5 ml/4 liters of water or Emamectin benzoate 5% SG @ 4g/10 ltr of water or Thiodicarb 75% WP @ 2ml/ltr of water."
         ]
      },
      "chilli": {
         "advisory": [
            "Infestation of thrips has been noticed. Plants are affected by thrips if leaves curl upward.",
            "To manage thrips infestation install Blue sticky trap @ 8 nos./acre. For chemical control spray Emamectin Benzoate 5% SG @ 0.4 g/lit or Fipronil 5% SC @ 2ml/lit or Imidacloprid 17.8% SL 0.35 ml/lit of water."
         ]
      },
      "cattle": {
         "advisory": [
            "Deworm the cattle and buffalo in regular intervals and vaccinate them also.",
            "If the animal is not coming to heat even after 4 years consult with the veterinary doctors and follow the doctor's advice for the onset of puberty."
         ]
      },
      "buffalo": {
         "advisory": [
            "Deworm the cattle and buffalo in regular intervals and vaccinate them also.",
            "If the animal is not coming to heat even after 4 years consult with the veterinary doctors and follow the doctor's advice for the onset of puberty."
         ]
      },
      "goat": {
         "advisory": [
            "Regularly check animals for signs of dehydration, heat stress, and parasitic infections.",
            "Deworm animals as needed and vaccinate them against common diseases such as foot-and-mouth disease, PPR."
         ]
      },
      "sheep": {
         "advisory": [
            "Regularly check animals for signs of dehydration, heat stress, and parasitic infections.",
            "Deworm animals as needed and vaccinate them against common diseases such as foot-and-mouth disease, PPR."
         ]
      },
      "poultry": {
         "advisory": [
            "Raised platforms and deep litter systems in poultry houses help in maintaining cleanliness and temperature control.",
            "Regularly clean and disinfect the house to prevent the buildup of pathogens in the high-humidity conditions after rain.",
            "Maintain appropriate stocking density to reduce stress and prevent overheating."
         ]
      }
   },
   "date": "29-10-2024"
}