{
   "weather_details": {
      "01-06-2024": {
         "rainfall": 5,
         "t_max": 40,
         "t_min": 29,
         "rh_max": 55,
         "rh_min": 19,
         "wind_speed": 13,
         "wind_direction": 238,
         "cloud_cover": 5
      },
      "02-06-2024": {
         "rainfall": 4,
         "t_max": 40,
         "t_min": 29,
         "rh_max": 59,
         "rh_min": 22,
         "wind_speed": 16,
         "wind_direction": 216,
         "cloud_cover": 6
      },
      "03-06-2024": {
         "rainfall": 5,
         "t_max": 39,
         "t_min": 28,
         "rh_max": 60,
         "rh_min": 28,
         "wind_speed": 19,
         "wind_direction": 246,
         "cloud_cover": 6
      },
      "04-06-2024": {
         "rainfall": 1,
         "t_max": 38,
         "t_min": 26,
         "rh_max": 59,
         "rh_min": 28,
         "wind_speed": 20,
         "wind_direction": 243,
         "cloud_cover": 4
      },
      "05-06-2024": {
         "rainfall": 0,
         "t_max": 37,
         "t_min": 25,
         "rh_max": 49,
         "rh_min": 20,
         "wind_speed": 17,
         "wind_direction": 248,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "rice",
      "groundnut",
      "chilli",
      "brinjal",
      "cattle & buffalo",
      "poultry"
   ],
   "general_advisory": "Plant protection measures may be taken up when weather becomes clear. Regular surveillance work should be taken up in all crops in order to know the incidence of various insect pests, diseases and initiate the control strategies.",
   "crops_data": {
      "rice": {
         "advisory": [
            "Those summer rice is at maturity stage go for harvesting when 80 -85% grains in the panicles are matured. Keep watch for rainfall before harvesting and harvested paddy kept in a safe place.",
            "Moisture content of the rice grain should be brought down to 11 -14% for long term storage by drying under Sun for 2 -3 days.",
            "Store the harvested paddy in Super Grain bag for retaining the quality texture, colors, aroma, fragrance and taste of the commodities for longer period of time a safer place (properly stacked with suitable cover) to avoid damage.",
            "Farmers are advised for, not to burn the residue of kharif paddy in the fields because it not only pollutes the environment but also causes the severe health (respiratory) problems. Farmers are advised to mix the residue of paddy crop in the soil. It increases the soil fertility. It can be used as mulching for deceasing soil evaporation and to conserve soil moisture.",
            "Farmers are advised to get ready with seeds of kharif rice."
         ]
      },
      "groundnut": {
         "advisory": [
            "Keep watch for rainfall before harvesting and harvest the crop when plant turns yellow and leaves start drying.",
            "To avoid the aflatoxin formation, dry the pods in the sun for 4 -5 days. Repeat drying for 2 or 3 more days after an interval of 2 or 3 days to ensure complete drying. Reduce the moisture in pods to 8 -9% before storing of groundnut."
         ]
      },
      "chilli": {
         "advisory": [
            "Chances of fruit rot infestation in chilli, if observe spray Azoxystrobin 23% SC @ 1 ml or Azoxystrobin 12.5 % + Tebuconazole 12.5% SC @ 1.6 ml/litre of water.",
            "Sucking pests like aphid and white fly may attack the crops in present condition. To control it spray Imidacloprid 17.8% SL @ 0.3 ml or Dimethoate 30% EC @ 2 ml per litre of of water."
         ]
      },
      "brinjal": {
         "advisory": [
            "Wilting may be reported in tomato and brinjal field, to control it drenching with Copper oxycloride 50% WP @ 3 g and Streptomycin + Tetracycline (90+10) @ 0.15 g/litre of water.",
            "To control fruit and shoot borer in brinjal spray Azadirachtin 1% EC @ 3 ml or Emamectin benzoate 5% SG @ 0.4 g or Spinosad 45% SC 0.4 ml per litre of water. Spraying should be done during the early morning or evening hours.",
            "To control white fly infestation at initial stage Install yellow sticky trap @ 8 -10/acre. Application of Neem Based Pesticide (Azadirachtin) 1500 PPM @ 3ml/ltr of water."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "Provide shade & plenty of clean drinking water.",
            "Improve ventilation in the barn/shed. Don’t allow them to graze or work between 10 AM to 4 PM.",
            "Provide more high-quality forage & give concentrated mixture to lactating cattle and buffalo."
         ]
      },
      "poultry": {
         "advisory": [
            "Don’t overcrowd the poultry shed. Provide fan and sprinkle water 2-3 times per day if required."
         ]
      }
   },
   "date": "31-05-2024"
}