{
   "weather_details": {
      "01-06-2024": {
         "rainfall": 4,
         "t_max": 45,
         "t_min": 28,
         "rh_max": 37,
         "rh_min": 12,
         "wind_speed": 11,
         "wind_direction": 214,
         "cloud_cover": 4
      },
      "02-06-2024": {
         "rainfall": 5,
         "t_max": 45,
         "t_min": 28,
         "rh_max": 49,
         "rh_min": 17,
         "wind_speed": 15,
         "wind_direction": 225,
         "cloud_cover": 3
      },
      "03-06-2024": {
         "rainfall": 0,
         "t_max": 44,
         "t_min": 27,
         "rh_max": 47,
         "rh_min": 16,
         "wind_speed": 17,
         "wind_direction": 257,
         "cloud_cover": 5
      },
      "04-06-2024": {
         "rainfall": 1,
         "t_max": 43,
         "t_min": 26,
         "rh_max": 40,
         "rh_min": 16,
         "wind_speed": 17,
         "wind_direction": 251,
         "cloud_cover": 4
      },
      "05-06-2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 25,
         "rh_max": 38,
         "rh_min": 14,
         "wind_speed": 15,
         "wind_direction": 257,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "paddy",
      "cotton",
      "arhar",
      "hybrid maize",
      "livestock",
      "cattle & buffalo",
      "goat & sheep",
      "poultry"
   ],
   "general_advisory": "Regular monitoring for incidence of insect pest should be done as high temperature favors to multiply insect population. Make arrangement for drip irrigation with organic mulch to reduce evaporation loss in standing vegetables and fruit orchard. Considering the forecast of high day temperature in few places, farmers are advised to provide frequent irrigation to the standing crops during the evening or early morning hours and time of irrigation should be prolonged in the conventional method. Farmers are advised to undertake soil test to know the soil fertility status of their crop field prior to land preparation for Kharif crops. In view of the weather forecast, farmers are advised to keep animals and birds indoors from 10 AM to 4 PM with provision of sufficient clean drinking water. Farmers are advised to accelerate land preparation for kharif crops as monsoon is arriving early this year.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "Farmers are advised to arrange certified seeds of paddy from reliable sources like Research institutes, KVK, OUAT, Block Agriculture Office etc.",
            "Seed rate - 20kg/ac for transplanted paddy, 30 -40 kg/ac for manual direct seeding and 10 kg/ac for mechanical direct seeding.",
            "Suitable Varieties: Upland condition: Khandagiri, Sahabhagi, Jyotirmayee, Mandakini, Phalguni, Bandana, Anjali etc."
         ]
      },
      "cotton": {
         "advisory": [
            "Sowing should be completed by the end of June to get higher yield. Arrange good quality seeds from reliable sources like AICRP on Cotton, OUAT and certified dealer etc.",
            "Apply FYM or Compost @ 2 tonnes/acre or Vermicompost @1 tonne/acre uniformly over the soil before ploughing.",
            "Farmers can select Pigeon pea and green gram/black gram as intercrop @ 8:2 row proportions and 1:2 row proportions respectively."
         ]
      },
      "arhar": {
         "advisory": [
            "Arrange good quality seeds from reliable sources like Research institutes, KVK, OUAT, Block Agriculture Office etc. Sowing should be completed by the first fortnight of June to get higher yield.",
            "In termite endemic area application of Chloropyriphos dust 1.0% @ 10 Kg/ ac at the time of land preparation",
            "Apply 2 -4 tonnes of FYM per acre at the time of final land preparation."
         ]
      },
      "hybrid maize": {
         "advisory": [
            "Arrange good quality seeds from reliable sources like Research institutes, KVK, OUAT, Block Agriculture Office etc. Sowing can be done from June to the first fortnight of July.",
            "In termite endemic area application of Chloropyriphos dust 1.0% @ 10 Kg/ ac at the time of land preparation",
            "Apply 2 -4 tonnes of FYM per acre at the time of final land preparation."
         ]
      },
      "livestock": {
         "advisory": [
            "Provide shade & plenty of clean drinking water.",
            "Improve ventilation in the barn/shed. Don’t allow them to graze or work between 10 AM to 4 PM.",
            "Provide more high-quality forage & give concentrated mixture to lactating cattle and buffalo."
         ]
      },
      "cattle & buffalo": {
         "advisory": [
            "Provide shade & plenty of clean drinking water.",
            "Improve ventilation in the barn/shed. Don’t allow them to graze or work between 10 AM to 4 PM.",
            "Provide more high-quality forage & give concentrated mixture to lactating cattle and buffalo."
         ]
      },
      "goat & sheep": {
         "advisory": [
            "Don’t allow them to graze between 10 AM to 4 PM.",
            "Allow them to drink water nearby pond during grazing hours.",
            "Under prevailing weather condition, restrict from overcrowding and arrange a separate shed in case of limited space."
         ]
      },
      "poultry": {
         "advisory": [
            "Don’t overcrowd the poultry shed. Provide fan and sprinkle water 2-3 times per day if required.",
            "Provide adequate clean drinking water.",
            "The commercial poultry farmers raising broiler and layer should give them a balanced diet to avoid a decrease in production."
         ]
      }
   },
   "date": "31-05-2024"
}